{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0088526/", "name": "The Golden Girls", "image": "https://m.media-amazon.com/images/M/MV5BNDgyZDYwZTQtNzhmMS00MmU5LTgyYzEtNzAwZDNlZjkxZGMxXkEyXkFqcGdeQXVyNTE1NjY5Mg@@._V1_.jpg", "genre": ["Comedy", "Drama"], "contentRating": "TV-PG", "actor": [{"@type": "Person", "url": "/name/nm0037735/", "name": "Bea Arthur"}, {"@type": "Person", "url": "/name/nm0924508/", "name": "Betty White"}, {"@type": "Person", "url": "/name/nm0001516/", "name": "Rue McClanahan"}, {"@type": "Person", "url": "/name/nm0001268/", "name": "Estelle Getty"}], "creator": [{"@type": "Person", "url": "/name/nm0365358/", "name": "Susan Harris"}, {"@type": "Organization", "url": "/company/co0067205/"}, {"@type": "Organization", "url": "/company/co0083928/"}], "description": "The Golden Girls is a TV series starring Bea Arthur, Betty White, and Rue McClanahan. Four previously married women live together in Miami, sharing their various experiences together and enjoying themselves despite hard times....", "datePublished": "1985-09-14", "keywords": "1990s,1980s,female protagonist,female immigrant,elderly woman", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 32394, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.9"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0088526/"}, "author": {"@type": "Person", "name": "Arctic_Wizard"}, "dateCreated": "2006-01-13", "inLanguage": "English", "name": "The Best Sitcom EVER!!!!", "reviewBody": "The sweet Betty White, the glamorous Rue McClanahan, the sharp Bea Arthur and the hilarious Estelle Getty join forces to star in this unforgettable, nostalgic, utterly hilarious, warm, family comedy that entwines every feeling and emotion that us humans experience and covers it with verbal and visual comedy. \n\nAfter her husbands death, Blanche Deveraux (Rue McClanahan), a sexy, Texas southerner, advertises for two roommates to live in her smart, Floridian bungalow. After several candidates, she receives grief-councilor Rose Nyland (Betty White), an adorable, naïve widow from St. Olaf, Minnesota and Dorothy Zbornak (Beatrice Arthur), a recently divorced substitute high-school, literature teacher, from New York City. The three live together until in the pilot episode where Dorothy's witty, Sicilian mother, Sofia Petrillo (Estelle Getty) appears, after her nursing home 'burnt down'. Together, the four women live together, accompanied by sex, cheesecake, gossip, arguments and every other element that makes true friendship. \n\nIf I was ever asked what five things I'd take with me onto a tropical island \u0096 it'd be the three Golden Girls series I have on DVD, my TV and my DVD Player. The Golden Girls remains my forever favorite sitcom, simply because its true \u0096 its not fake. Its totally and utterly believable. \n\nHerb Edelman also made frequent appearances as Dorothy's sleazy ex-husband, who left her for an air hostess. As did Harold Gould as Rose's major love interest. Equipped with its famous guest appearances, including Tony Jay, Anne Haney, Polly Holiday, George Clooney, Paula Kelly, Nancy Walker, Lloyd Bochner, Murray Hamilton, Deborah May, Jeanette Nolan and Leslie Neilson. Not to mention the Special Guest Appearances \u0096 people as themselves \u0096 including Burt Reynolds, Alex Trebek and Merv Griffin this is also another key factor. \n\nI actually wrote to my two favourite Golden Girls' Betty/Rose and Rue/Blanche back in 2004 who BOTH sent back beautiful signed photos personally addressed to me. I was so happy. Since I purchased the first three series of amazon.com (I live in the UK, but own a DVD player \u0096 which, thank God, plays American DVDs), I've also grown to like Dorothy. If Bea Arthur is reading this, I am planning to write to her as well, but due to the constant worry of my upcoming GSCE's \u0096 I just haven't had time. Please, bare with me! I'd also right to Estelle but sadly due to her suffering with the dreadful Alzheimer's Disease, I can't. \n\nMy own personal top five favorites would have to be: (NOT in order) \n\n1. The Operation 2. The Actor (Dorothy \u0096 life on stage: You're a dirt bag!) 3. Pilot 4. The Heart Attack 5. The Housekeeper \n\nThe cheerful opening theme tune 'Thank You For Being a Friend' sung by a lady who's name I don't know, helps create the sense of security and joy when watching. I can't recall a storyline that wasn't profound and funny at the same time. What more can I say? I love this programe, much better than 'The Nanny' (Another favourite American sitcom of mine) and 'Will and Grace' an overrated American comedy. I'm so pleased all three won award for their treasured portrayals. I now look forward to buying series four \u0096 due to release in February 2006, so a little while to wait. \n\nA pure diamond of a show!"}, "trailer": {"@type": "VideoObject", "name": "Golden Girls: Season 2", "embedUrl": "/video/imdb/vi3504210201", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTEyNjZhNjUtODM4OC00YjIwLWFhNTctNjUxZDI0NTQyNWM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTEyNjZhNjUtODM4OC00YjIwLWFhNTctNjUxZDI0NTQyNWM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "CT #3 Post", "uploadDate": "2008-08-04T03:21:23Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0037735/?ref_=tt_cl_t1", "name": "Bea Arthur"}, "character_and_episodes": [{"url": "/title/tt0088526/characters/nm0037735?ref_=tt_cl_t1", "name": "Dorothy Zbornak"}, {"url": "#", "name": "177 episodes, 1985-1992"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001516/?ref_=tt_cl_t3", "name": "Rue McClanahan"}, "character_and_episodes": [{"url": "/title/tt0088526/characters/nm0001516?ref_=tt_cl_t3", "name": "Blanche Devereaux"}, {"url": "#", "name": "177 episodes, 1985-1992"}]}, {"actor": {"@type": "Person", "url": "/name/nm0924508/?ref_=tt_cl_t2", "name": "Betty White"}, "character_and_episodes": [{"url": "/title/tt0088526/characters/nm0924508?ref_=tt_cl_t2", "name": "Rose Nylund"}, {"url": "#", "name": "177 episodes, 1985-1992"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001268/?ref_=tt_cl_t4", "name": "Estelle Getty"}, "character_and_episodes": [{"url": "/title/tt0088526/characters/nm0001268?ref_=tt_cl_t4", "name": "Sophia Petrillo"}, {"url": "#", "name": "177 episodes, 1985-1992"}]}], "details": {"Language": ["English", "Italian", "Norwegian"], "Release Date": ["14 September 1985 (USA)"], "Also Known As": ["The Golden Girls"], "Filming Locations": ["Columbia/Sunset Gower Studios - 1438 N. Gower Street, Hollywood, Los Angeles, California, USA"], "Production Co": ["Touchstone Television", "Witt/Thomas/Harris Productions"], "Runtime": ["30 min", "(180 episodes)", "25 min", "(180 episodes)"], "Sound Mix": ["Stereo", "Dolby Digital"]}}