{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0084967/", "name": "The A-Team", "image": "https://m.media-amazon.com/images/M/MV5BMzI0MjI1NjU5OF5BMl5BanBnXkFtZTcwNzg5NDUyMQ@@._V1_.jpg", "genre": ["Action", "Adventure", "Crime"], "contentRating": "TV-PG", "actor": [{"@type": "Person", "url": "/name/nm0000577/", "name": "George Peppard"}, {"@type": "Person", "url": "/name/nm0001558/", "name": "Mr. T"}, {"@type": "Person", "url": "/name/nm0776239/", "name": "Dwight Schultz"}, {"@type": "Person", "url": "/name/nm0070767/", "name": "Dirk Benedict"}], "creator": [{"@type": "Person", "url": "/name/nm0004798/", "name": "Stephen J. Cannell"}, {"@type": "Person", "url": "/name/nm0526967/", "name": "Frank Lupo"}, {"@type": "Organization", "url": "/company/co0026580/"}, {"@type": "Organization", "url": "/company/co0046592/"}], "description": "The A-Team is a TV series starring George Peppard, Mr. T, and Dwight Schultz. Four Vietnam vets, framed for a crime they didn't commit, help the innocent while on the run from the military.", "datePublished": "1983-01-23", "keywords": "gmc vandura,1980s,cult tv,good versus evil,mercenary", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 34568, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0084967/"}, "author": {"@type": "Person", "name": "stp43"}, "dateCreated": "2004-01-30", "inLanguage": "English", "name": "You Love It When These Plans Come Together", "reviewBody": "The A-Team was one of three shows - the others being The Cosby Show and Miami Vice - that rescued NBC in the 1980s, and this mixture of action and comedy still holds up as an entertaining concoction.\n\nThe show succeeds primarily on the personalities of the cast.  George Peppard's career was drying up and looked half past dead when he was cast as flamboyant Colonel John H. \"Hannibal\" Smith; his performances gave his career the boost it otherwise would not have gotten as in the manner of Leslie Nielsen he found his niche in comedic flamboyance after nearly two decades as a straight lead or in a character role.\n\nDirk Benedict brings Starbuck to Earth (best shown in the show's most overt and best in-joke, the shot of a Cylon centurion guide at Universal Studios walking past Templeton Peck with the intimidating hum of its eye scanner added to the soundtrack) and scores again as the slightly decedent but ultimately sympathetic rogue who is the team's primary scam expert.  Peck is something of the dry-witted observor of the crazy happenings to the team during its adventures.\n\nMr. T had become a household name in Rocky III but it was The A-Team that cemented his persona with his trademark \"Shut up, fool!\" and general attitude with a heart of gold.  Bosco Arnold Baracus was always feuding with the team's pilot, Hector M. Murdoch, committed to a VA psycho ward due to insanity concocted in the Vietnam war - insanity that is just a ruse for Murdoch to better help the team.\n\nIt may seem odd to think of Dwight Schultz as a qualified Broadway performer, but his career has been in that vein, and his role of Murdoch made him a true TV star; Schultz gave Murdoch his personality but he also tempered him with believeable torment, best shown in the show's warmest episode \"Bounty,\" co-starring Schultz' reallife wife Wendy Fulton.  Murdoch can be funny, but as Wendy helps bring out in this episode, Schultz is also a qualified dramatic performer.\n\nUltimately fleshing out the show was the Gerard-esque pursuer of the team, Colonel Roderick Decker.  Lance LeGault portrayed Decker and made one of TV's best recurring villians.  Decker gained sympathy from his determination and it showed in one of the show's weaker episodes, \"Incident At Crystal Lake\" where he and his executive officer Captain Crane are attacked by four criminals and brutally beaten; no pleasure is derived from seeing Decker and Crane brutalized; if anything the viewer despises this scene precisely because the two Army officers are so humiliated.  This sympathy angle is best shown in the show's flashback episode \"Curtain Call\" where Decker has the team cornered and they offer no resistance to arrest and also in a later episode where Hannibal needs to protect the family of his client from mobsters, and the only way he can is to draw Decker into the fray. \n\n As Crane, future director Carl Franklin displays superb chemistry with LeGault throughout the run of the show, and it was a mystery when, after two episodes of the show's 1985-6 season, Crane was curiously dropped.\n\nThis is a show where everything revolves around personality.  The plots and production values are deliberately on a budget; it is the personality of the characters that drives the show and makes it work.  Hannibal always loves it when a plan comes together, B.A. is always cantankerous and terrified of flying (except, curiously, in one 1986 episode where Peck is rescued and they fly out in a helicopter), Templeton Peck always has a scam running, and Murdoch is always engagingly nuts.  \n\nAnd it all works, each episode, of a pivotal action comedy series of the 1980s."}, "trailer": {"@type": "VideoObject", "name": "The A-Team: Complete Third Season", "embedUrl": "/video/imdb/vi1554693401", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzg3OWE4ZDMtOWY2NS00ZThjLTljYjUtNzg4ZDQzMGVjOWNlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzg3OWE4ZDMtOWY2NS00ZThjLTljYjUtNzg4ZDQzMGVjOWNlXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "The A-Team: Complete Third Season", "uploadDate": "2019-03-16T18:10:46Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000577/?ref_=tt_cl_t1", "name": "George Peppard"}, "character_and_episodes": [{"url": "/title/tt0084967/characters/nm0000577?ref_=tt_cl_t1", "name": "John 'Hannibal' Smith"}, {"url": "#", "name": "97 episodes, 1983-1987"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001558/?ref_=tt_cl_t3", "name": "Mr. T"}, "character_and_episodes": [{"url": "/title/tt0084967/characters/nm0001558?ref_=tt_cl_t3", "name": "B.A. Baracus"}, {"url": "#", "name": "97 episodes, 1983-1987"}]}, {"actor": {"@type": "Person", "url": "/name/nm0776239/?ref_=tt_cl_t2", "name": "Dwight Schultz"}, "character_and_episodes": [{"url": "/title/tt0084967/characters/nm0776239?ref_=tt_cl_t2", "name": "'Howling Mad' Murdock"}, {"url": "#", "name": "97 episodes, 1983-1987"}]}, {"actor": {"@type": "Person", "url": "/name/nm0070767/?ref_=tt_cl_t4", "name": "Dirk Benedict"}, "character_and_episodes": [{"url": "/title/tt0084967/characters/nm0070767?ref_=tt_cl_t4", "name": "Templeton 'Faceman' Peck"}, {"url": "#", "name": "96 episodes, 1983-1987"}]}]}