{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0413300/", "name": "Spider-Man 3", "image": "https://m.media-amazon.com/images/M/MV5BYTk3MDljOWQtNGI2My00OTEzLTlhYjQtOTQ4ODM2MzUwY2IwXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_.jpg", "genre": ["Action", "Adventure", "Sci-Fi"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0001497/", "name": "Tobey Maguire"}, {"@type": "Person", "url": "/name/nm0000379/", "name": "Kirsten Dunst"}, {"@type": "Person", "url": "/name/nm0333410/", "name": "Topher Grace"}, {"@type": "Person", "url": "/name/nm0002006/", "name": "Thomas Haden Church"}], "director": {"@type": "Person", "url": "/name/nm0000600/", "name": "Sam Raimi"}, "creator": [{"@type": "Person", "url": "/name/nm0000600/", "name": "Sam Raimi"}, {"@type": "Person", "url": "/name/nm0706898/", "name": "Ivan Raimi"}, {"@type": "Person", "url": "/name/nm0765091/", "name": "Alvin Sargent"}, {"@type": "Person", "url": "/name/nm0000600/", "name": "Sam Raimi"}, {"@type": "Person", "url": "/name/nm0706898/", "name": "Ivan Raimi"}, {"@type": "Person", "url": "/name/nm0498278/", "name": "Stan Lee"}, {"@type": "Person", "url": "/name/nm0228492/", "name": "Steve Ditko"}, {"@type": "Organization", "url": "/company/co0050868/"}, {"@type": "Organization", "url": "/company/co0051941/"}, {"@type": "Organization", "url": "/company/co0095403/"}], "description": "Spider-Man 3 is a movie starring Tobey Maguire, Kirsten Dunst, and Topher Grace. A strange black entity from another world bonds with Peter Parker and causes inner turmoil as he contends with new villains, temptations, and revenge.", "datePublished": "2007-04-03", "keywords": "spider man,villain,peter parker character,alien parasite,alien symbiote", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 502977, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0413300/"}, "author": {"@type": "Person", "name": "thecowardlylorin"}, "dateCreated": "2007-05-05", "inLanguage": "English", "name": "Spider-Man 3 is adequate, but adequate just isn't enough.", "reviewBody": "My feelings after watching the third film are somewhere in the neighborhood of satisfied, but that feeling is fairly disappointing. Satisfied more or less means adequate and to follow a sequel that I consider excellent with a film that's only adequate is a certainly a step down. Positively, Spider-Man 3 does reasonably well at maintaining a feeling similar to that of the first two films. I never felt like I wasn't seeing the same world or characters and that's important to me. Continuity in tone really helps hold a series together. The Matrix Reloaded never felt to me like I was witnessing the continuation of the story and world presented in the first installment. The scenery and characters felt like weak and dull recreations and that really bugged me. The New-York of Spider-Man 3 is about the same as before, as is Peter's apartment, The Daily Bugle offices, etc. Peter, Harry, Mary Jane, Aunt May, etc. also carry over well and it's easy to jump back into their lives. Where it doesn't feel like its predecessors is in its pacing and scope. The film tries to tell a lot of story for one film, much more than either the previous installments. This makes it messy. If you took Spider-Man 1 and 2's stories, wove them together and compressed them into one 2 hour film, you'd have a mess pretty similar to Spider-Man 3. A lot of this has to do with poor exposition and the decision to include three villains. In good exposition, events lead to other events and it all seems to flow naturally. Some films end up feeling like a story wasn't really even written, but instead a series of well-crafted scenes that don't necessarily fit well together. A bunch of smaller scenes are then written to connect those scenes. These scenes can feel very forced because they often rely heavily on coincidence. The Matrix Reloaded is full of these contrived scenes and so is Spider-Man 3. They're frustrating because they act like speed bumps where the plot suddenly feels awkward and my enjoyment of the film drops. One scene sticks out particularly in Spider-Man 3 as too awkward. Venom, one of the super-villains, is swinging through alleyways when he is ambushed by the Sandman, another villain. Venom proposes they team to get Spider-Man together, Sandman agrees, end scene. This scene is needed to set up the final, huge battle of the film but just seems poorly worked in. For one it's very short, and two the characters don't know each other and have completely different motives for being villains. That the two would decide that quickly to become partners after coincidentally running into each other is just sloppy to watch.\n\nDespite how it seems, I didn't hate the film. I was just disappointed in its flow as a narrative and thought it aimed much higher than it should have in terms of what to include plot wise. Regardless though, many scenes were very enjoyable to watch and I don't just mean action scenes. The Daily Bugle scenes, as always, were great and funny. The addition of Topher Grace as Peter's photographer rival, Eddie Brock, was great casting. His line delivery works perfectly with his character's sleazy personality and his scenes with Peter are some of the best. The character Harry Osborne returns and becomes one of the film's three villains: a new Green Goblin that takes over where the Goblin of the first film left off. Harry and Peter's relationship is probably the most interesting part of the story. Their struggle between being friends and enemies makes for some tense moments. One of my favorite scenes in the film is a verbal confrontation in a diner between Peter and Harry. Playing off Peter's presumption that he and Harry are back on good terms, Harry orchestrates a bit of nasty drama that sticks a knife in Pete's love life. He has Peter meet him in a diner just to drive the knife in a little further. As Pete storms out, Harry is awash in sadistic joy with himself before making a fast and creepy exit. Harry is really the best handled villain of the film. Not only as the Green Goblin Jr. fighting Spider-Man in the sky much the way his father did, but as Harry, Peter's estranged friend, using their friendship as a pretty sharp weapon against him. The villain I could have done without was the Sandman. His character was interesting but his place in the film as a main character seemed unnecessary and forced. He's an escaped convict running from the police who accidentally falls into a big science experiment and becomes the Sandman. He is also apparently the actual killer of Peter's uncle Ben thus giving Peter motivation to go after him. This reworking of the first film's story seems very far fetched and unnecessary. The computer effects used to create Sandman are terrific as is the performance by Thomas Hayden-Church, but I think the film would have improved without him. More time could then have been given to the conflicts with Harry and Eddie and likewise Goblin and Venom. Venom is particularly nice because he's the only villain not the product of some crazy experiment gone wrong. His creation is almost entirely Peter's fault. Venom acts as a slimy toothy grinning anti-Spider-Man, who hates Spider-Man on a personal level after Eddie Brock loses his job and girlfriend and holds Peter responsible. Two villains definitely would've been enough for one film, especially two villains that feel wronged by Peter personally, not just Peter as Spider-Man. I don't really want them to continue this series, but since it seems like they may anyway, I hope some lesson is learned with number three that less really can be more. If the time that was spent awkwardly packing too many stories into one film was instead spent working on one good story so that it flowed naturally, Spider-Man 3 could have excelled the way number two did.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT2H19M", "trailer": {"@type": "VideoObject", "name": "Spider-Man 3", "embedUrl": "/video/imdb/vi826343961", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMGYzNWJlMDEtM2MwOS00NTA3LThjMWItYmIzZjQ0MzI4MDFkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMGYzNWJlMDEtM2MwOS00NTA3LThjMWItYmIzZjQ0MzI4MDFkXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Trailer for this third installment in the superhero film series", "uploadDate": "2009-10-09T13:48:59Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0001497/?ref_=tt_cl_t1", "name": "Tobey Maguire"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0001497?ref_=tt_cl_t1", "name": "Spider-Man"}, {"url": "/title/tt0413300/characters/nm0001497?ref_=tt_cl_t1", "name": "Peter Parker"}]}, {"actor": {"@type": "Person", "url": "/name/nm0290556/?ref_=tt_cl_t3", "name": "James Franco"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0290556?ref_=tt_cl_t3", "name": "New Goblin"}, {"url": "/title/tt0413300/characters/nm0290556?ref_=tt_cl_t3", "name": "Harry Osborn"}]}, {"actor": {"@type": "Person", "url": "/name/nm0333410/?ref_=tt_cl_t5", "name": "Topher Grace"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0333410?ref_=tt_cl_t5", "name": "Venom"}, {"url": "/title/tt0413300/characters/nm0333410?ref_=tt_cl_t5", "name": "Eddie Brock"}]}, {"actor": {"@type": "Person", "url": "/name/nm0365281/?ref_=tt_cl_t7", "name": "Rosemary Harris"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0365281?ref_=tt_cl_t7", "name": "May Parker"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000342/?ref_=tt_cl_t9", "name": "James Cromwell"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0000342?ref_=tt_cl_t9", "name": "Captain Stacy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0048414/?ref_=tt_cl_t11", "name": "Dylan Baker"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0048414?ref_=tt_cl_t11", "name": "Dr. Curt Connors"}]}, {"actor": {"@type": "Person", "url": "/name/nm0132257/?ref_=tt_cl_t13", "name": "Bruce Campbell"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0132257?ref_=tt_cl_t13", "name": "Maître d'"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001646/?ref_=tt_cl_t15", "name": "Ted Raimi"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0001646?ref_=tt_cl_t15", "name": "Hoffman"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000379/?ref_=tt_cl_t2", "name": "Kirsten Dunst"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0000379?ref_=tt_cl_t2", "name": "Mary Jane Watson"}]}, {"actor": {"@type": "Person", "url": "/name/nm0002006/?ref_=tt_cl_t4", "name": "Thomas Haden Church"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0002006?ref_=tt_cl_t4", "name": "Sandman"}, {"url": "/title/tt0413300/characters/nm0002006?ref_=tt_cl_t4", "name": "Flint Marko"}]}, {"actor": {"@type": "Person", "url": "/name/nm0397171/?ref_=tt_cl_t6", "name": "Bryce Dallas Howard"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0397171?ref_=tt_cl_t6", "name": "Gwen Stacy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0799777/?ref_=tt_cl_t8", "name": "J.K. Simmons"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0799777?ref_=tt_cl_t8", "name": "J. Jonah Jameson"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000622/?ref_=tt_cl_t10", "name": "Theresa Russell"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0000622?ref_=tt_cl_t10", "name": "Emma Marko"}]}, {"actor": {"@type": "Person", "url": "/name/nm0638056/?ref_=tt_cl_t12", "name": "Bill Nunn"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0638056?ref_=tt_cl_t12", "name": "Joseph 'Robbie' Robertson"}]}, {"actor": {"@type": "Person", "url": "/name/nm0006969/?ref_=tt_cl_t14", "name": "Elizabeth Banks"}, "character_and_episodes": [{"url": "/title/tt0413300/characters/nm0006969?ref_=tt_cl_t14", "name": "Miss Brant"}]}]}