{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1010048/", "name": "Slumdog Millionaire", "image": "https://m.media-amazon.com/images/M/MV5BZmNjZWI3NzktYWI1Mi00OTAyLWJkNTYtMzUwYTFlZDA0Y2UwXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg", "genre": ["Drama", "Romance"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm2353862/", "name": "Dev Patel"}, {"@type": "Person", "url": "/name/nm2951768/", "name": "Freida Pinto"}, {"@type": "Person", "url": "/name/nm0795661/", "name": "Saurabh Shukla"}, {"@type": "Person", "url": "/name/nm0438463/", "name": "Anil Kapoor"}], "director": [{"@type": "Person", "url": "/name/nm0000965/", "name": "Danny Boyle"}, {"@type": "Person", "url": "/name/nm0849164/", "name": "Loveleen Tandan"}], "creator": [{"@type": "Person", "url": "/name/nm0064479/", "name": "Simon Beaufoy"}, {"@type": "Person", "url": "/name/nm3139511/", "name": "Vikas Swarup"}, {"@type": "Organization", "url": "/company/co0152921/"}, {"@type": "Organization", "url": "/company/co0197272/"}, {"@type": "Organization", "url": "/company/co0028932/"}, {"@type": "Organization", "url": "/company/co0002663/"}, {"@type": "Organization", "url": "/company/co0022869/"}], "description": "Slumdog Millionaire is a movie starring Dev Patel, Freida Pinto, and Saurabh Shukla. A Mumbai teenager reflects on his life after being accused of cheating on the Indian version of \"Who Wants to be a Millionaire?\".", "datePublished": "2008-12-05", "keywords": "papadum,murder,india,non professional cast,prostitute", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 802867, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1010048/"}, "author": {"@type": "Person", "name": "bob the moo"}, "dateCreated": "2009-01-01", "inLanguage": "English", "name": "An energetic, stylish and engaging fairytale that has enough about it to cover the main weaknesses it has while you are watching", "reviewBody": "This film came to the UK on a wave of Oscar hype and critical praise and I was looking forward to see it even though the reasons \"why\" it was good seemed a bit vague to me. On one hand it seems to be set in the gritty poverty of India, with descriptions of some very unpleasant scenes but then, on the other hand it was described as being uplifting and the feel-good movie of the year. I was curious how this conflicting information resolves itself within one film without off-balancing it.\n\nThe overall sweep of the film is very much a rag-to-riches story with love being the real heart of the film even if \"money\" (or a game-show for money) is the narrative driver and essentially it is modern day fairytale. In this regard it is an excellent film because you are engaged throughout, are totally on the side of the main characters and ultimately the viewer would give anything if they could only end the film happily. In this way it is uplifting and (ultimately) a really cheering film that is worth seeing with an audience because it is one of those things that unites an audience with a common feeling of cheer and goodwill. The method of delivery really helps the plot work because it is colourful, frantic and stylish.\n\nI really enjoyed the fragmented time structure that uses the re-watching of the Millionaire questions in the police station as a trigger for flashbacks. This means we are gripped by several threads/times rather than it being a straight flow. It is not an amazingly unique device but the manner of it being put together prevents it ever being clumsy or obvious by how it transitions from one time to the other. Speaking of delivery and style, the film is understandably an Oscar contender generally thanks to its upbeat nature (after darker material last year and the current downturn in the world, Oscar probably will look for some feel-good stuff) but the areas I think it stands a great chance are those of cinematography, editing and direction. I say this because visually the film is a treat. It captures the colour of India with great camera work that puts us right in the scene. An example is the early chase through the slum, with a frantic camera, plenty of colour (in terms of palate, places and people) and a great visual style with the sun hitting the camera from above as it moves and other effective devices. With this much movement in the camera throughout the film, the editing is key in making these scenes work and it is excellent throughout \u0096 even putting the subtitles in a stylish and arresting fashion which helped sell the use of Hindi but does also match the style of the film more than standard text would have. As director Boyle delivers on all this and his use of music is great as well. It does feel like we have the grit and style of City of God but yet also the warm uplifting story of the very best the \"underdog\" genre can provide.\n\nThat it achieves this is a testament to how well the film is delivered because it does have to overcome the fact that the majority of the film presents us with a terrible world of poverty and suffering and then gradually pulls the main characters out of it. This is a problem that the delivery covers but ultimately the viewer is left with some fairly harrowing realities that haven't gone away by the end of the film. I totally understand those who love the film unquestioningly but I do agree with those that take pause on this issue and note that it is an aspect of the film that really doesn't stand up in the cold light of day. You see, it is gritty and it is unpleasant and, although not based on a true story, this is a reality in our world and to see so much of it in a film that ultimately leaves you feeling good about life and happy that everything worked out alright is not a mix that sat particularly well with me. It isn't helped by the dance number over the end credits, which involved lots of people and pushed the \"isn't everything great\" idea more than the proper conclusion of the story did. I didn't like this part of the credits for this reason and also it would have been nice to see a film based in India that didn't feel it had to \"do\" Bollywood.\n\nThe cast mostly play to the \"fairytale\" side of the film more than the grit, although the young children are very impressive in the first sections of the story. Patel took a minute to grow on me but, although not the most charismatic of performers, he is really steady as the underdog who is driven. Kapoor is a great villain, driven by a hate that says a lot about the class system in place. Pinto is stunning and has a much stronger presence than Patel. Khan works the investigation scenes well, which was important as these are where the story is told from. There are no real weak links in the performances \u0096 the fairy-tale nature of the tale means everyone has to focus on that side of it but they are still good.\n\nThe film is not as perfect as you will hear but it is still very good at what it does. It is a wonderfully stylish and slick romantic fairytale that is cheering and uplifting but of course this does give the slight problem that it is a stylish, slick and uplifting film that features horribly real images of cruelty and poverty. It doesn't manage to reconcile this but it is strong enough to make you ignore this for the vast majority of the time, leaving you tense, hopeful and weepy."}, "duration": "PT2H", "trailer": {"@type": "VideoObject", "name": "Slumdog Millionaire", "embedUrl": "/video/imdb/vi2220163097", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTQ3MjQzNzU2MV5BMl5BanBnXkFtZTgwOTEzOTYzMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTQ3MjQzNzU2MV5BMl5BanBnXkFtZTgwOTEzOTYzMzE@._V1_.jpg", "description": "The story of how impoverished Indian teen Jamal Malik became a contestant on the Hindi version of \"Who Wants to be A Millionaire?\" -- an endeavor made in  an effort to prove his love for his friend Latika, who is an ardent fan of the show.", "uploadDate": "2008-11-04T12:56:19Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm2353862/?ref_=tt_cl_t1", "name": "Dev Patel"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm2353862?ref_=tt_cl_t1", "name": "Older Jamal"}]}, {"actor": {"@type": "Person", "url": "/name/nm0438463/?ref_=tt_cl_t3", "name": "Anil Kapoor"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm0438463?ref_=tt_cl_t3", "name": "Prem"}]}, {"actor": {"@type": "Person", "url": "/name/nm1261643/?ref_=tt_cl_t5", "name": "Jeneva Talwar"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm1261643?ref_=tt_cl_t5", "name": "Vision Mixer"}]}, {"actor": {"@type": "Person", "url": "/name/nm0451234/?ref_=tt_cl_t7", "name": "Irrfan Khan"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm0451234?ref_=tt_cl_t7", "name": "Police Inspector"}]}, {"actor": {"@type": "Person", "url": "/name/nm3193597/?ref_=tt_cl_t9", "name": "Ayush Mahesh Khedekar"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm3193597?ref_=tt_cl_t9", "name": "Youngest Jamal"}]}, {"actor": {"@type": "Person", "url": "/name/nm3193299/?ref_=tt_cl_t11", "name": "Sheikh Wali"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm3193299?ref_=tt_cl_t11", "name": "Airport Security Guard"}]}, {"actor": {"@type": "Person", "url": "/name/nm3193736/?ref_=tt_cl_t13", "name": "Sanchita Choudhary"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm3193736?ref_=tt_cl_t13", "name": "Jamal's Mother"}]}, {"actor": {"@type": "Person", "url": "/name/nm3192510/?ref_=tt_cl_t15", "name": "Sharib Hashmi"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm3192510?ref_=tt_cl_t15", "name": "Prakash"}]}, {"actor": {"@type": "Person", "url": "/name/nm0795661/?ref_=tt_cl_t2", "name": "Saurabh Shukla"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm0795661?ref_=tt_cl_t2", "name": "Sergeant Srinivas"}]}, {"actor": {"@type": "Person", "url": "/name/nm0958861/?ref_=tt_cl_t4", "name": "Raj Zutshi"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm0958861?ref_=tt_cl_t4", "name": "Director"}]}, {"actor": {"@type": "Person", "url": "/name/nm2951768/?ref_=tt_cl_t6", "name": "Freida Pinto"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm2951768?ref_=tt_cl_t6", "name": "Older Latika"}]}, {"actor": {"@type": "Person", "url": "/name/nm3193259/?ref_=tt_cl_t8", "name": "Azharuddin Mohammed Ismail"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm3193259?ref_=tt_cl_t8", "name": "Youngest Salim"}]}, {"actor": {"@type": "Person", "url": "/name/nm3193847/?ref_=tt_cl_t10", "name": "Jira Banjara"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm3193847?ref_=tt_cl_t10", "name": "Airport Security Guard"}]}, {"actor": {"@type": "Person", "url": "/name/nm0542498/?ref_=tt_cl_t12", "name": "Mahesh Manjrekar"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm0542498?ref_=tt_cl_t12", "name": "Javed"}]}, {"actor": {"@type": "Person", "url": "/name/nm3193370/?ref_=tt_cl_t14", "name": "Himanshu Tyagi"}, "character_and_episodes": [{"url": "/title/tt1010048/characters/nm3193370?ref_=tt_cl_t14", "name": "Mr Nanda"}]}]}