{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt3007640/", "name": "Naked and Afraid", "image": "https://m.media-amazon.com/images/M/MV5BNGFiNDllNjQtNjBkMy00ZWQxLThlNDktNDBmOWU2MmFlNzExXkEyXkFqcGdeQXVyMTAwMzM3NDI3._V1_.jpg", "genre": ["Adventure", "Reality-TV"], "contentRating": "TV-14", "actor": [{"@type": "Person", "url": "/name/nm5844226/", "name": "Michael Brown"}, {"@type": "Person", "url": "/name/nm6368958/", "name": "Amanda Kaye"}, {"@type": "Person", "url": "/name/nm3473527/", "name": "E.J. Snyder"}, {"@type": "Person", "url": "/name/nm5789293/", "name": "Laura Zerra"}], "description": "Naked and Afraid is a TV series starring Michael Brown, Amanda Kaye, and E.J. Snyder. Reality show where two strangers (typically 1 male, 1female) try to survive in the wild for 21 days, naked.", "datePublished": "2013-06-23", "creator": {"@type": "Organization", "url": "/company/co0147963/"}, "keywords": "survival,wilderness,bushcraft,stranded,survivalism", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 3364, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt3007640/"}, "author": {"@type": "Person", "name": "bilromultimedia"}, "dateCreated": "2013-07-23", "inLanguage": "English", "name": "Seems More Like Gender Politics Than A Survival Experiment.", "reviewBody": "I gave this series 6 / 10 stars because the basic premise is fascinating ; \"Let's see if modern humans can survive under precisely the same conditions that our prehistoric ancestors faced\" - and also - because I really do think that it is useful in educating others on the importance of learning how to survive and make it in the absence of a grocery store or an iphone. After watching nearly all of the episodes in the series (because it clearly \"seems\" to have more redeeming social and academic value than CBS television's \"Survivor\" reality game show, and because a certain measure of voyeurism is completely natural) - I have noticed a rather statistically unacceptable trend in this exercise. Of all of the \"Adams and Eves\" that they have released nude into harshness, so far - ALL of the men have been failures at this exercise - as well as occasionally behaving in ways reminiscent of wimps, cry babies, klutzes, pompous braggers, and dullards - where - despite supposedly having extensive survival training and experience - they have nonetheless been totally faced, owned, out survived, and left behind by their female counterparts.\n\nAlthough obviously there are vast numbers of strong, powerful women out there who could probably survive in a jungle as successfully as Donald Trump can turn over real estate - I find it hard to believe - given human history, that they (men) could come out looking this pathetic - this often - in comparison to their female counterparts. Don't get me wrong - I am, in fact, NOT a Neanderthal - but with apologies to all radical, militant, man hating, ultrafeminist, penis envying neurotics out there - history didn't turn out this way. Sorry to some of you ladies (and some of you gentlemen as well - sadly) if I have offended you personally by being a tad bit factual.\n\nThis seems to me to be yet another male bashing campaign, like the animated works of Seth Mcfarlane and Matt Groenig (who are ironically men - go figure - their shows are still funny though), and almost every situation comedy made after the close of the Norman Lear era of Television. This \"experiment\" seems so totally rigged and stacked - that it feels like loaded dice in a back alley craps game. As a male - I can't help but feel like I'm watching my gender get slammed yet again. \n\nThis program seems like militant feminist propaganda. It reinforces a viewpoint that we men are all childish idiots - or at least weaker and less capable, therefore inferior. Either that - or casting must be getting their male participants from areas where no one's ever heard of a football, or the ground water is seriously tainted.\n\nMaybe future episodes will be more even keeled and balanced - but in a way - I seriously doubt it.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "trailer": {"@type": "VideoObject", "name": "Naked And Afraid", "embedUrl": "/video/imdb/vi2754985241", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNzk0MzNkOTYtMjdmNS00YjhhLTg4MmEtZDEzYTk3MTVlN2E1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNzk0MzNkOTYtMjdmNS00YjhhLTg4MmEtZDEzYTk3MTVlN2E1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "Naked And Afraid", "uploadDate": "2019-04-09T16:57:30Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm5844226/?ref_=tt_cl_t1", "name": "Michael Brown"}, "character_and_episodes": [{"url": "/title/tt3007640/characters/nm5844226?ref_=tt_cl_t1", "name": "Narrator"}, {"url": "#", "name": "120 episodes, 2013-2021"}]}]}