{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0096256/", "name": "They Live", "image": "https://m.media-amazon.com/images/M/MV5BMTQ3MjM3ODU1NV5BMl5BanBnXkFtZTgwMjU3NDU2MTE@._V1_.jpg", "genre": ["Action", "Horror", "Sci-Fi", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0684929/", "name": "Roddy Piper"}, {"@type": "Person", "url": "/name/nm0202966/", "name": "Keith David"}, {"@type": "Person", "url": "/name/nm0001236/", "name": "Meg Foster"}, {"@type": "Person", "url": "/name/nm0002668/", "name": "George 'Buck' Flower"}], "director": {"@type": "Person", "url": "/name/nm0000118/", "name": "John Carpenter"}, "creator": [{"@type": "Person", "url": "/name/nm0625688/", "name": "Ray Nelson"}, {"@type": "Person", "url": "/name/nm0000118/", "name": "John Carpenter"}, {"@type": "Organization", "url": "/company/co0035544/"}, {"@type": "Organization", "url": "/company/co0324578/"}], "description": "They Live is a movie starring Roddy Piper, Keith David, and Meg Foster. They influence our decisions without us knowing it. They numb our senses without us feeling it. They control our lives without us realizing it. They live.", "datePublished": "1988-11-04", "keywords": "anti consumerism,brainwashing,alien,sunglasses,materialism", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 111365, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0096256/"}, "author": {"@type": "Person", "name": "Jeremy_Urquhart"}, "dateCreated": "2020-04-20", "inLanguage": "English", "name": "The Citizen Kane of B-movies", "reviewBody": "They Live is an example of a perfect B-movie, perhaps my personal favourite B-grade film of all time (with perhaps the exception of 1978's Dawn of the Dead, although I like to think of that as more a \"B+\" movie). Make no mistake though- this doesn't mean I think it's a perfect film- it has its flaws, quite a few actually, but all are acceptable in the context of a low-budget B-movie.\n\nThe basic plot is absurd, so please excuse the probably awkward explanation of it: They Live is about a homeless man named George Nada (played surprisingly well by Roddy Piper- a wrestler), who wanders around Los Angeles looking for work and trying to get by in life. One day he comes across a pair of sunglasses that allow him to see that the whole world has apparently been blind to the fact that aliens have taken over the Earth and are controlling the entire human population through subliminal messages. While wearing the glasses, Nada can directly see the subliminal messages behind billboards lining the streets of LA- they literally read phrases like \"NO INDIVIDUAL THOUGHT\" and \"OBEY\" when seen through the glasses. Furthermore, the glasses allow Nada to see beyond the disguises the aliens wear- without viewing them through the glasses, the aliens look identical to humans.\n\nOnce Nada acquires the glasses, he makes it a personal mission of his to shut down the TV station where the aliens are broadcasting much of their controlling messages from- he also finds out that destroying this station will allow all humans to see directly through the disguises of the alien invaders. Oh, and along the way he kills a bunch of aliens with a carefree attitude that many action heroes of the 80s possessed. And it's a heap of fun to watch him do so.\n\nIf the plot sounds a little silly, it's because it is, but thankfully the film never takes itself too seriously, with its metaphorical tongue being almost constantly planted in its metaphorical cheek. That being said, there is an element of satire to the film which keeps it from being just a mindlessly over-the-top 80s action flick, with clear parallels being made between how the aliens in the film control the population and how the media in real life often wield controlling power over the masses. It's interesting to think about such things briefly, and it's kind of cool that there is a message in the film to ponder, but it's not the film's main focus, and therefore it never feels preachy. It's a little like Romero's Dawn of the Dead in that regard- that film created a parallel between the mindless hordes of zombies and the mindless hordes of individuals who flock to shopping centres, but it never really got in the way of the sense of fun that the film so gleefully possessed. There's some sharp social satire in both films, but never to an overwhelming or unnecessarily pervasive extent.\n\nI would love to go into some of my favourite specific scenes, but the bulk of them happen in the second half of the film, and as I found the movie to be refreshingly unpredictable, I'd rather refrain from giving away too many details. I will just say that the first third of the movie is a little slow-going- Nada doesn't find the glasses until about half an hour in, but once he does, the film really picks up, and barely loses any steam on the way to a surprisingly poignant yet hilarious finale.\n\nThis film is quite well-known for two reasons- the first is its famous line said by Nada about chewing bubblegum and kicking ass, which was referenced in Duke Nukem 3D. It's perhaps more famous now for being said by Duke Nukem, which is a shame, but the line itself without a doubt originated from They Live. The other reason is a one-vs-one fight scene between two characters that happens about halfway through the film which goes on for a stupendously long time- probably too long, but then again its the scene's monumental length that makes it so memorable. The scene is so drawn-out it keeps on flip-flopping between being hilarious and tedious, yet it remains so fascinating to watch because of how openly excessive it is.\n\nAs I said though, the movie has its problems. The pacing's not great, being that the first 1/3 of the movie is pretty damn uneventful. The music gets a little repetitive too- John Carpenter wrote a decent enough score for the film, but he only seemed to write about 2 minutes worth of actual music, so the same theme gets repeated a lot. The film has an incredibly low budget too, and it's pretty clear throughout, but your mileage may vary on whether that's a truly bad- I kind of think it adds to the movie's charm, and therefore works in its favour. Surprisingly though, I don't have too many bad things to say about the acting. I was expecting a cringe-inducing performance from wrestler from Roddy Piper in the lead (LEAD!) role, but he's surprisingly good, and works well with the material he was given. Keith David is good as always, even if he is sort of the \"black sidekick\" (at least for part of the film). With this performance, Keith David continues to prove that he's one of the best actor's barely anyone knows the name of. The acting from the two leads in this film really is much better than you'd expect, even if it's not Oscar-worthy material or anything.\n\nSo yeah, I guess I did link this movie to Citizen Kane in the headline. Citizen Kane is almost as perfectly made as any film can be- you don't necessarily have to find it entertaining to acknowledge that. On a purely objective level, it pretty much is a masterpiece of film-making (although I always wished it had a more memorable/ iconic score- seriously, no one can hum the \"theme\" from Citizen Kane). Many people much smarter than myself have written countless words on why Citizen Kane works- see pretty much anything Roger Ebert wrote about that film if you want an idea of why the movie is so highly regarded. Citizen Kane is definitely an \"A-film,\" while They Live is a B-movie. It's nowhere near a perfect movie, but when you take into account its limitations- low budget, non-high profile actors, a smaller filmmaking crew- it's pretty fantastic. Incredibly entertaining, hilarious, unpredictable, and featuring some surprisingly good social commentary, They Live is an under-rated gem that you should seek out and watch, whether you're a B-movie fan or not.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H34M", "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0684929/?ref_=tt_cl_t1", "name": "Roddy Piper"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0684929?ref_=tt_cl_t1", "name": "Nada"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001236/?ref_=tt_cl_t3", "name": "Meg Foster"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0001236?ref_=tt_cl_t3", "name": "Holly"}]}, {"actor": {"@type": "Person", "url": "/name/nm0419273/?ref_=tt_cl_t5", "name": "Peter Jason"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0419273?ref_=tt_cl_t5", "name": "Gilbert"}]}, {"actor": {"@type": "Person", "url": "/name/nm0730164/?ref_=tt_cl_t7", "name": "Jason Robards III"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0730164?ref_=tt_cl_t7", "name": "Family Man"}]}, {"actor": {"@type": "Person", "url": "/name/nm0055794/?ref_=tt_cl_t9", "name": "Susan Barnes"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0055794?ref_=tt_cl_t9", "name": "Brown Haired Woman"}]}, {"actor": {"@type": "Person", "url": "/name/nm0104047/?ref_=tt_cl_t11", "name": "Wendy Brainard"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0104047?ref_=tt_cl_t11", "name": "Family Man's Daughter"}]}, {"actor": {"@type": "Person", "url": "/name/nm0087105/?ref_=tt_cl_t13", "name": "Susan Blanchard"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0087105?ref_=tt_cl_t13", "name": "Ingenue"}]}, {"actor": {"@type": "Person", "url": "/name/nm0105589/?ref_=tt_cl_t15", "name": "Dana Bratton"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0105589?ref_=tt_cl_t15", "name": "Black Junkie"}]}, {"actor": {"@type": "Person", "url": "/name/nm0202966/?ref_=tt_cl_t2", "name": "Keith David"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0202966?ref_=tt_cl_t2", "name": "Frank"}]}, {"actor": {"@type": "Person", "url": "/name/nm0002668/?ref_=tt_cl_t4", "name": "George 'Buck' Flower"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0002668?ref_=tt_cl_t4", "name": "Drifter"}]}, {"actor": {"@type": "Person", "url": "/name/nm0820566/?ref_=tt_cl_t6", "name": "Raymond St. Jacques"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0820566?ref_=tt_cl_t6", "name": "Street Preacher"}]}, {"actor": {"@type": "Person", "url": "/name/nm0492835/?ref_=tt_cl_t8", "name": "John Lawrence"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0492835?ref_=tt_cl_t8", "name": "Bearded Man"}]}, {"actor": {"@type": "Person", "url": "/name/nm0724784/?ref_=tt_cl_t10", "name": "Sy Richardson"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0724784?ref_=tt_cl_t10", "name": "Black Revolutionary"}]}, {"actor": {"@type": "Person", "url": "/name/nm0580612/?ref_=tt_cl_t12", "name": "Lucille Meredith"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0580612?ref_=tt_cl_t12", "name": "Female Interviewer"}]}, {"actor": {"@type": "Person", "url": "/name/nm0017491/?ref_=tt_cl_t14", "name": "Norman Alden"}, "character_and_episodes": [{"url": "/title/tt0096256/characters/nm0017491?ref_=tt_cl_t14", "name": "Foreman"}]}]}