{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0910970/", "name": "WALL·E", "image": "https://m.media-amazon.com/images/M/MV5BMjExMTg5OTU0NF5BMl5BanBnXkFtZTcwMjMxMzMzMw@@._V1_.jpg", "genre": ["Animation", "Adventure", "Family", "Romance", "Sci-Fi"], "contentRating": "G", "actor": [{"@type": "Person", "url": "/name/nm0123785/", "name": "Ben Burtt"}, {"@type": "Person", "url": "/name/nm2264184/", "name": "Elissa Knight"}, {"@type": "Person", "url": "/name/nm0307531/", "name": "Jeff Garlin"}, {"@type": "Person", "url": "/name/nm0929609/", "name": "Fred Willard"}], "director": {"@type": "Person", "url": "/name/nm0004056/", "name": "Andrew Stanton"}, "creator": [{"@type": "Person", "url": "/name/nm0004056/", "name": "Andrew Stanton"}, {"@type": "Person", "url": "/name/nm0230032/", "name": "Pete Docter"}, {"@type": "Person", "url": "/name/nm0004056/", "name": "Andrew Stanton"}, {"@type": "Person", "url": "/name/nm0714114/", "name": "Jim Reardon"}, {"@type": "Organization", "url": "/company/co0622634/"}, {"@type": "Organization", "url": "/company/co0017902/"}, {"@type": "Organization", "url": "/company/co0008970/"}], "description": "WALL·E is a movie starring Ben Burtt, Elissa Knight, and Jeff Garlin. In the distant future, a small waste-collecting robot inadvertently embarks on a space journey that will ultimately decide the fate of mankind.", "datePublished": "2008-06-26", "keywords": "robot,obesity,recycling robot,adrift in space,cgi animation", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1008289, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0910970/"}, "author": {"@type": "Person", "name": "jedi-jones"}, "dateCreated": "2008-06-29", "inLanguage": "English", "name": "An A+ for Wall-E! One of the best movies this century!", "reviewBody": "Wall-E is the movie experience I've been looking for. I haven't seen a new film this richly entertaining, thrilling, touching and satisfying since Spider-Man 2. It is truly the finest Pixar or animated CGI film to date. I can discuss it without spoilers easily because it's one of those films, like 2001: A Space Odyssey, that exists more as a pure experience of the heart and the senses than as a collection of events that we're supposed to keep track of intellectually. Wall-E rises above that kind of unnecessary complication into the same kind of space occupied by dreams and the imagination.\n\nThis film is beautifully animated, of course, to that magical Pixar point where even piles of what should be disgusting trash somehow look breathtakingly gorgeous and even fairly realistic-looking roaches look cute. But much more importantly, the heart, the emotion in this movie is unlike anything I've experienced at the cinema since Forrest Gump. Certainly my tear ducts have not welled up while watching a movie this much since then. I fell in like with the character of Wall-E when I saw the trailer. Watching the movie, I fell in love with him within about 2 minutes. Shortly after that, I fell in love with the idea of Wall-E falling in love.\n\nMy previous favorite movie romance is Superman and Lois Lane in the original Superman films. The love story, or the love experience of Wall-E and Eve is perhaps the first I've seen since then that operates at and succeeds on that same level. These couples create an uncomplicated, innocent, simple, yet deep and powerful bond. They capture the experience of love at first sight, writ large. They possess an instant chemistry that tells you they belong together from the first time they see one another and makes you root for their relationship throughout the film. Wall-E and Eve share moments together of real cinematic beauty, true hilarity, frightening sadness, frustrating difficulty and delightful satisfaction. It's a testament to the level of genius at which the Pixar storytellers are operating that we feel every beat of this relationship resonate every step of the way despite the fact that the characters are robots that are not modeled off of humans and speak no more than a handful of words throughout the movie (this animated movie is refreshingly free of obvious \"guest star\" voices or any over-the-top stand-up comedians trying to upstage the movie).\n\nJust like in the first Superman films, once you care about the characters as individuals and care about their relationship, it's almost impossible for the rest of the movie not to work. You're hooked at hello. Wall-E adds all the expected complications to keep the would-be lovers from getting together most of the time. There is a truly great \"McGuffin\" that keeps the heroes and villains busy for quite a while (the item in question is something outwardly simple that ends up holding the key to something more important than anything in the world). The pacing during most of these adventures is as breakneck as anything out of the Star Wars films and the action is always staged with crystal clarity. There are several scenes of peril for Wall-E that are reminiscent of that oddly powerful sequence in Short Circuit 2 when Johnny 5 is almost killed. The filmmakers pull absolutely no punches when it comes to running your heart through the ringer over characters you care about. It probably helps that you can do a lot more physical damage to a robot character than you can to a human character while keeping a G rating and still getting the audience dramatically worried about their survival.\n\nEven on top of the action, the emotion, the visuals and the humor, Wall-E goes the extra mile into thought-provoking thematic territory. The film never hits you over the head with anything preachy and doesn't really even outright tell you what its opinions on the subjects it raises are. It also doesn't explicitly lay out explanations for everything that exists in Wall-E's world (there are no \"talking killer\" scenes and very little verbal exposition). I think the bits of ambiguity work here because they add to the sense of mystery, helplessness and alienation that most of the characters in the movie feel to some degree.\n\nThere are human characters in this movie too, quite a few. I think that's necessary because if humans aren't shown in a robot world, you have to wonder what purpose were the robots designed to serve? That was a curiosity of the earlier CGI movie, Robots. Most of the humans in Wall-E aren't as developed as the robots, but I think that's because they exist more to represent the whole of humanity rather than particular individuals. We're asked to ponder the consequences of the choices they make as though the whole society was moving in that direction, not just one person. Wall-E and Eve are the heart of this movie but the humans are used to add some intellectual gravity for the audience to chew on.\n\nOther choices made in the movie might also leave room for debate, such as the integration of some live-action footage into the film. But because the movie as a whole is so audaciously stimulating and brilliantly satisfying, it's a plus that they left us with a few unresolved or unusual things to think about and question after getting off of the great emotional and visual roller-coaster experience. Wall-E truly serves up everything that I think an audience could want in a movie experience. It will be very easy for me to watch this one over and over again. It is a modern-day classic that I believe should earn a place in cinema history as the \"2001\" of CGI animated films, both of them movies of indisputable brilliance, unyielding imagination and unending entertainment.\n\nFootnote: The pre-movie short is an awesome, violent Looney Tunes/Roger Rabbit-esquire toon. It wants only to entertain and does.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT1H38M", "trailer": {"@type": "VideoObject", "name": "Wall E", "embedUrl": "/video/imdb/vi2192703769", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTc2Njc2MTYyN15BMl5BanBnXkFtZTgwMzcwNTczMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTc2Njc2MTYyN15BMl5BanBnXkFtZTgwMzcwNTczMzE@._V1_.jpg", "description": "Wall E - Trailer #3", "uploadDate": "2008-03-15T11:26:18Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0123785/?ref_=tt_cl_t1", "name": "Ben Burtt"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm0123785?ref_=tt_cl_t1", "name": "WALL·E"}, {"url": "/title/tt0910970/characters/nm0123785?ref_=tt_cl_t1", "name": "M-O"}, {"url": "/title/tt0910970/characters/nm0123785?ref_=tt_cl_t1", "name": "Robots"}]}, {"actor": {"@type": "Person", "url": "/name/nm0307531/?ref_=tt_cl_t3", "name": "Jeff Garlin"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm0307531?ref_=tt_cl_t3", "name": "Captain"}]}, {"actor": {"@type": "Person", "url": "/name/nm3050831/?ref_=tt_cl_t5", "name": "MacInTalk"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm3050831?ref_=tt_cl_t5", "name": "AUTO"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001562/?ref_=tt_cl_t7", "name": "Kathy Najimy"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm0001562?ref_=tt_cl_t7", "name": "Mary"}]}, {"actor": {"@type": "Person", "url": "/name/nm0628599/?ref_=tt_cl_t9", "name": "Teddy Newton"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm0628599?ref_=tt_cl_t9", "name": "Steward Bots"}]}, {"actor": {"@type": "Person", "url": "/name/nm0194201/?ref_=tt_cl_t11", "name": "John Cygan"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm0194201?ref_=tt_cl_t11", "name": "Axiom Passenger #3"}]}, {"actor": {"@type": "Person", "url": "/name/nm0251646/?ref_=tt_cl_t13", "name": "Paul Eiding"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm0251646?ref_=tt_cl_t13", "name": "Axiom Passenger #12"}]}, {"actor": {"@type": "Person", "url": "/name/nm0304679/?ref_=tt_cl_t15", "name": "Teresa Ganzel"}, "character_and_episodes": []}, {"actor": {"@type": "Person", "url": "/name/nm2264184/?ref_=tt_cl_t2", "name": "Elissa Knight"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm2264184?ref_=tt_cl_t2", "name": "EVE"}]}, {"actor": {"@type": "Person", "url": "/name/nm0929609/?ref_=tt_cl_t4", "name": "Fred Willard"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm0929609?ref_=tt_cl_t4", "name": "Shelby Forthright"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001652/?ref_=tt_cl_t6", "name": "John Ratzenberger"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm0001652?ref_=tt_cl_t6", "name": "John"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000244/?ref_=tt_cl_t8", "name": "Sigourney Weaver"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm0000244?ref_=tt_cl_t8", "name": "Ship's Computer"}]}, {"actor": {"@type": "Person", "url": "/name/nm0074036/?ref_=tt_cl_t10", "name": "Bob Bergen"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm0074036?ref_=tt_cl_t10", "name": "Forthright's Advisor"}]}, {"actor": {"@type": "Person", "url": "/name/nm0230032/?ref_=tt_cl_t12", "name": "Pete Docter"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm0230032?ref_=tt_cl_t12", "name": "Lifeguard Bot"}]}, {"actor": {"@type": "Person", "url": "/name/nm0298412/?ref_=tt_cl_t14", "name": "Donald Fullilove"}, "character_and_episodes": [{"url": "/title/tt0910970/characters/nm0298412?ref_=tt_cl_t14", "name": "Axiom Passenger #7"}]}]}