{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1560220/", "name": "Zombieland: Double Tap", "image": "https://m.media-amazon.com/images/M/MV5BYjcwNjZhNGYtOGNlNy00NGI3LTlmODMtMGZlMjA3YjA0Njg0XkEyXkFqcGdeQXVyMDM2NDM2MQ@@._V1_.jpg", "genre": ["Action", "Adventure", "Comedy", "Horror"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000437/", "name": "Woody Harrelson"}, {"@type": "Person", "url": "/name/nm0251986/", "name": "Jesse Eisenberg"}, {"@type": "Person", "url": "/name/nm1297015/", "name": "Emma Stone"}, {"@type": "Person", "url": "/name/nm1113550/", "name": "Abigail Breslin"}], "director": {"@type": "Person", "url": "/name/nm0281508/", "name": "Ruben Fleischer"}, "creator": [{"@type": "Person", "url": "/name/nm1014201/", "name": "Rhett Reese"}, {"@type": "Person", "url": "/name/nm1116660/", "name": "Paul Wernick"}, {"@type": "Person", "url": "/name/nm1709264/", "name": "Dave Callaham"}, {"@type": "Person", "url": "/name/nm1014201/", "name": "Rhett Reese"}, {"@type": "Person", "url": "/name/nm1116660/", "name": "Paul Wernick"}, {"@type": "Organization", "url": "/company/co0605949/"}, {"@type": "Organization", "url": "/company/co0050868/"}, {"@type": "Organization", "url": "/company/co0142539/"}], "description": "Zombieland: Double Tap is a movie starring Woody Harrelson, Jesse Eisenberg, and Emma Stone. Columbus, Tallahassee, Wichita, and Little Rock move to the American heartland as they face off against evolved zombies, fellow survivors,...", "datePublished": "2019-10-09", "keywords": "sequel,zombie,survival,altered version of studio logo,marriage proposal", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 142944, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1560220/"}, "author": {"@type": "Person", "name": "Bertaut"}, "dateCreated": "2019-11-05", "inLanguage": "English", "name": "Just as funny and irreverent as the original, even if it hits all the same beats", "reviewBody": "The original Zombieland (2009) was something of a sleeper hit, earning over $100 million against a $24 million budget, becoming the most financially successful zombie most ever made, until it was surpassed by the asinine World War Z (2013). Smart, funny, and self-aware, it didn't take itself too seriously, and it had bucket-loads of heart, but it was hardly a film crying out for a sequel. And as time passed, it seemed more and more unlikely such a sequel would happen. However, after a decade in development hell, Zombieland: Double Tap has arrived, and boy is it one of the most unnecessary sequels I've seen in quite some time. However, as unnecessary as it is, it's also extremely enjoyable. It doesn't do a whole lot that wasn't in the original, but the irreverent sense of humour, fourth wall breaks, sharp character interactions, and, most importantly, shedloads of charm are all present and accounted for. Directed by Ruben Fleischer (who helmed the original) and written by Rhett Reese and Paul Wernick (who wrote the original), along with Dave Callaham, Double Tap may not take too many risks, but it's a fine companion piece.\n\n10 years after the events in the first film, the quartet is still together and still getting on one another's nerves - there's the neurotic but sweet Columbus (Jesse Eisenberg doing his Jessie Eisenberg thing), the crass but caring Tallahassee (a wonderfully acerbic Woody Harrelson), the sarcastic Wichita (a dead-pan Emma Stone) and the laidback Little Rock (Abigail Breslin doing a lot with the little she's given). As we meet them, they're in the process of taking up residence in the White House - Columbus and Wichita are still a couple, but recently, she's started to wonder if perhaps their relationship is more important to him than it is to her; Little Rock is now a young woman who resents the fact that Tallahassee still treats her like she's 11; and Tallahassee, for his part, hasn't changed an iota. After Columbus proposes to Wichita (using the Hope Diamond), she and Little Rock skip town, but she returns a month later, telling the others that Little Rock ditched her and headed to a supposed zombie-free commune. And so the trio reluctantly set out to find her. Along the way, we're introduced to Madison (Zoey Deutch, who completely steals the film), a millennial bimbo who's been holed up in walk-in freezer; Berkeley (Avan Jogia), a peace-loving hippie; Nevada (Rosario Dawson), a tough-as-nails Elvis aficionado; and Albuquerque (Luke Wilson) and Flagstaff (Thomas Middleditch), who are eerily similar to Tallahassee and Columbus (the reveal of which was spoiled by the trailer). There's also a new breed of zombie, which is faster, stronger, and more intelligent than the regular kind, and which can only be killed with multiple head-shots.\n\nAnd that's about it as far as the plot goes.\n\nAlthough 10 years have passed and the zombie movie landscape is very different, one of the sequel's most successful elements is that next to nothing has changed; in essence, it acknowledges the gap precisely by ignoring it. So, Columbus's opening voiceover specifically refers to the long break as he thanks us for choosing Double Tap when there is such \"a wide choice of zombie entertainment\" and Madison tells Tallahassee his catchphrase is \"very 2009\", but the film as a whole feels as if it was shot immediately after the original. Of course, this is important insofar as in the universe of the franchise, the last decade has been very different to the last decade of our reality, so the filmmakers can't layer in too many contemporary references - although Columbus does mention how \"unrealistic\" The Walking Dead comics are, there's a hilarious deconstruction of the concept of Uber, and there's a subtle allusion to Trump when Wichita sarcastically tells Tallassee he'd have brought \"a real dignity\" to the office of the presidency.\n\nThis factors into the performances as well, insofar as Columbus, Tallahassee, and Wichita are all broadly similar to how they were 10 years ago. Little Rock has changed significantly, but that's as much to do with the fact that she was a child in the original and is now a young woman. This lack of character development may sound like a bad thing, but really, the familiarity of the characters and their group dynamic has its own inherent charm, we welcome it because it's familiar, with the cast essentially doing the same things they did in the original. Speaking of performances, Zoey Deutch completely owns every scene she's in. Sure, the character is clichéd as all hell and, on paper, she should be all kinds of annoying, but that she isn't, is a testament to Deutch's warm performance, finding genuine pathos amidst the perpetually peppy and cheerful high-energy ditz. She also has great chemistry with the original cast, especially Harrelson. In fact, all of the new actors have terrific chemistry, which is nice to see insofar as effortless chemistry was one of the hallmarks of the original.\n\nIn terms of problems, as mentioned, the film doesn't do a whole lot that wasn't in the original - the characters, the narrative beats, the group dynamic, the humour; all are pretty much the same as the original, and for some, this will certainly be an issue. Indeed, as much as I enjoyed the film, I would have liked to see it take more risks (there's certainly nothing here to rival the inspired Bill Murray cameo). Because of this blanket similarity, there is a sense in which the sequel isn't really its own thing, it's defined primarily by what the original did rather than forging its own path, and a lot of the meta-humour only works if you know the original. Another problem is that it fails to do much with an interesting set-up, which sees women chaffing against traditional gender roles and the identities conferred on them by men. Once the gang end up on the road, this theme is pretty much forgotten (even with the introduction of Nevada, who seems more like a man's idea of what a tough woman should be than her own person). There are also more than a few clichés, primarily in relation to Madison (as blond a character as you'll ever meet) and the one-note Berkeley (a weed-smoking gun-hating hippie, who is literally introduced by way of a sitar on the soundtrack).\n\nZombieland: Double Tap is undemanding and doesn't completely justify its existence, but it also does justice to the original, and never for one second does it take itself seriously. The effortlessness with which it slots into the original's groove is either funny in its own right or poor writing, depending on your perspective, but the film is smart enough to know and acknowledge that it feels slightly out of place in 2019. And if a little of the spark has been lost, the warmth, the characters, the jokes, and the playfulness more than make up for it.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H39M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi1969863705", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzY4NDM2YjYtNGM1OS00ZTcxLThjNDMtMjFmMWQyNzc3OGE5XkEyXkFqcGdeQW1yb3NzZXI@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzY4NDM2YjYtNGM1OS00ZTcxLThjNDMtMjFmMWQyNzc3OGE5XkEyXkFqcGdeQW1yb3NzZXI@._V1_.jpg", "description": "Columbus, Tallahasse, Wichita, and Little Rock move to the American heartland as they face off against evolved zombies, fellow survivors, and the growing pains of the snarky makeshift family.", "uploadDate": "2019-07-25T16:06:30Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000437/?ref_=tt_cl_t1", "name": "Woody Harrelson"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm0000437?ref_=tt_cl_t1", "name": "Tallahassee"}]}, {"actor": {"@type": "Person", "url": "/name/nm1297015/?ref_=tt_cl_t3", "name": "Emma Stone"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm1297015?ref_=tt_cl_t3", "name": "Wichita"}]}, {"actor": {"@type": "Person", "url": "/name/nm3614913/?ref_=tt_cl_t5", "name": "Zoey Deutch"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm3614913?ref_=tt_cl_t5", "name": "Madison"}]}, {"actor": {"@type": "Person", "url": "/name/nm0206257/?ref_=tt_cl_t7", "name": "Rosario Dawson"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm0206257?ref_=tt_cl_t7", "name": "Nevada"}]}, {"actor": {"@type": "Person", "url": "/name/nm3042755/?ref_=tt_cl_t9", "name": "Thomas Middleditch"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm3042755?ref_=tt_cl_t9", "name": "Flagstaff"}]}, {"actor": {"@type": "Person", "url": "/name/nm4376713/?ref_=tt_cl_t11", "name": "Victor Rivera"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm4376713?ref_=tt_cl_t11", "name": "Civil War Bearded Guy"}]}, {"actor": {"@type": "Person", "url": "/name/nm4747423/?ref_=tt_cl_t13", "name": "Devin Mojica"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm4747423?ref_=tt_cl_t13", "name": "Cool Hat Guy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0228882/?ref_=tt_cl_t15", "name": "John Dixon"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm0228882?ref_=tt_cl_t15", "name": "Homer Zombie in Snow"}]}, {"actor": {"@type": "Person", "url": "/name/nm0251986/?ref_=tt_cl_t2", "name": "Jesse Eisenberg"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm0251986?ref_=tt_cl_t2", "name": "Columbus"}]}, {"actor": {"@type": "Person", "url": "/name/nm1113550/?ref_=tt_cl_t4", "name": "Abigail Breslin"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm1113550?ref_=tt_cl_t4", "name": "Little Rock"}]}, {"actor": {"@type": "Person", "url": "/name/nm2240326/?ref_=tt_cl_t6", "name": "Avan Jogia"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm2240326?ref_=tt_cl_t6", "name": "Berkeley"}]}, {"actor": {"@type": "Person", "url": "/name/nm0005561/?ref_=tt_cl_t8", "name": "Luke Wilson"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm0005561?ref_=tt_cl_t8", "name": "Albuquerque"}]}, {"actor": {"@type": "Person", "url": "/name/nm6231894/?ref_=tt_cl_t10", "name": "Victoria Hall"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm6231894?ref_=tt_cl_t10", "name": "Babylonian Gatekeeper"}]}, {"actor": {"@type": "Person", "url": "/name/nm5670328/?ref_=tt_cl_t12", "name": "Ian Gregg"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm5670328?ref_=tt_cl_t12", "name": "Bowel Blast Guy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0527523/?ref_=tt_cl_t14", "name": "Rachel Luttrell"}, "character_and_episodes": [{"url": "/title/tt1560220/characters/nm0527523?ref_=tt_cl_t14", "name": "Terrified Woman in Snow"}]}]}