{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0070917/", "name": "The Wicker Man", "image": "https://m.media-amazon.com/images/M/MV5BOWIzY2QyNDQtOWI3Ni00MjEwLTlhYTgtZTgyMThiY2JkMTY4XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Horror", "Mystery", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0940919/", "name": "Edward Woodward"}, {"@type": "Person", "url": "/name/nm0000489/", "name": "Christopher Lee"}, {"@type": "Person", "url": "/name/nm0162283/", "name": "Diane Cilento"}, {"@type": "Person", "url": "/name/nm0001180/", "name": "Britt Ekland"}], "director": {"@type": "Person", "url": "/name/nm0362736/", "name": "Robin Hardy"}, "creator": [{"@type": "Person", "url": "/name/nm0787289/", "name": "Anthony Shaffer"}, {"@type": "Person", "url": "/name/nm0684432/", "name": "David Pinner"}, {"@type": "Organization", "url": "/company/co0103038/"}], "description": "The Wicker Man is a movie starring Edward Woodward, Christopher Lee, and Diane Cilento. A puritan Police Sergeant arrives in a Scottish island village in search of a missing girl who the locals claim never existed.", "datePublished": "1973-12-06", "keywords": "paganism,religious sacrifice,folk horror,ritual killing,disappearance", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 70854, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0070917/"}, "author": {"@type": "Person", "name": "johnnyboyz"}, "dateCreated": "2008-06-03", "inLanguage": "English", "name": "Proof that the British horror genre was once great?", "reviewBody": "There is a distinct air of menace flowing throughout The Wicker Man, a distinct feeling of unwelcome and unkind put across in the most brilliant of manners because everyone acts so nicely. Then there is the awful feeling you get at certain points when you realise the character of Sergeant Howie (Woodward) is in actual fact a policeman and what might happen if he hadn't been. The Wicker Man is really a mere exercise in suspense on the surface but I think it toys with other, more political ideas during the core of the film before substituting everything and just focussing very briefly on the religious aspects it raises.\n\nFor Sergeant Howie, he is bordering on the ultimate fish-out-of-water. Howie may be British and may well still be in Britain but that does not exclude him from the fish-out-of-water treatment that other film characters get when they are in that respective situation (see Doyle in 'French Connection II' and Neo in 'The Matrix' among many other examples). Howie is a man of pride; a man with ideas, discipline and rules and regulations he likes to stand by. He is a thorough man and this is partly his downfall since it is this case that is so difficult, it sees him assigned to it. Howie is on a remote Scottish isle investigating a disappearance of a young girl but while remaining within the boundaries of his own world; his own language and even his own country, Howie will find the going difficult and complicated due to several unsuspecting and eerie things.\n\nFirstly, the location of the island is important because it obviously resembles a sort of detachment from the mainland or indeed the rest of the world. There is special care taken to tell the audience as well as Howie that the mainland is a good week or so away by boat. So within this isolated utopia for the locals develops a sub-culture, a world in which people are people but methods of teaching, governing and religion are very different. This can be read into as some sort of political statement by the writer of the film \u0096 perhaps he is bringing to attention the level of policing in Britain for the time? There is no suspicion from Howie at all in the film but I noticed very quickly there was no police station nor was there any feeling that rules were apparent. The whole island was governed by a mysterious, never seen man and look at what situation the island locals were in, in terms of mentality.\n\nSo if this island is a society without law and order; without a stone wall ruling on the most basic humane regulations, is the writer trying to bring to our attention the dangers of lack of authority in our own country? But The Wicker Man is not entirely an ambiguous text revolving around statements on our own world and society. It is a chilling and haunting horror film that predominantly falls into the 'Gothic' typecast due to its minute details on screen. There is a distinct ritualistic tone to the film and it is one that is fetishised. Several years earlier, Christopher Lee himself starred in the highly fetishised 'Dracula'. Here, shots of naked people sitting on grave stones and people having sex in graveyards, maybe to merely gross the 1973 audience out or to just make us aware that this is indeed going to be different, are included and add an ever present layer of disturbance but also one of ambiguity \u0096 why is it that people here do these things? To combine sex with a place of death can be linked with the film's overall theme. The man in the scene around the maypole sings a song about evolution and reproduction and generally about a certain circle of life. From here, it is only obvious that the act of reproduction (sex) to produce new life would take place in a location in which you bury the dead. Life goes on, it seems.\n\nThen there is that extra evidence to suggest this is one of the great Gothic horrors. How may of the cast are actually playing themselves? There are the people in the public house and the elderly folk by the harbour. This gives off its own air of disturbance in the sense they might be playing themselves and what with the commentary on society as a whole, the two seem to bind together all the too nicely. Then there is the attention to faces early on. The chocolates in the baker's window have faces on them and the close up of the pub sign has a face on it. There is also the excessive wearing of masks later on as identity is toyed and revealed but generally kept ambiguous. Is this the future of the society circa 1973? Do we know what we believe in terms of religion? And where we are going in the future? What about the schools and the policing? Will this be the sad reality of a nation gone mad if these things are cut back on? I think these are the sorts of questions the writers are raising by making a film like this and it must've been all the more disturbing in 1973.\n\nSo if The Wicker Man succeeds as a statement then it certainly succeeds as a piece of Gothic horror. It mixes in the uncanny with the surreal and it carries a distinct atmosphere of dread all throughout. There is ambiguity all over the place but I especially liked the attention to the film's music: is it diegetic or not? Sometimes it is and others it isn't but it's such a head-trip of a soundtrack that it's difficult to notice most of the time. This surely one of the better British films ever made.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H28M", "trailer": {"@type": "VideoObject", "name": "The Wicker Man: The Final Cut", "embedUrl": "/video/imdb/vi695053849", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjJlZmZmOTEtYTc4YS00N2VlLWI2MjUtNGZiYjQzMDJjODNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjJlZmZmOTEtYTc4YS00N2VlLWI2MjUtNGZiYjQzMDJjODNmXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Trailer for The Wicker Man: The Final Cut", "uploadDate": "2015-02-28T08:14:23Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0940919/?ref_=tt_cl_t1", "name": "Edward Woodward"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0940919?ref_=tt_cl_t1", "name": "Sergeant Howie"}]}, {"actor": {"@type": "Person", "url": "/name/nm0162283/?ref_=tt_cl_t3", "name": "Diane Cilento"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0162283?ref_=tt_cl_t3", "name": "Miss Rose"}]}, {"actor": {"@type": "Person", "url": "/name/nm0685839/?ref_=tt_cl_t5", "name": "Ingrid Pitt"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0685839?ref_=tt_cl_t5", "name": "Librarian"}]}, {"actor": {"@type": "Person", "url": "/name/nm0914170/?ref_=tt_cl_t7", "name": "Russell Waters"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0914170?ref_=tt_cl_t7", "name": "Harbour Master"}]}, {"actor": {"@type": "Person", "url": "/name/nm0839383/?ref_=tt_cl_t9", "name": "Irene Sunters"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0839383?ref_=tt_cl_t9", "name": "May Morrison"}]}, {"actor": {"@type": "Person", "url": "/name/nm0132510/?ref_=tt_cl_t11", "name": "Ian Campbell"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0132510?ref_=tt_cl_t11", "name": "Oak"}]}, {"actor": {"@type": "Person", "url": "/name/nm0101886/?ref_=tt_cl_t13", "name": "Roy Boyd"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0101886?ref_=tt_cl_t13", "name": "Broome"}]}, {"actor": {"@type": "Person", "url": "/name/nm0113074/?ref_=tt_cl_t15", "name": "Barbara Rafferty"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0113074?ref_=tt_cl_t15", "name": "Woman with Baby"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000489/?ref_=tt_cl_t2", "name": "Christopher Lee"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0000489?ref_=tt_cl_t2", "name": "Lord Summerisle"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001180/?ref_=tt_cl_t4", "name": "Britt Ekland"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0001180?ref_=tt_cl_t4", "name": "Willow"}]}, {"actor": {"@type": "Person", "url": "/name/nm0447330/?ref_=tt_cl_t6", "name": "Lindsay Kemp"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0447330?ref_=tt_cl_t6", "name": "Alder MacGreagor"}]}, {"actor": {"@type": "Person", "url": "/name/nm0606368/?ref_=tt_cl_t8", "name": "Aubrey Morris"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0606368?ref_=tt_cl_t8", "name": "Old Gardener"}, {"url": "/title/tt0070917/characters/nm0606368?ref_=tt_cl_t8", "name": "Gravedigger"}]}, {"actor": {"@type": "Person", "url": "/name/nm0139892/?ref_=tt_cl_t10", "name": "Walter Carr"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0139892?ref_=tt_cl_t10", "name": "School Master"}]}, {"actor": {"@type": "Person", "url": "/name/nm0085574/?ref_=tt_cl_t12", "name": "Leslie Blackater"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0085574?ref_=tt_cl_t12", "name": "Hairdresser"}]}, {"actor": {"@type": "Person", "url": "/name/nm0108254/?ref_=tt_cl_t14", "name": "Peter Brewis"}, "character_and_episodes": [{"url": "/title/tt0070917/characters/nm0108254?ref_=tt_cl_t14", "name": "Musician"}]}]}