{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0411705/", "name": "9 Songs", "image": "https://m.media-amazon.com/images/M/MV5BOGRiYjgwMmYtYWRjNi00MzkwLWJlOGUtYTg1ZThhODk3YWY0XkEyXkFqcGdeQXVyNTM0NTU5Mg@@._V1_.jpg", "genre": ["Drama", "Music", "Romance"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm0639659/", "name": "Kieran O'Brien"}, {"@type": "Person", "url": "/name/nm1626256/", "name": "Margo Stilley"}, {"@type": "Person", "url": "/name/nm1384130/", "name": "Black Rebel Motorcycle Club"}, {"@type": "Person", "url": "/name/nm2105979/", "name": "Don Blum"}], "director": {"@type": "Person", "url": "/name/nm0935863/", "name": "Michael Winterbottom"}, "creator": [{"@type": "Person", "url": "/name/nm0935863/", "name": "Michael Winterbottom"}, {"@type": "Organization", "url": "/company/co0103733/"}], "description": "9 Songs is a movie starring Kieran O'Brien, Margo Stilley, and Black Rebel Motorcycle Club. In London, intense sexual encounters take place between an American college student, named Lisa, and an English scientist, named Matt,...", "datePublished": "2005-01-20", "keywords": "unsimulated sex,lust,sexual desire,sex,sex toy", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 21577, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "4.8"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0411705/"}, "author": {"@type": "Person", "name": "consul-2"}, "dateCreated": "2005-01-25", "inLanguage": "English", "name": "Physical love is a dead end (\"L'Amour physique est sans issue\")", "reviewBody": "I had read some reviews and comments from the Director before seeing \"Nine Songs\" so I had adapted my viewing mode accordingly. I armed myself with the kind of cold, intellectualized, high-culture glasses one uses to see relevant contemporary art. Most of the times it won't be neither an esthetically satisfactory experience nor a necessarily pleasant emotional experience but if we can see the point of the artist and if that point seems in resonance with one's curiosity and awareness of the world around, that will be good enough. From that somewhat minimalist expectations' level viewpoint, \"Nine Songs\" did the trick. I can see Michael Winterbottom's point. Why can a writer engage in sexual imagery with no restrictions and a film author can't do the same? There is also, I think, a honest experimental tone in all that. Something like \"Let's see if it works to ask the actors to go all the way. Let's see if we can stay inside serious film making and not add an item to the increasingly inflated porn film list.\" I think MW managed to sail through. Yes, it can be done (but, at what a price for the actors it remains to be seen); yes, it's definitely miles away from porn. As to if this incursion into real sex in the picture is as effective as explicit sex in literature, I'm afraid that MW is no Houellebecq. Sex in the daring novels of Houllebecq retain a kind of legitimacy because in the center of the plot there is a couple where love between the two is expressing itself (although fed by some rather non-conventional sexual behavior). Sex in Sade or in other libertine writers was deliberately tabu-breaking, and liberating in a way. The extremely good quality of the writing (both in Houellebecq and Sade) is a crucial element in allowing the authors who engage in such edgy fields to get away with it. In \"Nine Songs\" the couple fails to touch us, there is no love there (not even the good chemistry of sexual love), and the \"writing\" in film terms is not that impressive. It resembles more a documentary, which in fact it is (\"How to introduce explicit live sex in mainstream cinema\"). We end up leaving the screening room with the frustrating sense that an opportunity was lost. Like a piece of rather cold contemporary art it challenges you, it makes you engage in argument with your friends, it makes you wish to write a comment on web site. But we enjoy good cinema, not merely relate to.Enjoyment is not there."}, "duration": "PT1H11M", "trailer": {"@type": "VideoObject", "name": "9 Songs", "embedUrl": "/video/imdb/vi1588855065", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjFkZjExNTEtNmZmNC00NjNmLWJmZjMtYmNlNzA1ODY5NTI0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjFkZjExNTEtNmZmNC00NjNmLWJmZjMtYmNlNzA1ODY5NTI0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Nudity", "uploadDate": "2008-04-11T04:56:15Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0639659/?ref_=tt_cl_t1", "name": "Kieran O'Brien"}, "character_and_episodes": [{"url": "/title/tt0411705/characters/nm0639659?ref_=tt_cl_t1", "name": "Matt"}]}, {"actor": {"@type": "Person", "url": "/name/nm1626256/?ref_=tt_cl_t2", "name": "Margo Stilley"}, "character_and_episodes": [{"url": "/title/tt0411705/characters/nm1626256?ref_=tt_cl_t2", "name": "Lisa"}]}]}