{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0970416/", "name": "The Day the Earth Stood Still", "image": "https://m.media-amazon.com/images/M/MV5BMTI5NTg1MzU5Nl5BMl5BanBnXkFtZTcwMDU1ODMwMg@@._V1_.jpg", "genre": ["Drama", "Sci-Fi", "Thriller"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0000206/", "name": "Keanu Reeves"}, {"@type": "Person", "url": "/name/nm0000124/", "name": "Jennifer Connelly"}, {"@type": "Person", "url": "/name/nm0000870/", "name": "Kathy Bates"}, {"@type": "Person", "url": "/name/nm1535523/", "name": "Jaden Smith"}], "director": {"@type": "Person", "url": "/name/nm0220600/", "name": "Scott Derrickson"}, "creator": [{"@type": "Person", "url": "/name/nm0769227/", "name": "David Scarpa"}, {"@type": "Person", "url": "/name/nm0636002/", "name": "Edmund H. North"}, {"@type": "Organization", "url": "/company/co0000756/"}, {"@type": "Organization", "url": "/company/co0070636/"}, {"@type": "Organization", "url": "/company/co0241738/"}, {"@type": "Organization", "url": "/company/co0236758/"}, {"@type": "Organization", "url": "/company/co0028079/"}], "description": "The Day the Earth Stood Still is a movie starring Keanu Reeves, Jennifer Connelly, and Kathy Bates. A remake of the 1951 classic science fiction film about an alien visitor and his giant robot counterpart who visit Earth.", "datePublished": "2008-12-10", "keywords": "psychotronic film,alien,military,earth,scientist", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 164105, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0970416/"}, "author": {"@type": "Person", "name": "Otoboke"}, "dateCreated": "2008-12-10", "inLanguage": "English", "name": "Mildly entertains, but never reaches its potential.", "reviewBody": "The epic science fiction blockbuster is slowly but surely becoming a dying form of cinematic entertainment. Not since the days of cold war paranoia and the initial splurge of CGI technology back in the nineties has the genre seen much love either from its core enthusiasts or those looking for something big but different. Yet there are numerous obvious reasons for its decline in demand, most of which are unavoidably apparent in this, the latest and arguably first of its kind for over a year now, The Day the Earth Stood Still.\n\nBased upon a movie from the genre's heyday, director Scott Derrickson's version lacks the same sense of awe, conviction and relevancy to our current social climate. Bombarded with underdeveloped themes, an incoherent plot and extremely rough characterisation, the movie suffers not just from a lack of significance in its arrival, but also in its implementation. Most disappointing of all however is that in spite of the many technical flaws present, the biggest let down is that the movie simply doesn't convince; the effects are impressive and the story can be gripping through its thick layer of foreboding atmosphere from time to time, but an overall lack of substance hurts the film's ability to truly draw you in and take off. It's a routinely enjoyable experience sure enough, but an over reliance on this safe-play structure stops the feature from excelling beyond mere light entertainment.\n\nTelling a first contact story that involves rather heavy handed themes of a doomsday like prophecy, like most good science fiction movies big to small, The Day the Earth Stood Still retains a sense of wonder and mystique to its tale, particularly early on. During these initial moments of exposition which come to an eventual climax of contact with an alien presence visiting Earth for unknown reasons, the movie achieves its only real piece of coherent and engaging drama; the way in which it unfolds is magnificent and capitalises on the movie's big effects budget in ways that feel impressive and yet substantially eerie at the same time- there are moments when this big shot sci-fi movie actually feels like a genuine product of imagination and heart.\n\nDisappointingly however, this does not last very long. From here on in the feature slowly but surely declines in both mystique and interest, culminating in a third act which is about as convincing as it is exciting; which believe it or not, isn't much at all. It's around this point that things take a drastic turn from intelligent and insightful science-fiction to big dumb blockbuster action movie; the themes that are brought up during the movie's initial stages are belittled to a deux ex machina that never quite seems justified, and the climax \u0096if you can call it that- feels stunted and perfunctory for the sake of giving a clean feeling of catharsis. It's perhaps the biggest reason why most major productions based on sci-fi scripts never seem to work; the balancing act between catering to the mass public and those wanting intelligent drama is a hard one to pull off, and nobody here seems quite sure how to do such a thing.\n\nIf there is one thing that I can praise the movie for, outside of its opening act that is, it would simply be within its excellent aesthetic design. From the dynamic score penned by Tyler Bates to the often endlessly interesting photography of David Tattersall, The Day the Earth Stood Still gets most of its outer shell right, even if everything that lies underneath is a less than inspiring mess. One also has to draw attention to lead star Keanu Reeves who plays Klaatu, the alien/human hybrid visitor and mediator who is welcomed to Earth with a less than hospitable, but terribly human introduction. Reeves is an actor known for his alien-like, wooden style- which is why he is so often found in these kinds of films- and it suits his character adequately enough here. Co-star Jennifer Connelly holds her own too, and while she isn't given much to work with throughout, she does a fine job in playing as Keanu's contrived human sociology lesson.\n\nWhen the credits roll however, despite the movie's impressive effects, imaginative premise and somewhat entertaining moments, The Day the Earth Stood Still simply feels like an empty experience. As science fiction, the movie conjures up some intelligent questions and yet David Scarpa never seems quite up to the task of taking them any further; and as popcorn fodder, the movie simply doesn't do enough rule-breaking to come off as anything but standard fare. This awkward need to balance both crowds irrevocably results in a feature that indeed avoids polarising, but only to the point where mostly everyone will leave feeling under-stimulated. It has its fair share of compelling and visionary moments, but a distinct lack of development, coherency and substance stops The Day the Earth Stood Still from being one worth remembering. Light sci-fi with a dash of social intrigue that mildly entertains, but never reaches its potential.\n\n\n* A review by Jamie Robert Ward (http://www.invocus.net)\n"}, "duration": "PT1H44M", "trailer": {"@type": "VideoObject", "name": "The Day the Earth Stood Still: Trailer #2", "embedUrl": "/video/imdb/vi1665335321", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTcwMzkzNjg5NF5BMl5BanBnXkFtZTcwMzgyOTMwMg@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTcwMzkzNjg5NF5BMl5BanBnXkFtZTcwMzgyOTMwMg@@._V1_.jpg", "description": "Aliens land on Earth with an important message for its citizens. A remake of the classic 1951 sci-fi film directed by Robert Wise.", "uploadDate": "2008-11-15T09:45:26Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000206/?ref_=tt_cl_t1", "name": "Keanu Reeves"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm0000206?ref_=tt_cl_t1", "name": "Klaatu"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000870/?ref_=tt_cl_t3", "name": "Kathy Bates"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm0000870?ref_=tt_cl_t3", "name": "Regina Jackson"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000092/?ref_=tt_cl_t5", "name": "John Cleese"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm0000092?ref_=tt_cl_t5", "name": "Professor Barnhardt"}]}, {"actor": {"@type": "Person", "url": "/name/nm0151419/?ref_=tt_cl_t7", "name": "Kyle Chandler"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm0151419?ref_=tt_cl_t7", "name": "John Driscoll"}]}, {"actor": {"@type": "Person", "url": "/name/nm0393222/?ref_=tt_cl_t9", "name": "James Hong"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm0393222?ref_=tt_cl_t9", "name": "Mr. Wu"}]}, {"actor": {"@type": "Person", "url": "/name/nm1821342/?ref_=tt_cl_t11", "name": "Sunita Prasad"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm1821342?ref_=tt_cl_t11", "name": "Rouhani"}]}, {"actor": {"@type": "Person", "url": "/name/nm1758973/?ref_=tt_cl_t13", "name": "Sam Gilroy"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm1758973?ref_=tt_cl_t13", "name": "Tom"}]}, {"actor": {"@type": "Person", "url": "/name/nm1113471/?ref_=tt_cl_t15", "name": "Rukiya Bernard"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm1113471?ref_=tt_cl_t15", "name": "Student"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000124/?ref_=tt_cl_t2", "name": "Jennifer Connelly"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm0000124?ref_=tt_cl_t2", "name": "Helen Benson"}]}, {"actor": {"@type": "Person", "url": "/name/nm1535523/?ref_=tt_cl_t4", "name": "Jaden Smith"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm1535523?ref_=tt_cl_t4", "name": "Jacob Benson"}]}, {"actor": {"@type": "Person", "url": "/name/nm0358316/?ref_=tt_cl_t6", "name": "Jon Hamm"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm0358316?ref_=tt_cl_t6", "name": "Michael Granier"}]}, {"actor": {"@type": "Person", "url": "/name/nm0460694/?ref_=tt_cl_t8", "name": "Robert Knepper"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm0460694?ref_=tt_cl_t8", "name": "Colonel"}]}, {"actor": {"@type": "Person", "url": "/name/nm0745232/?ref_=tt_cl_t10", "name": "John Rothman"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm0745232?ref_=tt_cl_t10", "name": "Dr. Myron"}]}, {"actor": {"@type": "Person", "url": "/name/nm2017931/?ref_=tt_cl_t12", "name": "Juan Riedinger"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm2017931?ref_=tt_cl_t12", "name": "William Kwan"}]}, {"actor": {"@type": "Person", "url": "/name/nm1434853/?ref_=tt_cl_t14", "name": "Tanya Champoux"}, "character_and_episodes": [{"url": "/title/tt0970416/characters/nm1434853?ref_=tt_cl_t14", "name": "Isabel"}]}]}