{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt7587876/", "name": "Hope Gap", "image": "https://m.media-amazon.com/images/M/MV5BYmY0YmUzM2MtOTRhNS00MjA0LWJmMDctNWMzOTllNzk5ZDdiXkEyXkFqcGdeQXVyNzQ5MzY0NjM@._V1_.jpg", "genre": ["Drama", "Romance"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0000906/", "name": "Annette Bening"}, {"@type": "Person", "url": "/name/nm0631490/", "name": "Bill Nighy"}, {"@type": "Person", "url": "/name/nm4853066/", "name": "Josh O'Connor"}, {"@type": "Person", "url": "/name/nm4408716/", "name": "Aiysha Hart"}], "director": {"@type": "Person", "url": "/name/nm0629933/", "name": "William Nicholson"}, "creator": [{"@type": "Person", "url": "/name/nm0629933/", "name": "William Nicholson"}, {"@type": "Organization", "url": "/company/co0707898/"}, {"@type": "Organization", "url": "/company/co0323451/"}, {"@type": "Organization", "url": "/company/co0237790/"}, {"@type": "Organization", "url": "/company/co0228888/"}, {"@type": "Organization", "url": "/company/co0476327/"}], "description": "Hope Gap is a movie starring Annette Bening, Bill Nighy, and Josh O'Connor. A couple's visit with their son takes a dramatic turn when the father tells him he plans on leaving his mother.", "datePublished": "2019-10-03", "keywords": "husband wife relationship,reference to napoleon bonaparte,catholic mass,history lesson,father son relationship", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 3231, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt7587876/"}, "author": {"@type": "Person", "name": "lucasnochez"}, "dateCreated": "2020-08-10", "inLanguage": "English", "name": "Film Review: Hope Gap/www.nightfilmreviews.com", "reviewBody": "\"Say not the struggle nought availeth, the labour and the wounds are vain, the enemy faints not, nor faileth, and as things have been they remain.\" An important passage of one of Arthur Hugh Clough's most recognized poems, is easily one of the most important messages from William Nicholson's long awaited sophomore feature Hope Gap. A story about hope, persistence and hard work for the things in life that matter the most, Hope Gap is a small film, but size never seems to be a determining factor of poignancy. Just like a well written poem, Hope Gap is a little piece of reality for the struggles, hardships and sometimes, maybe even often times, emotionally violent feats one may take to overcome heartbreak.\n\nUpon watching Hope Gap, I found the film resonating very deep within my heart and soul. Having endured a heartfelt and emotional withering of my own relationship, the film treads lightly the very real and hard to swallow realities of moving on.\n\nPlot wise, the film is a very familiar story. As the film opens up, we are quickly introduced to a very simple family; Edward (Bill Nighy) a professor at a local school, Grace, religious mother and poet enthusiast (Annette Bening) and their tech-savvy son Jamie (Jack O'Connor), who has recently moved away from his parents quaint seaside town and into the city. Upon the arrival of Grace and Edward's twenty-ninth wedding anniversary, an elderly Edward (Bill Nighy) informs Grace that he is leaving him for another woman.\n\nAs the unravelling of Grace and Edward's marriage begins, very simple yet complex themes of happiness, communication and relationships encompass the film. Within the first ten minutes of the film, Grace and Edward's relationship is spotlighted by how a lack of communication shows how their relationship begins to wither. Discussion of a simple anniversary dinner date, as well as a belief and faith in God shows both of their large differences in the relationship pushes Edward away. Grace, who is so passionate and feisty, laments her own emotions onto Edward, who, lifelessly and aimlessly just goes through the motions of the final days of their marriage. It becomes quite clear that the routine, repetitiveness and familiarity of Edward's life with Grace takes a toll on how he sees his future may be, and therefore rejects and denies it when he begins to fall in love with another woman.\n\nNicholson's script and direction is super tight and extremely relatable in a time where the large gaps between generations, especially between parents and children, are more visible than ever. Nicholson uses his very talented cast, moistly in Bening and Nighy, as well as the highly underrated O'Connor showcase their acting skills in nuanced yet powerful ways. Nicholson treads light waters and uses the weight of little things having value in relationships and how certain partners characteristics leads to problematic formulas of action/reaction and the lack thereof.\n\nHope Gap is wonderful film who's biggest enemy are not the cheaters, the faithfuls or the innocent bystanders who get caught in the cross-fires of love; the greatest enemy in Hope Gap are the fears that individuals tend to forget when it comes to growing a life, raising a family and getting older entails. These fears, like, being adequate companions to a spouse, projecting your beliefs onto your children, as well as the expectations people have for others, without expecting much from themselves, become the very fabrics of why Hope Gap succeeds as a portrait of a failed marriage, but also bridges the spaces of simple narrative storytelling.\n\nHope Gap isn't a movie you see, it's a movie you feel, similar to the way Edward explains to his wife how trying to force their son to believe in God is not the path he nor his son sees fit. \"You don't tell love, you feel love\", says Edward. Hinting early on in the film his very own emotions to a wife that seems deaf to his cries and pleas of change and growth.\n\nOne of the marvellous feats of Hope Gap is its ability to, although showcasing the faults and incompatibilities of each spouse to the audience as well as to each other, never makes either one of the partners a villain or a hero. Grace and Edward move on with their individual lives in manners that seem to not only evolve their characters, but also allow their son Jamie to find peace and happiness in the unfolding of his parents marital demise.\n\nOne of the most reoccurring dialogues in the film, is the idea of being happy and being fine. As Grace so eloquently states, \"Fine isn't the same as happy\" when discussing Jamie's love life in the city and his lack of companionship in his single flat, as well as Edward's responses whenever Grace asks him how his days are and how he is feeling. This simple use of narrative foreshadowing and these little bits of dialogue really pushes the points towards the fact that marriages are not easy; relationships are not simple, yet, its the decisions made between two people and the actions of their love that bridges the gap towards the idea that their love, their failed marriage and the time spent together, brought them their greatest accomplishment, their son.\n\nIt is quite obvious that Hope Gap may not be the happiest film you may see in 2020, but it sure is one damn fine film.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H40M", "trailer": {"@type": "VideoObject", "name": "Trailer", "embedUrl": "/video/imdb/vi2774122265", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGVlZWI5NzMtYzE4Yy00ZWNlLWIwMDMtMjI2YjVkOGMwYmE1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGVlZWI5NzMtYzE4Yy00ZWNlLWIwMDMtMjI2YjVkOGMwYmE1XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "uploadDate": "2020-02-04T16:41:38Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000906/?ref_=tt_cl_t1", "name": "Annette Bening"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm0000906?ref_=tt_cl_t1", "name": "Grace"}]}, {"actor": {"@type": "Person", "url": "/name/nm4853066/?ref_=tt_cl_t3", "name": "Josh O'Connor"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm4853066?ref_=tt_cl_t3", "name": "Jamie"}]}, {"actor": {"@type": "Person", "url": "/name/nm7744472/?ref_=tt_cl_t5", "name": "Ryan McKen"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm7744472?ref_=tt_cl_t5", "name": "Dev"}]}, {"actor": {"@type": "Person", "url": "/name/nm0737176/?ref_=tt_cl_t7", "name": "Sally Rogers"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm0737176?ref_=tt_cl_t7", "name": "Angela"}]}, {"actor": {"@type": "Person", "url": "/name/nm0655218/?ref_=tt_cl_t9", "name": "Steven Pacey"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm0655218?ref_=tt_cl_t9", "name": "Peter Widdecombe"}]}, {"actor": {"@type": "Person", "url": "/name/nm0444451/?ref_=tt_cl_t11", "name": "Rose Keegan"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm0444451?ref_=tt_cl_t11", "name": "Receptionist"}]}, {"actor": {"@type": "Person", "url": "/name/nm0087432/?ref_=tt_cl_t13", "name": "Nicholas Blane"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm0087432?ref_=tt_cl_t13", "name": "Priest"}]}, {"actor": {"@type": "Person", "url": "/name/nm0631490/?ref_=tt_cl_t2", "name": "Bill Nighy"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm0631490?ref_=tt_cl_t2", "name": "Edward"}]}, {"actor": {"@type": "Person", "url": "/name/nm4408716/?ref_=tt_cl_t4", "name": "Aiysha Hart"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm4408716?ref_=tt_cl_t4", "name": "Jess"}]}, {"actor": {"@type": "Person", "url": "/name/nm5337563/?ref_=tt_cl_t6", "name": "Joe Citro"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm5337563?ref_=tt_cl_t6", "name": "Young Jamie"}]}, {"actor": {"@type": "Person", "url": "/name/nm1372621/?ref_=tt_cl_t8", "name": "Nicholas Burns"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm1372621?ref_=tt_cl_t8", "name": "Gary"}]}, {"actor": {"@type": "Person", "url": "/name/nm0514476/?ref_=tt_cl_t10", "name": "Derren Litten"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm0514476?ref_=tt_cl_t10", "name": "Friendline Man"}]}, {"actor": {"@type": "Person", "url": "/name/nm3882611/?ref_=tt_cl_t12", "name": "Finn Bennett"}, "character_and_episodes": [{"url": "/title/tt7587876/characters/nm3882611?ref_=tt_cl_t12", "name": "Robbie"}]}]}