{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0050032/", "name": "Leave It to Beaver", "image": "https://m.media-amazon.com/images/M/MV5BMTI3OTM0MzY3M15BMl5BanBnXkFtZTcwNzY3NzQyMw@@._V1_.jpg", "genre": ["Comedy", "Family"], "contentRating": "TV-G", "actor": [{"@type": "Person", "url": "/name/nm0558487/", "name": "Jerry Mathers"}, {"@type": "Person", "url": "/name/nm0064604/", "name": "Hugh Beaumont"}, {"@type": "Person", "url": "/name/nm0082511/", "name": "Barbara Billingsley"}, {"@type": "Person", "url": "/name/nm0235638/", "name": "Tony Dow"}], "creator": [{"@type": "Person", "url": "/name/nm0175080/", "name": "Joe Connelly"}, {"@type": "Person", "url": "/name/nm0608658/", "name": "Bob Mosher"}, {"@type": "Person", "url": "/name/nm0176673/", "name": "Dick Conway"}, {"@type": "Organization", "url": "/company/co0080665/"}, {"@type": "Organization", "url": "/company/co0041169/"}, {"@type": "Organization", "url": "/company/co0059434/"}], "description": "Leave It to Beaver is a TV series starring Jerry Mathers, Hugh Beaumont, and Barbara Billingsley. The misadventures of a suburban boy, family and friends.", "datePublished": "1957-04-23", "keywords": "1950s,1960s,20th century,male protagonist,boy", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 6808, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0050032/"}, "author": {"@type": "Person", "name": "narnia4"}, "dateCreated": "2011-02-02", "inLanguage": "English", "name": "A wonderful mix of nostalgia and relevance", "reviewBody": "Leave it to Beaver has been somewhat maligned for representing an idealized, almost utopian view of the 1950's (although half the episodes aired in the next decade) where everyone is in his place... the sons go to the school dances and participate in sports and take the girls out on nice, proper dates (as well as always addressing their father as \"sir\"), the father goes to work and comes back to read the paper, and the wife is in, you guessed it, the kitchen. Among certain circles \"June Cleaver\" is seen as a dirty name.\n\nIf you watch the series, however, the show is much more than its reputation. Ward and June Cleaver are not the perfect parents, they are merely very good parents. It almost should be remembered that the world is seen through the eyes of Beaver Cleaver, the show's star. Keeping that in mind, it shouldn't be a surprise that we rarely see the parents argue (and also why we never learn what Ward's job actually is) and the world in general is seen as a pretty friendly place. The family system is very idealized and it's refreshing to watch. The show has a nostalgic vibe no matter what the age of the viewer (my father was a toddler when it aired and I can still feel nostalgic about it) because it does idealize values that are still cherished by people all over the world- decency, honesty, responsibility, family... the Cleavers are great with all these things just about every episode. It's also a very comfortable show... it isn't aiming for laughs that will put you on the floor laughing, but it will consistently get a chuckle out of people.\n\nBecause the Cleavers are idealized, some may see the show as \"dated\" because the 21st century has a more cynical approach to family. This is not to say that television that strives to show a realistic family situation is bad or wrong, only that showing an idealized version of the family isn't wrong either. What is often overlooked, however, is that many issues are addressed throughout the series run. Some things that may have been more acceptable in that era are frowned upon in LitB, and serious issues are dealt with throughout the series. Racism, alcoholism, divorce, and more that would surprise those who know the show only be reputation. Very often other children would talk about their father beating them (something Ward absolutely never did... not even spankings), and although these lines are often played for laughs there is a definite somber tone as well. And as a younger person watching the show, I see the same basic social issues being dealt with by Beaver and his brother Wally as kids and even adults deal with today. The things that Beaver or Wally do wrong every week (the show has one basic formula, but it works well) may seem small and petty in comparison to what many of us have done, but many of the same principles are involved in the reasons behind the wrong actions and the solutions. So in this way, Leave it to Beaver is both tremendously old-fashioned and relevant to any culture in which humans are involved.\n\nAs far as specifics about the cast, they're all iconic characters with the nasty, conniving Eddie Haskell being one of the greatest TV character ever. Ward's wisdom is always a nice treat, and I believe that June Cleaver has more depth and strength than she's given credit for (there are a few times when you wonder who wears the pants in the family!). One of the biggest drawbacks of the show is the older Beaver in the later seasons. He's still saying the same lines that are supposed to be cute and innocent, the problem is Mathers wasn't cute and innocent anymore, he was a teenager. That's partly why the show finally ended with the cast moving on to different things.\n\nSo all in all, it's a show that I can't recommend enough.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "trailer": {"@type": "VideoObject", "name": "Leave It to Beaver: The Complete Series", "embedUrl": "/video/imdb/vi2485760025", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDkyMjU1ODYtNDA3Mi00ZWVmLWJlYmYtN2FhMDM5YjU4OTk2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDkyMjU1ODYtNDA3Mi00ZWVmLWJlYmYtN2FhMDM5YjU4OTk2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Trailer for Leave It to Beaver: The Complete Series", "uploadDate": "2015-06-11T04:39:00Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0082511/?ref_=tt_cl_t1", "name": "Barbara Billingsley"}, "character_and_episodes": [{"url": "/title/tt0050032/characters/nm0082511?ref_=tt_cl_t1", "name": "June Cleaver"}, {"url": "#", "name": "235 episodes, 1957-1963"}]}, {"actor": {"@type": "Person", "url": "/name/nm0064604/?ref_=tt_cl_t3", "name": "Hugh Beaumont"}, "character_and_episodes": [{"url": "/title/tt0050032/characters/nm0064604?ref_=tt_cl_t3", "name": "Ward Cleaver"}, {"url": "#", "name": "234 episodes, 1957-1963"}]}, {"actor": {"@type": "Person", "url": "/name/nm0652119/?ref_=tt_cl_t5", "name": "Ken Osmond"}, "character_and_episodes": [{"url": "/title/tt0050032/characters/nm0652119?ref_=tt_cl_t5", "name": "Eddie Haskell"}, {"url": "#", "name": "96 episodes, 1957-1963"}]}, {"actor": {"@type": "Person", "url": "/name/nm0558487/?ref_=tt_cl_t2", "name": "Jerry Mathers"}, "character_and_episodes": [{"url": "/title/tt0050032/characters/nm0558487?ref_=tt_cl_t2", "name": "The Beaver"}, {"url": "#", "name": "235 episodes, 1957-1963"}]}, {"actor": {"@type": "Person", "url": "/name/nm0235638/?ref_=tt_cl_t4", "name": "Tony Dow"}, "character_and_episodes": [{"url": "/title/tt0050032/characters/nm0235638?ref_=tt_cl_t4", "name": "Wally Cleaver"}, {"url": "#", "name": "234 episodes, 1957-1963"}]}]}