{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1263750/", "name": "Habitación en Roma", "image": "https://m.media-amazon.com/images/M/MV5BNDdlNDFkNGEtZjQxYS00ZjY1LWE4ZjQtMmVlZTc3MzNlOWUyXkEyXkFqcGdeQXVyMjQwMjk0NjI@._V1_.jpg", "genre": ["Drama", "Romance"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm0025745/", "name": "Elena Anaya"}, {"@type": "Person", "url": "/name/nm1388067/", "name": "Natasha Yarovenko"}, {"@type": "Person", "url": "/name/nm0516272/", "name": "Enrico Lo Verso"}, {"@type": "Person", "url": "/name/nm0632385/", "name": "Najwa Nimri"}], "director": {"@type": "Person", "url": "/name/nm0575523/", "name": "Julio Medem"}, "creator": [{"@type": "Person", "url": "/name/nm1471503/", "name": "Julio Rojas"}, {"@type": "Person", "url": "/name/nm0575523/", "name": "Julio Medem"}, {"@type": "Person", "url": "/name/nm0297545/", "name": "Katherine Fugate"}, {"@type": "Organization", "url": "/company/co0080779/"}, {"@type": "Organization", "url": "/company/co0077916/"}, {"@type": "Organization", "url": "/company/co0071913/"}, {"@type": "Organization", "url": "/company/co0157183/"}, {"@type": "Organization", "url": "/company/co0071642/"}, {"@type": "Organization", "url": "/company/co0285183/"}, {"@type": "Organization", "url": "/company/co0071049/"}, {"@type": "Organization", "url": "/company/co0024845/"}], "description": "Habitación en Roma is a movie starring Elena Anaya, Natasha Yarovenko, and Enrico Lo Verso. A hotel room in the center of Rome serves as the setting for two young and recently acquainted women to have a physical adventure that...", "datePublished": "2010-05-07", "keywords": "sex scene,simulated sex,lesbian sex,lesbian,lesbianism", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 22438, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1263750/"}, "author": {"@type": "Person", "name": "Imdbidia"}, "dateCreated": "2011-03-09", "inLanguage": "English", "name": "Erotic and Soulful", "reviewBody": "Room in Rome is the story of a short-lived physical and emotional liaison between two women in a hotel room in the last night of summer. It would be a night of intense discovery, a tour de force between two ways of seeing life, love and sex.\n\nThe story is inspired in the Chilean movie En la Cama, which at its turn was inspired by the American film Before the Sunrise. However, the setting and dialogs have been reworked and reinvented by Medem, as the story happens in Rome and the couple has the same sex.\n\nJulio's Medem's well known mastery and filming sensibility are seen everywhere in this movie.\n\nThe use of the lighting and framing of the images are precious, elegant, warm and welcoming, very artistically composed with a great use of chiaroscuro and decoration. The room, which is the main set in which the movie happens, is not overwhelmingly present or a close asphyxiating place, but a very open fluid ethereal container where the story happens. Medem positions and moves the camera so the viewer feels is in the room, not watching the room. The spacial perspective is, therefore, very different. This is necessary as otherwise the movie would have felt oppressive and theatrical not a real and cinematic.\n\nThere is something magic about the way Medem has used the paintings in the room as well s the decoration of the ceilings, the three spaces of the room (dormitory, bathroom and balcony) and the decorative elements in it, not only to offer different facets of the personality of the characters, or show different phases in their relationship, but to incorporate those little visual elements into the story, like the little angels on the ceiling, the Venus on the bedside table, etc. This is very Medem, who always uses the surroundings as part of the story not as a mere decorative item. This movie reminded me of Medem's Chaotic Anna, in the way he incorporates art into life, and gives art a meaning that is never decorative or purely aesthetic.\n\nThe movie could have been claustrophobic and theatrical, but it is instead fresh and cinematic. The story, despite happening in the room, goes well beyond the room through the conversations of the characters and their use of the Internet to show pieces of their present and identities.\n\nMedem also shows a wonderful direction of the actors, which is reduced to the two leading actresses and four very secondary roles. The bed scenes are very erotic, definitely hot, still tastefully filmed.\n\nThe two main actress are great in their role, especially Elena Anaya as the honest and emotionally fragile Spaniard lesbian Alba. She believes her role, and gives all what she has, showing a great acting registry from comedy to tragedy, from sweetness to cockiness. Natasha Yarovenko is not as good, but still believable as the mysterious athletic sincere and strong hetero Russian beauty, shocked by her own attraction towards Alba. There seems to be certain intimacy between the camera and the actresses, an understanding and acceptance that makes the story believable. Moreover, the two actress have a great chemistry on camera and, that is extremely important in a movie like this.\n\nThe main problem, to me, with the movie is going over the top in the drawing of the characters, so they seem somewhat removed from the viewer, not always believable. 1/ Do the characters need to have perfect bodies for the story be more believable? I mean, the two actresses have wow bodies, especially Yarovenko, so you feel that it is pure logic that they felt attracted to each other. What about having the same story with two actresses that feel attracted to each other but look more normal and less gorgeous? Said in other words, characters for which the physic attraction is not that so obvious, still equally strong. Otherwise, you are stereotyping lesbians and bi-curious as gorgeous girls only attracted to super-dudder gals. 2/ Do the characters need to have such a high professional profile to be more interesting? I don't think so. A normal person can have a great story to tell, immense depth in her soul, be very hot and attractive, and still be an office worker, for example. Finally, despite he music being very beautify, it is also very repetitive and you end resenting it.\n\nTo be honest, when I heard that Medem wanted to film a movie like this, I thought that it was just out of character. But, after watching it, I think he has adopted the story and made it completely his. A story that I thought would not interest me at all, and, on the contrary, I enjoyed immensely.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H47M", "trailer": {"@type": "VideoObject", "name": "U.S. Version", "embedUrl": "/video/imdb/vi2486739225", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTMzMTk1MzgyNl5BMl5BanBnXkFtZTcwODk0MDgzNw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTMzMTk1MzgyNl5BMl5BanBnXkFtZTcwODk0MDgzNw@@._V1_.jpg", "description": "A hotel room in the center of Rome serves as the setting for two young and recently acquainted women to have a physical adventure", "uploadDate": "2012-02-09T15:27:13Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0025745/?ref_=tt_cl_t1", "name": "Elena Anaya"}, "character_and_episodes": [{"url": "/title/tt1263750/characters/nm0025745?ref_=tt_cl_t1", "name": "Alba"}]}, {"actor": {"@type": "Person", "url": "/name/nm0516272/?ref_=tt_cl_t3", "name": "Enrico Lo Verso"}, "character_and_episodes": [{"url": "/title/tt1263750/characters/nm0516272?ref_=tt_cl_t3", "name": "Max"}]}, {"actor": {"@type": "Person", "url": "/name/nm4294121/?ref_=tt_cl_t5", "name": "Ander Malles"}, "character_and_episodes": [{"url": "/title/tt1263750/characters/nm4294121?ref_=tt_cl_t5", "name": "Boy"}]}, {"actor": {"@type": "Person", "url": "/name/nm1388067/?ref_=tt_cl_t2", "name": "Natasha Yarovenko"}, "character_and_episodes": [{"url": "/title/tt1263750/characters/nm1388067?ref_=tt_cl_t2", "name": "Natacha"}]}, {"actor": {"@type": "Person", "url": "/name/nm0632385/?ref_=tt_cl_t4", "name": "Najwa Nimri"}, "character_and_episodes": [{"url": "/title/tt1263750/characters/nm0632385?ref_=tt_cl_t4", "name": "Edurne"}]}, {"actor": {"@type": "Person", "url": "/name/nm4295188/?ref_=tt_cl_t6", "name": "Laura Meizoso"}, "character_and_episodes": [{"url": "/title/tt1263750/characters/nm4295188?ref_=tt_cl_t6", "name": "Girl"}]}]}