{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt13087512/", "name": "Last Chance U: Basketball", "image": "https://m.media-amazon.com/images/M/MV5BYTcyMzJkNDYtZmVhOS00ODg4LWIxMzUtNzZiMmQ4N2U3N2MxXkEyXkFqcGdeQXVyMTkxNjUyNQ@@._V1_.jpg", "genre": ["Documentary", "Sport"], "contentRating": "TV-MA", "datePublished": "2021-03-10", "creator": {"@type": "Organization", "url": "/company/co0320613/"}, "keywords": "basketball", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1651, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt13087512/"}, "author": {"@type": "Person", "name": "briandfinley"}, "dateCreated": "2021-03-23", "inLanguage": "English", "name": "Could not disagree more with the guy who gave this a 1...", "reviewBody": "I tend be skeptical of documentary series like this because it's so easy for the filmmakers to manipulate the narrative and the audience's willing suspension of disbelief. Especially in a sports environment, which already has the built-in drama regarding winning and losing.\n\nHowever, I got completely sucked in almost immediately. This is a very well-crafted examination of an intensely dramatic scenario, with vivid & sympathetic characters who are very clearly defined by their individual circumstances, their personalities, and the depth of their need to succeed. For the young basketball players, the pressure to meet the moment and prevail is a constant theme in their lives, which us older adults can see as agonizingly fraught with peril. IT's a bit like watching a slasher film: \"don't go down there! Aggghhh!\". You want these kids, who have been given so little in life to see how their daily choices can reverberate across decades. You there, stifle that impulsivity, and do as I say! It is a nerve-wracking and poignant watch.\n\nThe head coach is equally fascinating: a deeply devout Christian whose coaching chops would easily translate to Division 1 or 2 college basketball, but chooses to work with kids in East Los Angeles who are struggling to get scholarships to those types of schools. His faith in his players and fervor for guiding them while also constantly tearing them down is a major source of drama. You watch this guy and one minute you're \"what a great guy!\" and then \"what an a*****e!\".\n\nAnd then there are the basketball games, played by real athletes on real teams, some of whom are very talented. The BIG problem with sports movies, is that no matter how hard they try, actors just can't simulate high-level athleticism. The greatest sports movies (not including documentaries) all fail BADLY at presenting athletic performance. These kids can ball.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "trailer": {"@type": "VideoObject", "name": "Last Chance U: Basketball", "embedUrl": "/video/imdb/vi407355673", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYWVhZWVhM2EtMzYzZS00NmU2LWEzYTMtZWJhNjEzMmVmZWFlXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYWVhZWVhM2EtMzYzZS00NmU2LWEzYTMtZWJhNjEzMmVmZWFlXkEyXkFqcGdeQVRoaXJkUGFydHlJbmdlc3Rpb25Xb3JrZmxvdw@@._V1_.jpg", "description": "Last Chance U: Basketball", "uploadDate": "2021-02-17T13:02:27Z"}, "cast_and_character": "Error loading cast information -- checked 2021-05-07 23:11:10.421501", "details": {"Country": ["USA"], "Language": ["English"], "Release Date": ["10 March 2021 (USA)"], "Also Known As": ["Last Chance U: Basketball"], "Production Co": ["Boardwalk Pictures"]}}