{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0060827/", "name": "Persona", "image": "https://m.media-amazon.com/images/M/MV5BMTM0YzExY2EtMjUyZi00ZmIwLWFkYTktNjY5NmVkYTdkMjI5XkEyXkFqcGdeQXVyNzQxNDExNTU@._V1_.jpg", "genre": ["Drama", "Thriller"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm0000761/", "name": "Bibi Andersson"}, {"@type": "Person", "url": "/name/nm0880521/", "name": "Liv Ullmann"}, {"@type": "Person", "url": "/name/nm0472234/", "name": "Margaretha Krook"}, {"@type": "Person", "url": "/name/nm0085038/", "name": "Gunnar Björnstrand"}], "director": {"@type": "Person", "url": "/name/nm0000005/", "name": "Ingmar Bergman"}, "creator": [{"@type": "Person", "url": "/name/nm0000005/", "name": "Ingmar Bergman"}, {"@type": "Organization", "url": "/company/co0437649/"}], "description": "Persona is a movie starring Bibi Andersson, Liv Ullmann, and Margaretha Krook. A nurse is put in charge of a mute actress and finds that their personae are melding together.", "datePublished": "1966-10-18", "keywords": "silence,patient,mute character,intercepted letter,sex on beach", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 104735, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0060827/"}, "author": {"@type": "Person", "name": "dromasca"}, "dateCreated": "2019-05-18", "inLanguage": "English", "name": "the enigmas of 'Persona'", "reviewBody": "'Persona' is one of the most enigmatic movies in the history of cinema. Those who read the chronicles written right after the 1966 release of the film or the articles dedicated to it in the books of cinema history will encounter as many interpretations as authors. The same happens if we read the opinions written by film lovers on sites like IMDB, or we discuss the film between us. Ingmar Bergman had the inspiration not only of not talking a lot about this film (even less than about his other films) but he also avoided sharing too much of his personal thoughts or ideas even with the actresses or the other members of the production team. The result is an enigma. Each of us who sees or sees again this movie has his own Persona'.\n\nThe ambitions are clear from the way the film is 'packaged' using the classic projection room effects. Short sequences from classical films emphasize the effect of declaring 'here we have a work of cinema'. The prelude sets up an atmosphere that could be defined as a dream, we are clearly in a world that resembles the real world but which exists only in the eyes and souls of the spectators, built with materials put together by the creator of the film from his own thoughts and dreams about the world. The 'story' could be told in few words, even if it is not a banal story. This is where the interpretations begin. What do we actually see on the screen? An ambiguous relationship between two women, evolving from a patient-care relationship to an attraction that starts to look as a melding of one into the other? Are the two characters the symbols of the two facets of the human personality - the soul and the character - as interpreted by some experts in the psychoanalysis theories? Is there a hint (or more) to a lesbian relationship? Maybe there is an element of class struggle, between the actress active on the intellectual level and the country girl whose strongest emotions are on the erotic plane? Are we dealing with a horror story, a thriller in which there is a physical threat and a struggle between the two women to gain control one over the other? Why did the actress stop talking - personal traumas, maternity failure? What is the connection between the horrors of the outside world (wars, the Holocaust) and the inner storms concealed by the Scandinavian calm? These are just a few of the questions that can be asked and of the possible interpretations.\n\nComprehensive and ambitious cinematographic constructions involve risks. More than 50 years after the film, the Vietnam War is no longer actuality but history, closer to the Holocaust which is also quoted by the famous photograph of the terrorized little boy in the Warsaw ghetto. The black and white image also gains aesthetic significance, not necessarily obvious and intentional at the time the film was made. Acting is gorgeous, Bergman's two preferred actresses (and lovers), Bibi Andersson and Liv Ullmann are building on the screen two versions of femininity that at some point merge one into the other, two variants of the director's fascination with women for which he created the most generous roles in his films. Seen for the first time or seen again today, 'Persona' is a cinematic art concentrate and an intellectual challenge that continues to attract and fascinate through its open character and enigmas.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H23M", "trailer": {"@type": "VideoObject", "name": "Persona", "embedUrl": "/video/imdb/vi1884797977", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTIxNjBiZGYtNWE4MC00MThhLWE1ZGItMDIyMzA2MTYxNzM1XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTIxNjBiZGYtNWE4MC00MThhLWE1ZGItMDIyMzA2MTYxNzM1XkEyXkFqcGdeQTNwaW5nZXN0._V1_.jpg", "description": "Theatrical Trailer", "uploadDate": "2019-08-03T17:13:37Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000761/?ref_=tt_cl_t1", "name": "Bibi Andersson"}, "character_and_episodes": [{"url": "/title/tt0060827/characters/nm0000761?ref_=tt_cl_t1", "name": "Alma"}]}, {"actor": {"@type": "Person", "url": "/name/nm0472234/?ref_=tt_cl_t3", "name": "Margaretha Krook"}, "character_and_episodes": [{"url": "/title/tt0060827/characters/nm0472234?ref_=tt_cl_t3", "name": "The Doctor"}]}, {"actor": {"@type": "Person", "url": "/name/nm0880521/?ref_=tt_cl_t2", "name": "Liv Ullmann"}, "character_and_episodes": [{"url": "/title/tt0060827/characters/nm0880521?ref_=tt_cl_t2", "name": "Elisabet Vogler"}]}, {"actor": {"@type": "Person", "url": "/name/nm0085038/?ref_=tt_cl_t4", "name": "Gunnar Björnstrand"}, "character_and_episodes": [{"url": "/title/tt0060827/characters/nm0085038?ref_=tt_cl_t4", "name": "Mr. Vogler"}]}]}