{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0074906/", "name": "The Missouri Breaks", "image": "https://m.media-amazon.com/images/M/MV5BMjI5NDY1Mzg5NF5BMl5BanBnXkFtZTcwMTIzODI1NA@@._V1_.jpg", "genre": ["Drama", "Western"], "contentRating": "PG", "actor": [{"@type": "Person", "url": "/name/nm0000008/", "name": "Marlon Brando"}, {"@type": "Person", "url": "/name/nm0000197/", "name": "Jack Nicholson"}, {"@type": "Person", "url": "/name/nm0001642/", "name": "Randy Quaid"}, {"@type": "Person", "url": "/name/nm0516049/", "name": "Kathleen Lloyd"}], "director": {"@type": "Person", "url": "/name/nm0671957/", "name": "Arthur Penn"}, "creator": [{"@type": "Person", "url": "/name/nm0570078/", "name": "Thomas McGuane"}, {"@type": "Person", "url": "/name/nm0001801/", "name": "Robert Towne"}, {"@type": "Organization", "url": "/company/co0106767/"}], "description": "The Missouri Breaks is a movie starring Marlon Brando, Jack Nicholson, and Randy Quaid. Tom Logan is a horse thief. Rancher David Braxton has horses, and a daughter, worth stealing. But Braxton has just hired Lee Clayton, an...", "datePublished": "1976-05-19", "keywords": "horse thief,horse ranch,missouri river,vigilante,hired killer", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 9746, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0074906/"}, "author": {"@type": "Person", "name": "eht5y"}, "dateCreated": "2004-07-26", "inLanguage": "English", "name": "Worth a look for Brando's Eccentric Performance", "reviewBody": "'The Missouri Breaks' was filmed from a screenplay by National Book Award-winner Thomas McGuane, whose novels are often characterized as 'revisionist westerns', a sort of sub genre in which the romantic conventions of the western--the noble, idealized hero in the white hat taking on swarthy outlaws or bloodthirsty Indians, occasionally aided by a lone, sage, 'noble savage'-type Indian sidekick--are upended for the sake of a muddier, morally ambiguous, more historically truthful account of 'how the west was won.'\n\nSuffice it to say that there are no heroes in 'The Missouri Breaks.' Our protagonist, Tom Logan (Jack Nicholson), is the de facto leader of a gang of fun-loving outlaws in post-Civil War Montana, pistoleros who make their living stealing horses from wealthy ranchers, laughing all the way, a bit like Robin Hood's Merry Men, only Logan and his boys keep the money and spend it on whiskey and whores. Egomaniacal rancher David Braxton (John McLiam) captures and hangs one of Logan's gang, which retaliates by returning the favor to Braxton's ranch foreman on the same noose. Intent on ridding the country of horse thieves and avenging his friend's murder, Braxton sends for Robert E. Lee Clayton (Marlon Brando), the most feared of the Regulators, mercenary frontier detectives famous for their ruthlessness and their ability to kill suddenly and without warning from long distances with their trademark Creekmore long-rifles.\n\nPosing as an aspiring cattle-rancher, Logan buys an abandoned ranch next to Braxton's property to serve as a relay station for moving stolen horses across the plains. He is left to mind the ranch while his buddies move the latest take of horses, and while busying himself reviving the ranch's garden and orchard, Logan begins a relationship with Braxton's daughter Jane (Kathleen Lloyd). Jane suspects that Logan is an outlaw, which makes him only more appealing to her, as she has grown to resent her father's tyranny, particularly after witnessing the slow death of the young horse thief from Logan's gang. \n\nEnter Robert E. Lee Clayton, one of the strangest and most curious of Marlon Brando's acting creations. 'The Missouri Breaks' was Brando's last starring role before 'Apocalypse Now!' (1979), and was preceded by 'The Godfather' (1972) and 'Last Tango in Paris (1972). Like Coppola and Bertolucci, director Arthur Penn (Bonnie and Clyde) clearly sensed that the best thing to do with Brando the Mad Genius was to sit back and watch. From the moment Brando's Clayton appears--bursting in on the funeral of the murdered foreman dressed like a western dandy in fringed leather coat and scarf, bellowing and yanking the corpse up out of the open casket to borrow a few of the ice cubes used to keep the body from decomposing as a compress for a tooth-ache--we know we are in for some vintage Brando.\n\nNicholson is typically likable, but he isn't given much to work with; 'The Missouri Breaks' is clearly Brando's show, as he systematically works his way through Logan's gang, farting, spritzing himself with perfume, dressing in drag as a frontier granny, singing love songs to his horse, and delivering odd soliloquy's while constantly munching on carrots. Lee Clayton is comic, but he is also sadistic and perverse. Brando seems to be having the time of his life, and it's a genuine pleasure to watch one of the most brilliant and magnetic screen actors of all time given free reign to fashion the lunatic Clayton.\n\nLike much of McGuane's fiction, 'The Missouri Breaks' has a muted, understated tone disturbed only by acts of brutal, unsentimental violence. The scenes and dialogue are meant to reflect the stark beauty of the Montana plains along the fall line of the great Missouri River (the title of the film refers to the long stretch of the river between the plains and the mountains, the corridor by which Lewis and Clark made their way to the Pacific). The plot is fairly predictable once Lee Clayton arrives and starts hunting the horse rustlers, and so the film's main pleasure is in the acting performances, of which only Brando's is truly exceptional. Nicholson can do no wrong, but Tom Logan is a relatively bland, inarticulate character, and, hidden behind an unruly beard, Nicholson's facial expressions can't compensate for the minimalistic dialogue to create a more distinct character. There is little apparent chemistry between Nicholson and Kathleen Lloyd, who followed this film up with winners like 'Deathmobile' and 'Skateboard: The Movie' before settling into a long string of guest shots on TV. Given all the fun Brando seems to be having, Jack must have felt gypped.\n\n'The Missouri Breaks' is all about Brando, and is well-worth watching just for his scenes. It also features an excellent soundtrack by John Williams ('The Missouri Breaks', interestingly, was Williams' project between 'Jaws' and 'Star Wars') and fine supporting performances by Frederic Forrest ('Chef' in 'Apocalypse Now!'), Randy Quaid (a very much underrated dramatic actor in his younger, pre-'Vacation' days), and cult-favorite Harry Dean Stanton ('Wise Blood,' 'Repo Man,' 'Paris Texas') as Logan's fellow horse-thieves. Jack is Jack--one of the greats, with a career that easily stacks up to Brando's--but here, unfortunately, he's stuck playing the straight man to Brando's nut-case, making the movie a disappointment for viewers hoping to see two of film's finest actors at their best."}, "duration": "PT2H6M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi3276718361", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGM2Zjk2YTEtYThiYy00YzY3LWExNTQtNzlkODljMTkyMmUxXkEyXkFqcGdeQXN3aWZ0dw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGM2Zjk2YTEtYThiYy00YzY3LWExNTQtNzlkODljMTkyMmUxXkEyXkFqcGdeQXN3aWZ0dw@@._V1_.jpg", "description": "Tom Logan is a horse thief. Rancher David Braxton has horses, and a daughter, worth stealing. But Braxton has just hired Lee Clayton, an infamous \"regulator\", to hunt down the horse thieves; one at a time.", "uploadDate": "2021-02-22T17:05:40Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000008/?ref_=tt_cl_t1", "name": "Marlon Brando"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0000008?ref_=tt_cl_t1", "name": "Lee Clayton"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001642/?ref_=tt_cl_t3", "name": "Randy Quaid"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0001642?ref_=tt_cl_t3", "name": "Little Tod"}]}, {"actor": {"@type": "Person", "url": "/name/nm0002078/?ref_=tt_cl_t5", "name": "Frederic Forrest"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0002078?ref_=tt_cl_t5", "name": "Cary"}]}, {"actor": {"@type": "Person", "url": "/name/nm0572897/?ref_=tt_cl_t7", "name": "John McLiam"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0572897?ref_=tt_cl_t7", "name": "David Braxton"}]}, {"actor": {"@type": "Person", "url": "/name/nm0319462/?ref_=tt_cl_t9", "name": "Sam Gilman"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0319462?ref_=tt_cl_t9", "name": "Hank Rate"}]}, {"actor": {"@type": "Person", "url": "/name/nm0103071/?ref_=tt_cl_t11", "name": "Richard Bradford"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0103071?ref_=tt_cl_t11", "name": "Pete Marker"}]}, {"actor": {"@type": "Person", "url": "/name/nm0026035/?ref_=tt_cl_t13", "name": "Luana Anders"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0026035?ref_=tt_cl_t13", "name": "Rancher's Wife"}]}, {"actor": {"@type": "Person", "url": "/name/nm0902608/?ref_=tt_cl_t15", "name": "Hunter von Leer"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0902608?ref_=tt_cl_t15", "name": "Sandy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000197/?ref_=tt_cl_t2", "name": "Jack Nicholson"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0000197?ref_=tt_cl_t2", "name": "Tom Logan"}]}, {"actor": {"@type": "Person", "url": "/name/nm0516049/?ref_=tt_cl_t4", "name": "Kathleen Lloyd"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0516049?ref_=tt_cl_t4", "name": "Jane Braxton"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001765/?ref_=tt_cl_t6", "name": "Harry Dean Stanton"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0001765?ref_=tt_cl_t6", "name": "Calvin"}]}, {"actor": {"@type": "Person", "url": "/name/nm0752636/?ref_=tt_cl_t8", "name": "John P. Ryan"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0752636?ref_=tt_cl_t8", "name": "Si"}]}, {"actor": {"@type": "Person", "url": "/name/nm0291266/?ref_=tt_cl_t10", "name": "Steve Franken"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0291266?ref_=tt_cl_t10", "name": "The Lonesome Kid"}]}, {"actor": {"@type": "Person", "url": "/name/nm0338783/?ref_=tt_cl_t12", "name": "James Greene"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0338783?ref_=tt_cl_t12", "name": "Hellsgate Rancher"}]}, {"actor": {"@type": "Person", "url": "/name/nm0325761/?ref_=tt_cl_t14", "name": "Danny Goldman"}, "character_and_episodes": [{"url": "/title/tt0074906/characters/nm0325761?ref_=tt_cl_t14", "name": "Baggage Clerk"}]}]}