{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0368794/", "name": "I'm Not There", "image": "https://m.media-amazon.com/images/M/MV5BMTY4MzM2MjcwNV5BMl5BanBnXkFtZTcwODg3MDU1MQ@@._V1_.jpg", "genre": ["Biography", "Drama", "Music"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000288/", "name": "Christian Bale"}, {"@type": "Person", "url": "/name/nm0000949/", "name": "Cate Blanchett"}, {"@type": "Person", "url": "/name/nm0005132/", "name": "Heath Ledger"}, {"@type": "Person", "url": "/name/nm0924210/", "name": "Ben Whishaw"}], "director": {"@type": "Person", "url": "/name/nm0001331/", "name": "Todd Haynes"}, "creator": [{"@type": "Person", "url": "/name/nm0001331/", "name": "Todd Haynes"}, {"@type": "Person", "url": "/name/nm0610219/", "name": "Oren Moverman"}, {"@type": "Person", "url": "/name/nm0001331/", "name": "Todd Haynes"}, {"@type": "Organization", "url": "/company/co0030755/"}, {"@type": "Organization", "url": "/company/co0037310/"}, {"@type": "Organization", "url": "/company/co0177677/"}, {"@type": "Organization", "url": "/company/co0112971/"}, {"@type": "Organization", "url": "/company/co0150452/"}, {"@type": "Organization", "url": "/company/co0075896/"}, {"@type": "Organization", "url": "/company/co0363965/"}, {"@type": "Organization", "url": "/company/co0170376/"}, {"@type": "Organization", "url": "/company/co0100740/"}, {"@type": "Organization", "url": "/company/co0142412/"}, {"@type": "Organization", "url": "/company/co0119372/"}], "description": "I'm Not There is a movie starring Christian Bale, Cate Blanchett, and Heath Ledger. Ruminations on the life of Bob Dylan, where six characters embody a different aspect of the musician's life and work.", "datePublished": "2007-09-07", "keywords": "bare butt,voyeur,female voyeur,voyeurism,actor", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 56669, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.9"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0368794/"}, "author": {"@type": "Person", "name": "Chris Knipp"}, "dateCreated": "2007-10-03", "inLanguage": "English", "name": "A film biography that's complex, like  its subject", "reviewBody": "Haynes' adventurous biopic of Bob Dylan, which uses six actors of both sexes and several races ranging in ages from 11 to 50, is both exhausting and fun to watch. It's also hard to describe. But let's start with those six and the characters or facets they portray. Arthur (Ben Whishaw) is the Dylan who incarnated Rimbaud and serves as a kind of narrator whom we see smoking and giving ironic answers to some kind of inquisition sporadically throughout the film. Woody (the wonderful young Marcus Carl Franklin, an amazing a singer and actor) is a precocious rail-hopper with a guitar (labeled like the real Woody's, THIS MACHINE KILLS FASCISTS) and tall tales that start with his claim that he's Woody Guthrie. Woody's scenes show him rescued by a black family and a white family and performing with country black musicals. He represents the early shape-shifting Dylan in search of an identity and telling a lot of lies along the way.\n\nJack (Christian Bale) is the Dylan who became a hit in Greenwich Village and went into the South and sang \"The Ballad of Hattie Carroll\" and other protest \"folk songs,\"\u0097the high-profile \"political\" Dylan who spearheaded a movement and became famous with his brilliant early LP's. But Jack doesn't want to be typecast and \"betrays\" his adoring public and his lover and folksinging champion Alice (Julianne Moore), a Joan Baez stand-in seen in later \"interviews.\" Jack disappears and his place is taken by Robbie (Heath Ledger), a young actor in New York who becomes famous for starring in a 1965 film depicting the vanished Jack. Robbie meets Claire (Charlotte Gainsbourg) in a Village coffee shop and falls in love, and a turbulent ten-year marriage follows, winding up painfully at the time of the Vietnam War's end.\n\nIf Jack represents the cast-off early style and Robbie represents Dylan's family life, Jude (Cate Blanchett) is Dylan the artist, quintessentially as seen in the mid-to-late Sixties when he toured England (an event notably chronicled by two Leacock-Pennebaker documentaries)\u0097and shocked his audiences, some of whose members felt betrayed and shouted \"Judas!\", when he shifted from solo guitar and harmonica to more personal songs with loud rock accompaniment. Jude's segments are partly borrowed from Pennebaker, but largely consist of gorgeous black and white scenes deliberately and \"churlishly\" (Haynes' word) imitative of Fellini's 8 ½.\n\nJude's new style is admired by Allen Ginsberg (David Cross) and underground groupie Coco Rivington (Michelle Williams) and he becomes internationally famous. But he continues to be misunderstood by the protest music old guard and conventional journalists like the British TV host Mr. Jones (Bruce Greenwood)\u0097who's incorporated into a music video for Highway 61 Revisited's \"Ballad of a Thin Man\": \". . .something is happening here /And you don't know what it is, do you, Mister Jones.\" . .\n\nJude and Arthur articulate the early Dylan's challenging, ironic stance to the public, but Jude is exhausted on tour and his nihilism leads him to an existential crisis.\n\nHe's reborn symbolically in Pastor John (Christian Bale again), who's moved to Stockton twenty years later and become a born-again preacher, singing his own gospel songs. Finally the last version of Dylan appears in Billy (Richard Gere), in full retreat from the world\u0097till threats to destroy his town of Riddle cause him to enter public life again. This sequence evokes a Sixties historical western in which Pat Garrett (Bruce Greenwood) is a character.\n\nThis is only the barest outline of the two-and-a-quarter-hour film, in which various \"Dylan's\" are woven in and out. Maybe the reason why I found Woody's sequences delightful and Billy's colorful but wearying has to do with the latter's coming two hours later. But Gere and his sequences evoke Dylan less well and are puzzling to interpret. Blanchett's in contrast are, of course, the most conventionally straightforward. She's the only one who successfully mimics the physical appearance and the speaking voice of the artist (unless Whishaw does a better job with the voice). But Blanchett's mimicry is intentionally undercut (and the biopic conventionality of films like Ray avoided) by having Jude be played by a woman\u0097which was planned by Haynes in his screenplay before he even chose his actor.\n\nThe method Haynes has chosen avoids cliché. This is still a biopic, but it's a sophisticated one; and the fractured portrait is well justified by the nature of its subject. Dylan has always been a shape-shifter; some of his permutations were left out, such as the period of the orthodox Jew and JDL supporter. But it's intelligent to see Dylan the man, the husband, the artist, the political being, and the religious being as completely separate entities because no simple biopic sequence can really dramatize the complexity of such an artist and such a protean existence. Haynes' film makes you think about biography itself, as well as giving imaginative shape to aspects of Bob Dylan no non-fiction account can really provide.\n\nMaybe it's the daringly experimental methodology that led Dylan himself, approached through his eldest son Jesse,to grant Haynes both the musical rights and the biographical rights. Haynes has chosen a multifaceted and original way of using Dylan's songs. Only Franklin actually performs them with his own voice. Otherwise the soundtrack mixes original Dylan recordings with existing covers, new ones by people as widely various as Ritche Havens, Iggy Pop, John Doe and Sonic Youth, and other music, including, appropriately for the 8 ½- esquire sequences, Nino Rota. There is a voice-over narration by Kris Kristofferson. Haynes worked on the screenplay for years, and then collaborated with Oren Moverman.\n\nNot for mainstream audiences or be prime Oscar bait, but a challenging, fun watch. \n\nShown in the press screenings of the New York Film Festival at Lincoln Center 2007. Haynes was present fort a Q&A afterward with J. Hoberman of the Village Voice, which revealed that the director is an intelligent and articulate man and who knows his Dylan.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT2H15M", "trailer": {"@type": "VideoObject", "name": "I'm Not There", "embedUrl": "/video/imdb/vi2746286361", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BODY5MzM2Mzg3MF5BMl5BanBnXkFtZTgwMDEyODYzMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODY5MzM2Mzg3MF5BMl5BanBnXkFtZTgwMDEyODYzMzE@._V1_.jpg", "description": "I'm Not There - Trailer", "uploadDate": "2007-09-12T08:48:47Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000949/?ref_=tt_cl_t1", "name": "Cate Blanchett"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm0000949?ref_=tt_cl_t1", "name": "Jude"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000288/?ref_=tt_cl_t3", "name": "Christian Bale"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm0000288?ref_=tt_cl_t3", "name": "Jack"}, {"url": "/title/tt0368794/characters/nm0000288?ref_=tt_cl_t3", "name": "Pastor John"}]}, {"actor": {"@type": "Person", "url": "/name/nm1634963/?ref_=tt_cl_t5", "name": "Marcus Carl Franklin"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm1634963?ref_=tt_cl_t5", "name": "Woody"}, {"url": "/title/tt0368794/characters/nm1634963?ref_=tt_cl_t5", "name": "Chaplin Boy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001434/?ref_=tt_cl_t7", "name": "Kris Kristofferson"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm0001434?ref_=tt_cl_t7", "name": "Narrator"}]}, {"actor": {"@type": "Person", "url": "/name/nm0481024/?ref_=tt_cl_t9", "name": "Roc LaFortune"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm0481024?ref_=tt_cl_t9", "name": "Hobo Moe"}]}, {"actor": {"@type": "Person", "url": "/name/nm0128512/?ref_=tt_cl_t11", "name": "Paul Cagelet"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm0128512?ref_=tt_cl_t11", "name": "Carny"}, {"url": "/title/tt0368794/characters/nm0128512?ref_=tt_cl_t11", "name": "Bell-Hop"}]}, {"actor": {"@type": "Person", "url": "/name/nm1055448/?ref_=tt_cl_t13", "name": "Pierre-Alexandre Fortin"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm1055448?ref_=tt_cl_t13", "name": "Gorgeous George"}]}, {"actor": {"@type": "Person", "url": "/name/nm0072419/?ref_=tt_cl_t15", "name": "Tyrone Benskin"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm0072419?ref_=tt_cl_t15", "name": "Mr. Arvin"}]}, {"actor": {"@type": "Person", "url": "/name/nm0924210/?ref_=tt_cl_t2", "name": "Ben Whishaw"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm0924210?ref_=tt_cl_t2", "name": "Arthur"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000152/?ref_=tt_cl_t4", "name": "Richard Gere"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm0000152?ref_=tt_cl_t4", "name": "Billy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0005132/?ref_=tt_cl_t6", "name": "Heath Ledger"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm0005132?ref_=tt_cl_t6", "name": "Robbie"}]}, {"actor": {"@type": "Person", "url": "/name/nm0290475/?ref_=tt_cl_t8", "name": "Don Francks"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm0290475?ref_=tt_cl_t8", "name": "Hobo Joe"}]}, {"actor": {"@type": "Person", "url": "/name/nm0206479/?ref_=tt_cl_t10", "name": "Larry Day"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm0206479?ref_=tt_cl_t10", "name": "Government Agent"}]}, {"actor": {"@type": "Person", "url": "/name/nm3006010/?ref_=tt_cl_t12", "name": "Brian R.C. Wilmes"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm3006010?ref_=tt_cl_t12", "name": "Circus Man"}]}, {"actor": {"@type": "Person", "url": "/name/nm0369784/?ref_=tt_cl_t14", "name": "Richie Havens"}, "character_and_episodes": [{"url": "/title/tt0368794/characters/nm0369784?ref_=tt_cl_t14", "name": "Old Man Arvin"}]}]}