{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0059968/", "name": "Batman", "image": "https://m.media-amazon.com/images/M/MV5BMTkzNDY5NTg5MF5BMl5BanBnXkFtZTgwNzI4NzM1MjE@._V1_.jpg", "genre": ["Action", "Adventure", "Comedy", "Crime", "Family", "Fantasy", "Mystery", "Sci-Fi"], "contentRating": "TV-G", "actor": [{"@type": "Person", "url": "/name/nm0001842/", "name": "Adam West"}, {"@type": "Person", "url": "/name/nm0911431/", "name": "Burt Ward"}, {"@type": "Person", "url": "/name/nm0621002/", "name": "Alan Napier"}, {"@type": "Person", "url": "/name/nm0358076/", "name": "Neil Hamilton"}], "creator": [{"@type": "Person", "url": "/name/nm0783913/", "name": "Lorenzo Semple Jr."}, {"@type": "Person", "url": "/name/nm0236546/", "name": "William Dozier"}, {"@type": "Organization", "url": "/company/co0056447/"}, {"@type": "Organization", "url": "/company/co0036834/"}], "description": "Batman is a TV series starring Adam West, Burt Ward, and Alan Napier. The Caped Crusader and his young ward battle evildoers in Gotham City.", "datePublished": "1966-01-12", "keywords": "gotham city,super villain,robin character,batman character,camp", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 19084, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0059968/"}, "author": {"@type": "Person", "name": "DeanNYC"}, "dateCreated": "2006-08-24", "inLanguage": "English", "name": "Absurd Persons, Plural", "reviewBody": "Looking back at this program from its completion through all of the episodes, it's easy to characterize it as being a campy version of Bob Kane's Dark Knight legend. But I'm not at all certain that it had to be...\n\nIn fact, in looking at the first two episodes, which featured Frank Gorshin as the first \"Special Guest Villain,\" The Riddler, the program was quite hard-nosed, pretty straight and sinister (considering the costuming of the lead players), and actually somewhat poignant with the performance of Jill St. John. I would compare these first two episodes with any adventure series and say that they hold their own.\n\nOf course, what happened was that with the wild Rogue's Gallery of villains, the over-the-top costuming, the dutch angle camera setups, with the straight-laced line reads of the two heroes, and the bugle like narration of \"Desmond Doomsday\" (the alias for Producer William Dozier) Batman was destined to be seen as nothing but pure camp. Not that that's bad, unless you feel this tarnished the legend of The Caped Crusader.\n\nMeanwhile, the show became the hottest thing happening, nearly overnight. All sorts of acting greats wanted their chance to challenge the Dynamic Duo, and unlikely villains played by Liberace, Van Johnson, Art Carney and Zsa Zsa Gabor all appeared, in addition to the semi-regular performers, Caesar Romero, Burgess Meredith, Julie Newmar and the aforementioned Gorshin. Those that couldn't be villains turned up in cameos, from Dick Clark to Sammy Davis Jr. to Santa Claus (as portrayed by old time actor Andy Divine) all had a moment of Batman and Robin's time. Though perhaps the most puzzling cameo was when Colonel Klink of \"Hogan's Heroes\" turned up at a Gotham City window. Not only was he from presumably 23 years in the past, he would have been a Nazi in an American city AND he was from a program on another network! If you know of an explanation for this, please pass it along.\n\nThe elements that made the show work were the Batmobile, a beautiful and evocative vehicle that transported the heroes from their secret location the 14 miles to Gotham City before the opening credits for that episode were finished. It's still one of the most instantly recognized automobiles, based on the 1955 Lincoln Futura and restyled by George Barris. Add in the gadgetry, Batman's utility belt, the bust of Shakespeare that held the switch that opened the bookcase... \"To the batpoles!\" and of course, the talents of the stars, Adam West, Burt Ward, Alan Napier, who was nothing short of brilliant as Alfred, Neil Hamilton and Stafford Repp as the commissioner and chief of police and later the charm of Yvonne Craig as the addition to create \"The Terrific Trio.\"\n\nBut even as the formula was working, it was wearing out its welcome as it went, and by the time the show started their third season, the ratings were clearly slipping possibly due to the tone change making the episodes sillier rather than more adventuresome. Despite the addition of Batgirl, and a change in the format so that each episode was self contained, rather than having a two part cliffhanger, the magical run ended and ABC canceled it.\n\nThere was a rumor that NBC was interested in giving the program a fourth season, however 20th Century Fox, the production company for the series had already demolished the centerpiece of the program, the batcave set, and NBC was unwilling to spend the time and money to rebuild it.\n\nProbably just as well, as Batman has since been through numerous incarnations to get back to the standard that Bob Kane originally had for him.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "trailer": {"@type": "VideoObject", "name": "Batman", "embedUrl": "/video/imdb/vi464764185", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNjY2ZDAwZjgtY2FlYy00OWJjLTk2YTMtNDNjYzQyZDc3NmNhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNjY2ZDAwZjgtY2FlYy00OWJjLTk2YTMtNDNjYzQyZDc3NmNhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "Batman", "uploadDate": "2019-03-14T23:50:37Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0001842/?ref_=tt_cl_t1", "name": "Adam West"}, "character_and_episodes": [{"url": "/title/tt0059968/characters/nm0001842?ref_=tt_cl_t1", "name": "Batman"}, {"url": "#", "name": "120 episodes, 1966-1968"}]}, {"actor": {"@type": "Person", "url": "/name/nm0621002/?ref_=tt_cl_t3", "name": "Alan Napier"}, "character_and_episodes": [{"url": "/title/tt0059968/characters/nm0621002?ref_=tt_cl_t3", "name": "Alfred"}, {"url": "#", "name": "120 episodes, 1966-1968"}]}, {"actor": {"@type": "Person", "url": "/name/nm0720106/?ref_=tt_cl_t5", "name": "Stafford Repp"}, "character_and_episodes": [{"url": "/title/tt0059968/characters/nm0720106?ref_=tt_cl_t5", "name": "Chief O'Hara"}, {"url": "#", "name": "120 episodes, 1966-1968"}]}, {"actor": {"@type": "Person", "url": "/name/nm0911431/?ref_=tt_cl_t2", "name": "Burt Ward"}, "character_and_episodes": [{"url": "/title/tt0059968/characters/nm0911431?ref_=tt_cl_t2", "name": "Robin"}, {"url": "#", "name": "120 episodes, 1966-1968"}]}, {"actor": {"@type": "Person", "url": "/name/nm0358076/?ref_=tt_cl_t4", "name": "Neil Hamilton"}, "character_and_episodes": [{"url": "/title/tt0059968/characters/nm0358076?ref_=tt_cl_t4", "name": "Commissioner Gordon"}, {"url": "#", "name": "120 episodes, 1966-1968"}]}, {"actor": {"@type": "Person", "url": "/name/nm0086636/?ref_=tt_cl_t6", "name": "Madge Blake"}, "character_and_episodes": [{"url": "/title/tt0059968/characters/nm0086636?ref_=tt_cl_t6", "name": "Mrs. Cooper"}, {"url": "#", "name": "96 episodes, 1966-1967"}]}]}