{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0095327/", "name": "Hotaru no haka", "image": "https://m.media-amazon.com/images/M/MV5BZmY2NjUzNDQtNTgxNC00M2Q4LTljOWQtMjNjNDBjNWUxNmJlXkEyXkFqcGdeQXVyNTA4NzY1MzY@._V1_.jpg", "genre": ["Animation", "Drama", "War"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm0851302/", "name": "Tsutomu Tatsumi"}, {"@type": "Person", "url": "/name/nm0794186/", "name": "Ayano Shiraishi"}, {"@type": "Person", "url": "/name/nm0945312/", "name": "Akemi Yamaguchi"}, {"@type": "Person", "url": "/name/nm0794002/", "name": "Yoshiko Shinohara"}], "director": {"@type": "Person", "url": "/name/nm0847223/", "name": "Isao Takahata"}, "creator": [{"@type": "Person", "url": "/name/nm0636435/", "name": "Akiyuki Nosaka"}, {"@type": "Person", "url": "/name/nm0847223/", "name": "Isao Takahata"}, {"@type": "Organization", "url": "/company/co0057589/"}, {"@type": "Organization", "url": "/company/co0048420/"}], "description": "Hotaru no haka is a movie starring Tsutomu Tatsumi, Ayano Shiraishi, and Akemi Yamaguchi. A young boy and his little sister struggle to survive in Japan during World War II.", "datePublished": "1988-04-16", "keywords": "orphan,food,survival,older brother younger sister,homelessness", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 238568, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0095327/"}, "author": {"@type": "Person", "name": "Theoron"}, "dateCreated": "1999-12-07", "inLanguage": "English", "name": "One of the finest films ever made.", "reviewBody": "Occasionally there's a film that literally changes one's perceptions of the world.   `Grave of the Fireflies' is one of those films.    No movie ever made generates such an intense and powerful emotional response as this one. \n\n It's an animated film set in Japan during the closing days of World War II. Two children; a boy named Seita and his much younger sister Setsuko; must quickly learn to cope with life after their mother is killed during a fire-bombing raid by American B-29's.    The film starts with the children and their mother preparing for the attack, then follows the children as they attempt to survive the death of their mother, and the possible death of their father, a naval officer serving aboard the Japanese heavy cruiser `Maya.'  (A US submarine torpedoed the `Maya' in late October of 1944 during the battle of Leyte Gulf.)\n\nThe story of two orphans trying to survive in war-ravaged Japan is not the subject of your typical light-hearted animated film.   In fact it may be much too serious for anyone under the age of 14.  The first five minutes of the film hits one like a sledgehammer \u0096 by far the most emotional opening scene I've ever come across.  I found myself already reaching for the tissues, and trying to choke back the tears.\n\nYet there's more than just tragedy in `Grave of the Fireflies.' It is the most awesome love story one is ever likely to see.  But it's far from the typical Hollywood idea of a love story.   Instead of the usual highly attractive Hollywood actors of the opposite sex pining for one another in front of the camera, we have an animated Japanese brother and his much younger little sister.   It's not a tale of romantic love, but one of `brotherly' love.  \n\nSeita loves his little sister, and once he discovers that his mother has been killed in the bombing, he does everything he can to keep his sister from finding out about her horrible death.   Then, with typical Japanese seriousness, he begins to immediately provide for and comfort Setsuko; she being the only member of his immediate family he has left.   Though not stated in the film, it seems obvious that part of Seita's motivation for looking so carefully after his sister has to do with avoiding his own pain and despair having been left with NOTHING after the bombing attack.   No mother, no father, no home.   The war Japan is waging against the rest of the world takes its toll on these two little ones, without regard for their feelings or emotions.\n\nThat which truly broke my heart into ten thousand tiny pieces was the selfless way Seita looked after his younger sister, and shielded her from the horrors all around, especially the lack of food.  Films show us many things, some good, some evil, but rarely has any film shown how one person so unselfishly puts another ahead of them self.   Seita does makes some mistakes in the way he goes about taking care of his sister, but I can't fault him for his love and his devotion.   Who of us have always chosen the best path, the most perfect way of doing things?   Surely not I!   Seita's obvious love and devotion to Setsuko is the most moving and convicting thing I've ever come across on film. \n\nI use the word `convicting' because this movie convicted me of my own very selfish nature.   `Grave of the Fireflies' caused me sadness not just because of Seita's brave attempts to take care of his little sister; but because he gave of himself so totally and completely, even though his sister was a liability to his own survival.   I could not help to be convicted concerning all the many times there have been family and friends who have needed my help or understanding, but I ignored them in favor of `doing my own thing.'   How sad I am for all those times I've ignored the suffering of others and their cries for help.   This film showed the evil in my own heart \u0096 something that I would not have noticed on my own.  But now that the blinders have been removed, I can repent of my selfishness, and look for ways to help others, instead of avoiding them.\n\n Some Japanese anime I've seen are very much anti-American.  But even though it's the Americans dropping the bombs in this film, there is no overt anti-American message.   In many ways, the Japanese civilians are shown in as bad a light as is the American air and naval forces!   Their hard hearts and stubborn ways are displayed on the screen without apology; and one can see how the plight of the two children is made even worst by the selfishness of the adults that they have come to rely upon. \n\nIt would be easy for someone from `the West' (i.e. the USA, Canada, Western Europe, Australia, etc.) to think that the two children depicted in this animated marvel were the exception, rather than the rule.  They lived in very trying times, and surely children in this day and age do not have to go through experiences similar to Seita's and Setsuko's.  Unfortunately, that's not the case.   There are still major problems with orphans and unwanted children in the former communist block countries of Eastern Europe and Russia itself.  There are also large numbers of unwanted children roaming the streets of China, India, Mongolia, and various other Asian nations.   We may not here about it on the news, or hear our friends talk about it; but I assure you that there are literally millions of children around the world whose situation is no better, if not much worst than that of Seita and Setsuko.      \n\nI am very thankful I had the honor of watching this film.   I'm also very thankful for the people who put it together.   But most of all, I'm very thankful for the positive impact it has had on my life."}, "duration": "PT1H29M", "trailer": {"@type": "VideoObject", "name": "Grave of the Fireflies", "embedUrl": "/video/imdb/vi1377679385", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTNmNWM4OWUtMTcxZi00ODA1LWE1NWMtOTk3Mjg3ZDIyYWI0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTNmNWM4OWUtMTcxZi00ODA1LWE1NWMtOTk3Mjg3ZDIyYWI0XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Trailer for Grave of Fireflies", "uploadDate": "2018-03-21T17:43:26Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0851302/?ref_=tt_cl_t1", "name": "Tsutomu Tatsumi"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm0851302?ref_=tt_cl_t1", "name": "Seita"}]}, {"actor": {"@type": "Person", "url": "/name/nm0794002/?ref_=tt_cl_t3", "name": "Yoshiko Shinohara"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm0794002?ref_=tt_cl_t3", "name": "Mother"}]}, {"actor": {"@type": "Person", "url": "/name/nm12329614/?ref_=tt_cl_t5", "name": "Kôzô Hashida"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm12329614?ref_=tt_cl_t5", "name": "Obayashi Chairman"}]}, {"actor": {"@type": "Person", "url": "/name/nm12329615/?ref_=tt_cl_t7", "name": "Kazumi Nozaki"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm12329615?ref_=tt_cl_t7", "name": "Cousin"}]}, {"actor": {"@type": "Person", "url": "/name/nm12329616/?ref_=tt_cl_t9", "name": "Masahiro Kanetake"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm12329616?ref_=tt_cl_t9", "name": "Aunt's house guest"}]}, {"actor": {"@type": "Person", "url": "/name/nm12329617/?ref_=tt_cl_t11", "name": "Hajime Maki"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm12329617?ref_=tt_cl_t11", "name": "Man who arrests Seita"}]}, {"actor": {"@type": "Person", "url": "/name/nm12329618/?ref_=tt_cl_t13", "name": "Teruhisa Harita"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm12329618?ref_=tt_cl_t13", "name": "Station worker"}]}, {"actor": {"@type": "Person", "url": "/name/nm7135999/?ref_=tt_cl_t15", "name": "Michio Denpô"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm7135999?ref_=tt_cl_t15", "name": "Station worker"}, {"url": "/title/tt0095327/characters/nm7135999?ref_=tt_cl_t15", "name": "Doctor"}]}, {"actor": {"@type": "Person", "url": "/name/nm0794186/?ref_=tt_cl_t2", "name": "Ayano Shiraishi"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm0794186?ref_=tt_cl_t2", "name": "Setsuko"}]}, {"actor": {"@type": "Person", "url": "/name/nm0945312/?ref_=tt_cl_t4", "name": "Akemi Yamaguchi"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm0945312?ref_=tt_cl_t4", "name": "Aunt"}]}, {"actor": {"@type": "Person", "url": "/name/nm10735745/?ref_=tt_cl_t6", "name": "Masayo Sakai"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm10735745?ref_=tt_cl_t6", "name": "Woman who takes care of Setsuko"}]}, {"actor": {"@type": "Person", "url": "/name/nm4410046/?ref_=tt_cl_t8", "name": "Yoshio Matsuoka"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm4410046?ref_=tt_cl_t8", "name": "Gosaku"}]}, {"actor": {"@type": "Person", "url": "/name/nm6979973/?ref_=tt_cl_t10", "name": "Kiyoshi Yanagawa"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm6979973?ref_=tt_cl_t10", "name": "Patrolman"}]}, {"actor": {"@type": "Person", "url": "/name/nm6087055/?ref_=tt_cl_t12", "name": "Atsuo Omote"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm6087055?ref_=tt_cl_t12", "name": "Person in bank"}]}, {"actor": {"@type": "Person", "url": "/name/nm0848991/?ref_=tt_cl_t14", "name": "Hiroshi Tanaka"}, "character_and_episodes": [{"url": "/title/tt0095327/characters/nm0848991?ref_=tt_cl_t14", "name": "Person in bank"}]}]}