{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0870984/", "name": "Antichrist", "image": "https://m.media-amazon.com/images/M/MV5BMjE3MjQ2ODc1N15BMl5BanBnXkFtZTcwNjYyMzI5Mg@@._V1_.jpg", "genre": ["Drama", "Horror", "Thriller"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm0000353/", "name": "Willem Dafoe"}, {"@type": "Person", "url": "/name/nm0001250/", "name": "Charlotte Gainsbourg"}, {"@type": "Person", "url": "/name/nm3527143/", "name": "Storm Acheche Sahlstrøm"}], "director": {"@type": "Person", "url": "/name/nm0001885/", "name": "Lars von Trier"}, "creator": [{"@type": "Person", "url": "/name/nm0001885/", "name": "Lars von Trier"}, {"@type": "Organization", "url": "/company/co0136662/"}, {"@type": "Organization", "url": "/company/co0269700/"}, {"@type": "Organization", "url": "/company/co0066263/"}, {"@type": "Organization", "url": "/company/co0050553/"}, {"@type": "Organization", "url": "/company/co0122237/"}, {"@type": "Organization", "url": "/company/co0066028/"}, {"@type": "Organization", "url": "/company/co0003461/"}, {"@type": "Organization", "url": "/company/co0269730/"}, {"@type": "Organization", "url": "/company/co0035146/"}, {"@type": "Organization", "url": "/company/co0063732/"}, {"@type": "Organization", "url": "/company/co0174795/"}, {"@type": "Organization", "url": "/company/co0164664/"}, {"@type": "Organization", "url": "/company/co0001935/"}, {"@type": "Organization", "url": "/company/co0079546/"}, {"@type": "Organization", "url": "/company/co0028557/"}, {"@type": "Organization", "url": "/company/co0090290/"}, {"@type": "Organization", "url": "/company/co0048411/"}, {"@type": "Organization", "url": "/company/co0445695/"}, {"@type": "Organization", "url": "/company/co0057902/"}, {"@type": "Organization", "url": "/company/co0113606/"}, {"@type": "Organization", "url": "/company/co0185099/"}, {"@type": "Organization", "url": "/company/co0048118/"}, {"@type": "Organization", "url": "/company/co0078814/"}], "description": "Antichrist is a movie starring Willem Dafoe, Charlotte Gainsbourg, and Storm Acheche Sahlstrøm. A grieving couple retreat to their cabin in the woods, hoping to repair their broken hearts and troubled marriage, but nature takes its...", "datePublished": "2009-05-20", "keywords": "vagina,masturbation,cabin,female full frontal nudity,talking fox", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 117456, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0870984/"}, "author": {"@type": "Person", "name": "jackharding89-1"}, "dateCreated": "2009-12-22", "inLanguage": "English", "name": "A gruelling tale of mythical grandeur", "reviewBody": "An eerie yet gorgeous tapestry of lingering close-ups; parallels, cuts and slow-motion photography, Lars Von Trier's Antichrist is a gruelling tale of mythical grandeur: a bizarre yet beautiful film chock full of sadism and shagging, Satanic dogma and similes. Most of which, I don't understand. So you'll be pleased to know that I have no intention of harping on about the director's bent meditation on gender, nature, genocide, motherhood, misogyny and astronomy. I find all that stuff interesting, don't get me wrong, but when things get Freudian I'm way out of my league. Therefore, I'll stick to what I know.\n\nAlbeit seething with emotion, Antichrist refuses to adhere to some of the general \"rules\" of the classical Hollywood narrative, meaning it lacks clarity, unity and closure. For example, there're only two characters, both of which remain nameless and have indefinite; pasts, motives and are somewhat difficult to identify with. The film rejects conventional morality. It is a difficult and uncomfortable experience that'll unnerve even the most robust of film fans. So if you like your films light, clear and conservative, stay away. If, however, you're a fan of, say, Nicholas Roeg's Don't Look Now, director David Lynch or you just dig a bit of alternative cinema, then brace yourself for a hugely demanding tableau that film critic Anita Singh of the Sunday Telegraph dubbed \"the most shocking film in the history of the Cannes Film Festival.\" Willem Dafoe plays \"he\", a therapist and husband to \"she\" (Charlotte Gainsbourg), the female half of the cast whose line of work we never really learn. After a quite miraculous opening montage that juxtaposes the couple making love with the accidental death of their child, the embedded tale follows the pair as they flee to \"Eden\", their isolated cabin in the woods, where \"he\" attempts to aid a severely grief stricken \"she\" through her bereavement.\n\nBook-ended by a masterfully conceived prologue and epilogue and split into four focal chapters entitled \"Grief\", \"Pain\", \"Despair\" and \"The Three Beggars\" (don't ask), the film takes on a ghostlike tone from the outset as the boundaries between the real and surreal become blurred. Alas, things get weird, edgy and very, very nasty. The sheer mass and rate of dense motifs and metaphors at hand regarding sex, Freud, the devil and the soul is a little overwhelming. Not to mention the force and intensity of both Dafoe and Gainsbourg's turns in addition to the film's strong, emotional undercurrent.\n\nIn spite of large and sustained periods of quite brilliant film-making, Antichrist contains some of the most violent and deplorable images ever committed to celluloid. For the ladies there's self mutilation. For the gents there's\u0085I, I, I can't even say it. Put it this way, it ain't good lads\u0085Anyway, add to the unthinkable gore a whole host of outlandish set-ups, half a dozen scenes of a sexual nature and one or two jolts in tone and you'll be scared silly. Remember- sometimes in cinema, you fear what you don't understand, especially when the camera is an unflinching eye inside the head of a disturbed, Danish poet. Lars Von Trier is an excellent filmmaker, but even his biggest fans will find it hard to swallow this, never mind stomach it.\n\nDedicated to the memory of legendary soviet filmmaker Andrei Tarkovsky, Antichrist is truly as haunting, delicate and poetic a film as you're ever bound to see. Though shrouded in scenes of unspeakable cruelty, the film eludes to the work of Tarkovsky in a big way: Von Trier's warped Adam and Eve parable is a moody, metaphysical affair cloaked in hypnotic, dreamlike imagery that calls to mind the likes of Mirror, Solaris and the brilliant Stalker. The trancelike photography; sound, score, and editing demonstrate a predilection for atmospheric, art-theatre sensibility. Tarkovsky would have loved it. This, after all, is a film that simply has to be seen to be believed. Not necessarily for its aesthetic grandeur, gore or technique, but for its harrowing portrayal of a soul in torment.\n\nWhat's it all about? Who cares?! Antichrist is an unusual, atmospheric horror film that's guaranteed to provoke. The performances are honest and strong, the aesthetics are bold, the direction is brilliant and the outcome is something that is ultimately hard to come by these days: authentic film-making.\n\nJack Harding", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H48M", "trailer": {"@type": "VideoObject", "name": "Antichrist", "embedUrl": "/video/imdb/vi2751857177", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYmM2NjgwMTktMTRlZS00ZWZkLTg5YmYtYWU2ZTQzMDcyMWVmXkEyXkFqcGdeQXRzdGFzaWVr._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYmM2NjgwMTktMTRlZS00ZWZkLTg5YmYtYWU2ZTQzMDcyMWVmXkEyXkFqcGdeQXRzdGFzaWVr._V1_.jpg", "description": "Antichrist Final Trailer - A grieving couple retreats to their cabin in the woods, hoping to repair their broken hearts and troubled marriage. But nature takes its course and things go from bad to worse", "uploadDate": "2009-09-16T10:51:36Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000353/?ref_=tt_cl_t1", "name": "Willem Dafoe"}, "character_and_episodes": [{"url": "/title/tt0870984/characters/nm0000353?ref_=tt_cl_t1", "name": "He"}]}, {"actor": {"@type": "Person", "url": "/name/nm3527143/?ref_=tt_cl_t3", "name": "Storm Acheche Sahlstrøm"}, "character_and_episodes": [{"url": "/title/tt0870984/characters/nm3527143?ref_=tt_cl_t3", "name": "Nic"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001250/?ref_=tt_cl_t2", "name": "Charlotte Gainsbourg"}, "character_and_episodes": [{"url": "/title/tt0870984/characters/nm0001250?ref_=tt_cl_t2", "name": "She"}]}]}