{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1121096/", "name": "Seventh Son", "image": "https://m.media-amazon.com/images/M/MV5BMjAxNTg2MDkyN15BMl5BanBnXkFtZTgwNzA3NzY1MjE@._V1_.jpg", "genre": ["Action", "Adventure", "Fantasy"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm1602660/", "name": "Ben Barnes"}, {"@type": "Person", "url": "/name/nm0000194/", "name": "Julianne Moore"}, {"@type": "Person", "url": "/name/nm0000313/", "name": "Jeff Bridges"}, {"@type": "Person", "url": "/name/nm2539953/", "name": "Alicia Vikander"}], "director": {"@type": "Person", "url": "/name/nm0091076/", "name": "Sergei Bodrov"}, "creator": [{"@type": "Person", "url": "/name/nm0495378/", "name": "Charles Leavitt"}, {"@type": "Person", "url": "/name/nm1140275/", "name": "Steven Knight"}, {"@type": "Person", "url": "/name/nm0338557/", "name": "Matt Greenberg"}, {"@type": "Person", "url": "/name/nm2796716/", "name": "Joseph Delaney"}, {"@type": "Organization", "url": "/company/co0494795/"}, {"@type": "Organization", "url": "/company/co0049799/"}, {"@type": "Organization", "url": "/company/co0159111/"}, {"@type": "Organization", "url": "/company/co0016492/"}, {"@type": "Organization", "url": "/company/co0406135/"}, {"@type": "Organization", "url": "/company/co0362436/"}, {"@type": "Organization", "url": "/company/co0172670/"}], "description": "Seventh Son is a movie starring Ben Barnes, Julianne Moore, and Jeff Bridges. When Mother Malkin, the queen of evil witches, escapes the pit she was imprisoned in by professional monster hunter Spook decades ago and kills his...", "datePublished": "2014-12-17", "keywords": "witch,sword and fantasy,sword and sorcery,apprentice,magic", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 72302, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1121096/"}, "author": {"@type": "Person", "name": "moviexclusive"}, "dateCreated": "2014-12-30", "inLanguage": "English", "name": "Not even A-listers like Jeff Bridges and Julianne Moore can save this under-developed and under-directed fantasy epic wannabe from its own tedium and mediocrity", "reviewBody": "Hollywood has of late had a lousy track record of fantasy action epics, and 'Seventh Son', which arrives just in time to close off the year, is yet another blemish to add to that list. Delayed nearly a year while its production company Legendary switched studios, this Universal release assembles A-listers Jeff Bridges and Julianne Moore with 'The Chronicles of Narnia' star Ben Barnes for an expensive big- screen adaptation of the first book of Joseph Delaney's 'The Wardstone Chronicles' against tawdry sets and second-rate visual effects.\n\nWe aren't usually that critical of a film's production design, but there is just something awfully dreary about the widescreen world of Russian director Sergei Bodrov's debut English-language feature. Indeed, the only human city where any of the action takes place looks like it was rented right after the cast and crew of 'Game of Thrones' abandoned it, while the mountain fortress which principal villain Mother Malkin makes her not-so-humble abode seems like it was designed for some 1960s B-grade science-fiction movie. The ugliness of these green-screened sets is even more obvious against the occasional picturesque Canadian backdrops, which cinematographer Newton Thomas Sigel ably captures to evoke a majestic 'Lord of the Rings' feel.\n\nAlas the unattractive visuals are just one of the litany of complaints that you are likely to have. What production designer Dante Ferretti fails to accomplish in sets, visual effects designer John Dykstra also fails to make up for in post-production. Whether the oversized orcs or shape-shifting witches (Moore and her fellow consort Djimon Hounsou transform into dragons, while others transform into creatures with reptilian-like tongues or Hindu deity-like arms), the CG effects for what was once intended to be a franchise tentpole are both unimaginatively conceived and poorly executed, even more appalling when viewed in post-conversion 3D or worse on an IMAX screen.\n\nAnd yet to fault its technical shortcomings seems at least a tad unfair, in particular because the movie's problems are much more fundamental. For one, despite boasting an impressive team of screenwriters including Matt Greenberg, Charles Leavitt and Steven Knight, there is hardly a story here. Without any context, we start with a younger Jeff Bridges imprisoning the Queen Witch, Mother Malkin (Moore), up in the mountains. The impending dawn of the once-a-century blood moon lends her strength to break out of her metal confines, and in an early sequence, confront her jailer Master Gregory (Bridges) and his not-so-lucky apprentice Billy (Game of Thrones' Kit Harington). When that reunion ends with Billy dead, Gregory sets out recruiting a new \"seventh son of a seventh son\", Thomas (Barnes), who so happens to be suffering from elliptic visions of Gregory and Malkin.\n\nIn narrative jargon, Thomas is The Chosen One, the anointed protégé who under the tutelage of Master Gregory will become his very equal and take his place among the elite group of knights who call themselves the Falcon. There is no doubt during the movie, even when his life seems to be in mortal danger, that Thomas will live to see the death of Mother Malkin and perhaps even the light of another sequel. There is also no doubt, despite Gregory's initial reservations, that Thomas will be ready within the span of just seven days to defeat the evil that Malkin possesses within her goth-like getup. And for that matter, there is no doubt that Thomas will find true love in Alice (Swedish actress Alicia Vikander), a witch whom he rescues from the town mob and who turns out to be the daughter of Malkin's younger sister.\n\nThe plotting is as straight-forward as it gets, and functions no more than to connect the numerous noisy action sequences together. There is also hardly any character to speak of, each one of them leading or supporting mere stock types that you would be familiar with from countless other such fantasy flicks. The latter is also why we feel sorry for Bridges, a fine actor who's played the grizzled veteran one too many times of late in 'R.I.P.D.' and 'The Giver' and is here trying not to sound condescending while delivering lame one-liners with a distinct twang. Moore too is an equally fine actress in her own right utterly wasted in a thankless role, and together, what chemistry the pair had in 'The Big Lebowski' is sorely missing in their first reunion since.\n\nIf the decision to cast two acclaimed actors to lend legitimacy to the project does nothing to help the film, the casting of its younger actors also fails to do it any favours. Barnes tries his best to project fresh-eyed enthusiasm, but the late decision to cast the 31- year-old actor in the role of a 17-year-old – instead of 'The Hunger Games'' Sam Claflin is ultimately a misguided one. He also shares too little chemistry with Vikander, who looks appropriately beguiling but is little much else. Barnes and Vikander are also stuck in an awkward romance which is bound to inspire some unintended giggles especially for a sequence where the two supposedly exchange loving glances while lying together in bed. \n\nThere is hardly anything fascinating about 'Seventh Son', whose title belongs better in a tongue twister than in an expensive and extravagant swords-and-dragons epic. Yes, there is good reason indeed why former studio Warner Bros had dragged its feet in releasing this, and what a relief it must have felt that it need not try to justify why it decided to do so when it already has an entire trilogy in 'The Hobbit'. No matter that the director is a two-time Academy Award nominee for his Russian films 'Prisoner of the Mountains' and 'Mongol', his Hollywood foray is an embarrassing misstep that he would no doubt want to be forgotten as soon as possible. He needn't worry; to spare yourself the agony of sitting through yet another disappointing fantasy wanna-be epic, go find any one of the other sons and just avoid the Seventh."}, "duration": "PT1H42M", "trailer": {"@type": "VideoObject", "name": "International Trailer", "embedUrl": "/video/imdb/vi1803464473", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTAyMjkxMzQ3MTJeQTJeQWpwZ15BbWU4MDk2NzM3NDMx._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTAyMjkxMzQ3MTJeQTJeQWpwZ15BbWU4MDk2NzM3NDMx._V1_.jpg", "description": "John Gregory, who is a seventh son of a seventh son and also the local spook, has protected he country from witches, boggarts, ghouls and all manner of things that go bump in the night. However John is not young anymore, and has been seeking an apprentice to carry on his trade. Most have failed to survive. The last hope is a young farmer's son named Thomas Ward. Will he survive the training to become the spook that so many others couldn't? Should he trust the girl with pointy shoes? How can Thomas stand a chance against Mother Malkin, the most dangerous witch in the county?", "uploadDate": "2014-11-21T15:51:05Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000313/?ref_=tt_cl_t1", "name": "Jeff Bridges"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm0000313?ref_=tt_cl_t1", "name": "Master Gregory"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000194/?ref_=tt_cl_t3", "name": "Julianne Moore"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm0000194?ref_=tt_cl_t3", "name": "Mother Malkin"}]}, {"actor": {"@type": "Person", "url": "/name/nm1662644/?ref_=tt_cl_t5", "name": "Antje Traue"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm1662644?ref_=tt_cl_t5", "name": "Bony Lizzie"}]}, {"actor": {"@type": "Person", "url": "/name/nm0220883/?ref_=tt_cl_t7", "name": "John DeSantis"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm0220883?ref_=tt_cl_t7", "name": "Tusk"}]}, {"actor": {"@type": "Person", "url": "/name/nm0005023/?ref_=tt_cl_t9", "name": "Djimon Hounsou"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm0005023?ref_=tt_cl_t9", "name": "Radu"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001462/?ref_=tt_cl_t11", "name": "Jason Scott Lee"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm0001462?ref_=tt_cl_t11", "name": "Urag"}]}, {"actor": {"@type": "Person", "url": "/name/nm3526638/?ref_=tt_cl_t13", "name": "Luc Roderique"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm3526638?ref_=tt_cl_t13", "name": "Strix"}]}, {"actor": {"@type": "Person", "url": "/name/nm0916448/?ref_=tt_cl_t15", "name": "Timothy Webber"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm0916448?ref_=tt_cl_t15", "name": "Malcom Ward"}]}, {"actor": {"@type": "Person", "url": "/name/nm1602660/?ref_=tt_cl_t2", "name": "Ben Barnes"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm1602660?ref_=tt_cl_t2", "name": "Tom Ward"}]}, {"actor": {"@type": "Person", "url": "/name/nm2539953/?ref_=tt_cl_t4", "name": "Alicia Vikander"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm2539953?ref_=tt_cl_t4", "name": "Alice"}]}, {"actor": {"@type": "Person", "url": "/name/nm0931404/?ref_=tt_cl_t6", "name": "Olivia Williams"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm0931404?ref_=tt_cl_t6", "name": "Mam Ward"}]}, {"actor": {"@type": "Person", "url": "/name/nm3229685/?ref_=tt_cl_t8", "name": "Kit Harington"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm3229685?ref_=tt_cl_t8", "name": "Mr. Bradley"}]}, {"actor": {"@type": "Person", "url": "/name/nm0687679/?ref_=tt_cl_t10", "name": "Gerard Plunkett"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm0687679?ref_=tt_cl_t10", "name": "Inquisitor"}]}, {"actor": {"@type": "Person", "url": "/name/nm0565973/?ref_=tt_cl_t12", "name": "Kandyse McClure"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm0565973?ref_=tt_cl_t12", "name": "Sarikin"}]}, {"actor": {"@type": "Person", "url": "/name/nm0354427/?ref_=tt_cl_t14", "name": "Zahf Paroo"}, "character_and_episodes": [{"url": "/title/tt1121096/characters/nm0354427?ref_=tt_cl_t14", "name": "Virahadra"}]}]}