{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt4046784/", "name": "Maze Runner: The Scorch Trials", "image": "https://m.media-amazon.com/images/M/MV5BMjE3MDU2NzQyMl5BMl5BanBnXkFtZTgwMzQxMDQ3NTE@._V1_.jpg", "genre": ["Action", "Adventure", "Sci-Fi", "Thriller"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm3729721/", "name": "Dylan O'Brien"}, {"@type": "Person", "url": "/name/nm2546012/", "name": "Kaya Scodelario"}, {"@type": "Person", "url": "/name/nm1032473/", "name": "Thomas Brodie-Sangster"}, {"@type": "Person", "url": "/name/nm0002064/", "name": "Giancarlo Esposito"}], "director": {"@type": "Person", "url": "/name/nm1226871/", "name": "Wes Ball"}, "creator": [{"@type": "Person", "url": "/name/nm2385905/", "name": "T.S. Nowlin"}, {"@type": "Person", "url": "/name/nm4212895/", "name": "James Dashner"}, {"@type": "Organization", "url": "/company/co0080580/"}, {"@type": "Organization", "url": "/company/co0420822/"}, {"@type": "Organization", "url": "/company/co0069651/"}], "description": "Maze Runner: The Scorch Trials is a movie starring Dylan O'Brien, Kaya Scodelario, and Thomas Brodie-Sangster. After having escaped the Maze, the Gladers now face a new set of challenges on the open roads of a desolate landscape...", "datePublished": "2015-09-09", "keywords": "escape,desert,cure,zombie,evil corporation", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 224307, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt4046784/"}, "author": {"@type": "Person", "name": "do-arellano-mayra"}, "dateCreated": "2015-09-10", "inLanguage": "English", "name": "More entertaining than the first installment", "reviewBody": "Let's get this straight out of the way. If you are tired of movies based on books that present a young cast, you won't find something here to convert you. However if you found the first movie to be a surprisingly entertaining, solid action flick;or if you don't mind the age of the main characters as long as the story deliveries, there's plenty to like here. Specially because there are some improvements over the flaws of the first film.\n\nThe action sequences are gripping, well directed and have a feel of raw realism. It's evident that the ensemble of actors- young or mature- gave it all physically. It seems as though the stunts doubles had little to do in comparison to the average action flick.\n\nIf in the first movie you got 2 or 3 action scenes to keep you in the edge of your seat,in The scorch trials you'll find action almost from the beginning.I'm not a fan of non-stop action, but I was particularly impressed with Barry Pepper who I heard filmed his action scenes with a broken ankle. \n\nThe acting is extremely good. Not only the young lead Dylan O'Brien and his young co-stars, Ki Hong Lee, Kaya Scodelario, Rosa Salazar and Thomas Brodie Sangter, deliver strong performances, but also the supporting cast of mature actors. By the way if you have read or heard that the very talented supporting cast of mature actors is there only for their paychecks or that \"they have better things to do\" you are hearing a biased opinion by unprofessional reviewers who are tired of \"YA adaptations\". But just because some reviewers are tired of this \"subgenre\" doesn't mean that plenty of talented cast and crews aren't fully involved with these kind of stories in spite of the studios greedy intentions. \n\nThis movie might not be perfect, might not be for everyone but one thing that you can tell for sure is that Barry Pepper, Alan Tudik, Aidan Gillen, Lily Taylor, Patricia Clarkson and particularly Giancarlo Esposito gave it all. They have amazing chemistry with the very talented young cast and they seem to be screaming \"100% commitment to my role\". It became clear to me through their committed performances that they believed in the project and that they trust the director Wes Ball. There's plenty of character development opportunities and these mature actors take advantage of them all even if their screen time is limited. Ava Paige as played by Patricia Clarkson started the movie as the archetypal \"evil scientist\" and by the end of the movie I was somehow rooting for her. She really needs to find a cure to this mysterious disease called \"the flare\". Giancarlo Esposito started limited by a role that seemed at first written to fulfill a quota of the typical \"evil adult vs. innocent kid\" trope. However, as the movie moves on we discover that he is far from being a cartnoonish \"evil adult\" and that his character is full of humanity. A scene in which he is concerned over his protegé was one of my favorites of a film from which I was only expecting mindless entertainment and non-stopping action.\n\nThe problem is that this brilliant cast was limited by a script that seemed to go nowhere. I'd say the script is not as strong as the one of the first movie and that script wasn't particularly good to begin with. There are some improvements. This time some clichéd lines have gone away, there's more backbone to the characters and a little more of \"showing-not-telling\". But if you are thinking that everything that didn't make sense in the first one will make sense in this movie you might end up disappointed.\n\nOne more time the movie ends in a cliffhanger although this time there's not a last minute info-dump. If you don't mind these minor flaws on the script you might end up enjoying the ride.\n\nIn my opinion, the strongest part of the movie, besides the thrilling action and good acting are the visuals. I enjoyed the shots of the scorch because the cinematographer took plenty of risks. I want to see the movie again just to appreciate these shots better. There were also interesting shots in terms of composition.\n\nThe VFX is extremely well executed. I thought the director was going to get overboard with the CGI usage but he wisely balanced the visual effects with the emotional arc to take the audience to a journey through this devastated lands in which under each nook, each skeleton building lies a new danger, a new story, a new world which I'd love to explore. \n\nAs if this wasn't enough to make me want to see the movie again, Joe Paesano's score (Daredevil TV series, The maze runner) was masterfully used and added a special feeling to the already beautiful visuals. Mark my words, Paesano's scores will get him an Oscar somewhere in the near future.\n\nThe scorch trials has everything to become a huge international box office success because is a solid, yet imperfect second chapter, that will keep audiences entertained and screaming for chapter 3.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT2H11M", "trailer": {"@type": "VideoObject", "name": "Trailer #2", "embedUrl": "/video/imdb/vi547074841", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTg1NTgyNjA2Ml5BMl5BanBnXkFtZTgwMzM4MTUzNjE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTg1NTgyNjA2Ml5BMl5BanBnXkFtZTgwMzM4MTUzNjE@._V1_.jpg", "description": "In this next chapter of the Maze Runner saga, Thomas and his fellow Gladers face their greatest challenge yet: searching for clues about the mysterious and powerful organization known as WCKD. Their journey takes them to the Scorch, a desolate landscape filled with unimaginable obstacles. Teaming up with resistance fighters, the Gladers take on WCKD's vastly superior forces and uncover its shocking plans for them all.", "uploadDate": "2015-07-24T15:43:39Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm3729721/?ref_=tt_cl_t1", "name": "Dylan O'Brien"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm3729721?ref_=tt_cl_t1", "name": "Thomas"}]}, {"actor": {"@type": "Person", "url": "/name/nm2546012/?ref_=tt_cl_t3", "name": "Kaya Scodelario"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm2546012?ref_=tt_cl_t3", "name": "Teresa"}]}, {"actor": {"@type": "Person", "url": "/name/nm2766708/?ref_=tt_cl_t5", "name": "Dexter Darden"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm2766708?ref_=tt_cl_t5", "name": "Frypan"}]}, {"actor": {"@type": "Person", "url": "/name/nm5015107/?ref_=tt_cl_t7", "name": "Jacob Lofland"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm5015107?ref_=tt_cl_t7", "name": "Aris"}]}, {"actor": {"@type": "Person", "url": "/name/nm0002064/?ref_=tt_cl_t9", "name": "Giancarlo Esposito"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm0002064?ref_=tt_cl_t9", "name": "Jorge"}]}, {"actor": {"@type": "Person", "url": "/name/nm0318821/?ref_=tt_cl_t11", "name": "Aidan Gillen"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm0318821?ref_=tt_cl_t11", "name": "Janson"}]}, {"actor": {"@type": "Person", "url": "/name/nm0808901/?ref_=tt_cl_t13", "name": "Kathryn Smith-McGlynn"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm0808901?ref_=tt_cl_t13", "name": "Dr. Crawford"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001608/?ref_=tt_cl_t15", "name": "Barry Pepper"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm0001608?ref_=tt_cl_t15", "name": "Vince"}]}, {"actor": {"@type": "Person", "url": "/name/nm3859624/?ref_=tt_cl_t2", "name": "Ki Hong Lee"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm3859624?ref_=tt_cl_t2", "name": "Minho"}]}, {"actor": {"@type": "Person", "url": "/name/nm1032473/?ref_=tt_cl_t4", "name": "Thomas Brodie-Sangster"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm1032473?ref_=tt_cl_t4", "name": "Newt"}]}, {"actor": {"@type": "Person", "url": "/name/nm1601104/?ref_=tt_cl_t6", "name": "Alexander Flores"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm1601104?ref_=tt_cl_t6", "name": "Winston"}]}, {"actor": {"@type": "Person", "url": "/name/nm4023073/?ref_=tt_cl_t8", "name": "Rosa Salazar"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm4023073?ref_=tt_cl_t8", "name": "Brenda"}]}, {"actor": {"@type": "Person", "url": "/name/nm0165101/?ref_=tt_cl_t10", "name": "Patricia Clarkson"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm0165101?ref_=tt_cl_t10", "name": "Ava Paige"}]}, {"actor": {"@type": "Person", "url": "/name/nm1296340/?ref_=tt_cl_t12", "name": "Terry Dale Parks"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm1296340?ref_=tt_cl_t12", "name": "Carl (Masked Man)"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000666/?ref_=tt_cl_t14", "name": "Lili Taylor"}, "character_and_episodes": [{"url": "/title/tt4046784/characters/nm0000666?ref_=tt_cl_t14", "name": "Mary"}]}]}