{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt6217608/", "name": "The Rider", "image": "https://m.media-amazon.com/images/M/MV5BMjQ3ODM5MjY2N15BMl5BanBnXkFtZTgwOTU5MjM4NDM@._V1_.jpg", "genre": ["Drama", "Western"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm8561010/", "name": "Brady Jandreau"}, {"@type": "Person", "url": "/name/nm4185714/", "name": "Mooney"}, {"@type": "Person", "url": "/name/nm8561011/", "name": "Tim Jandreau"}, {"@type": "Person", "url": "/name/nm8561012/", "name": "Lilly Jandreau"}], "director": {"@type": "Person", "url": "/name/nm2125482/", "name": "Chloé Zhao"}, "creator": [{"@type": "Person", "url": "/name/nm2125482/", "name": "Chloé Zhao"}, {"@type": "Organization", "url": "/company/co0418309/"}, {"@type": "Organization", "url": "/company/co0614449/"}], "description": "The Rider is a movie starring Brady Jandreau, Mooney, and Tim Jandreau. After suffering a near fatal head injury, a young cowboy undertakes a search for new identity and what it means to be a man in the heartland of America.", "datePublished": "2018-03-28", "keywords": "autism,cowboy,riding accident,head injury,life changing injury", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 14827, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt6217608/"}, "author": {"@type": "Person", "name": "Bertaut"}, "dateCreated": "2018-09-24", "inLanguage": "English", "name": "Honest, raw, and respectful - a superb film", "reviewBody": "Partly an elegy for a dissipating way of life, partly an examination of the self-destructive components of contemporary masculinity, and partly a deconstruction of the iconography of the American frontier, The Rider is the second film from Chinese-American writer/director Chloé Zhao, and is intimately tied to her debut, Songs My Brothers Taught Me (2015). Set in the same location in South Dakota, featuring the same milieu, and covering some of the same thematic ground, The Rider also owes a more practical debt to Songs. When she was researching that film, Zhao met rodeo rider Brady Jandreau, who taught her how to ride a horse. Promising him she would cast him in one of her subsequent films, Zhao soon learned that Jandreau had sustained a serious cranial injury in a rodeo accident, and been told by doctors that he must give up the only way of life he had ever known, as another blow to the head could kill him. Inspired by his story, Zhao wrote The Rider, a loosely fictionalised version of Jandreau's experiences, in which she cast entirely non-professional actors, including the real Jandreau, his father, sister, and several of his friends, all playing versions of themselves. The result is a kind of semi-fictional docudrama, and one of the finest films of the year.\n\nSet on the Pine Ridge Reservation in South Dakota, Brady Blackburn (Brady Jandreau) lives just above the poverty line with his father Wayne (Tim Jandreau) and his sister Lilly (Lilly Jandreau), who suffers from autism. Several months previously, Brady suffered a near-fatal head injury after falling from a bronco, which has left him with neurological damage. Warned by doctors that if he attempts to ride again, a single innocuous fall could kill him, Brady finds his very sense of self challenged as he attempts to function in a society where every man lives by the maxim of \"ride or die\".\n\nIn depicting Brady's struggle with his new life, Zhao is able to simultaneously romanticise and demythologise the role of the cowboy in the contemporary United States. As the story progresses, the film comes more and more to express a sense of disillusionment with the lifestyle. Part of this is the theme of the rodeo itself. So eloquently panegyrised in the early parts of the film, it is also presented as leading to physical ruin and mental anguish. Indeed, one of the film's primary motifs is that of injuries sustained whilst riding. In relation to this, it's extremely telling that literally every male Brady meets, from young boys to elderly men, all express their desire that he start riding again, although many of them know why he stopped. On the other hand, one of the few female characters tells him, \"problem with you boys, you don't like to get your pride hurt\". Brady and his friends are personifications of the ruggedness of the American West, and the film uses them to facilitate a deconstruction of the notions of contemporary masculinity.\n\nThey see themselves as modern day-cowboys, but the film argues this is an era where cowboys serve no function. But this is the only life they have known, and whilst the film leaves the audience in little doubt that this lifestyle can lead to ruin, so too does it ensure the viewer knows that Zhao has the deepest respect for these guys, depicting, as it does, the kind of desperation and limited choices that leave a young man with only one route, a route which often overrides any common sense he may have. Never once does it feel like Zhao is looking down on or satirising them. Rather, it's criticising the situation in which they find themselves; forced to live a life of bluster and posturing.\n\nThe most telling example of this is Lane (Lane Scott). As with the real-life Brady, Lane was a celebrated rodeo with a reputation for riding broncos no one else would touch. The embodiment of machismo with a devil-may-care attitude, he was adored by women and envied by men. However, as in the film, the real Lane is now almost completely paralysed, capable of communicating only by signing with his left hand, and living permanently in a care facility. The only difference between the real-life Lane and his fictional counterpart is that in reality, he was paralysed in a car crash, whereas in the film it was via riding. This differentiation is telling as it speaks to Zhao's thematic intent. However, as with the other riders, Lane is presented with a great deal of reverence, and never does it feel like the film is saying, \"look at what the rodeo did to this guy; he must be a total idiot.\"\n\nIn a sense, whilst the film partially recalls The Misfits (1961), its real thematic precursor is The Wrestler (2008), an examination of male pride working against common sense, of professional dedication, of machoism gone awry. As with The Wrestler, the story of The Rider is archetypal. The Wrestler was about wrestling, but it could have been about any sport, and The Rider is even more universal. Yes, it too could have been about any sport, but it could also have been about literally any environ in which a young male tries to balance the dangers of what he does with the possibility of some kind of reward (whether financial or spiritual) at the end of it all.\n\nLooking at things aesthetically, the film opens with a shot of a horse during a storm, followed by loud thunder. The immediate impression is one of almost elemental forces - two extremes of nature coming together. This is immediately contrasted with Brady waking up and heading into his dingy bathroom to pluck off the staples holding the bandage on his still raw head wound. Thus, in just two shots, Zhao sets up the entire theme of the film - poetic rhetoric and romantic myths are all very well and good, but day to day mundanity can so often get in the way.\n\nElsewhere, the centrepiece of the film, and probably the most beautiful sequence, is when Brady decides the only opportunity of which he can avail to allow him to stay around horses without risking his life is to break in young broncos. The single-take shot where he breaks in an \"untrainable\" horse is searingly beautiful in its simplicity and elegance. The lack of edits gives it an unmanipulated emotional sense, whilst also meaning there can be no cheating - we're really watching Brady Jandreau break in a stubborn horse. The gentle approach he employs, the constant reassurances to the animal, the way he holds the rope, how he gets the horse used to someone on its back without actually getting all the up, his grace and intuition, his confidence; the totality is, simply put, achingly perfect. What we are seeing obviously comes from a deep natural inclination in the real-life Brady. You can't teach this kind of brilliance, no matter what the discipline is. Indeed, his gentle approach itself is completely at variance with such scenes in other westerns, where we're usually shown someone breaking in a horse by forcing it to respect them, and that in itself speaks as much to Zhao's theme as anything else. It's this sense of docudrama/realism/naturalism, whatever you want to call it, that really makes The Rider stand out.\n\nIf I had one criticism, it would be that the film runs out of momentum a little in the third quarter, although it picks up again in the last 20 minutes or so. However, aside from that, I literally cannot find a bad thing to say.\n\nBleak but incredibly beautiful, honest, but deeply respectful, realistic but profoundly poetic, Zhao's depiction of a dying culture, a dying breed, a dying way of life - the adrenaline-junkie bronco riders, America's modern cowboys - is easily one of the finest films of the year. And how ironic is it that one of the best examinations of American masculinity that you're likely to see in a long time is written and directed by a woman? And a woman born in China to boot. That's sure to irritate the misogynists/xenophobes no end!", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H44M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi3368663065", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNTY1NmZmMjQtY2RjYy00NjM0LTg3NWEtMzVmNGE2NGY3YmY0XkEyXkFqcGdeQXVyNjMwMzc3MjE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNTY1NmZmMjQtY2RjYy00NjM0LTg3NWEtMzVmNGE2NGY3YmY0XkEyXkFqcGdeQXVyNjMwMzc3MjE@._V1_.jpg", "description": "After suffering a near fatal head injury, a young cowboy undertakes a search for new identity and what it means to be a man in the heartland of America.", "uploadDate": "2018-02-16T18:45:48Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm8561010/?ref_=tt_cl_t1", "name": "Brady Jandreau"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm8561010?ref_=tt_cl_t1", "name": "Brady Blackburn"}]}, {"actor": {"@type": "Person", "url": "/name/nm8561011/?ref_=tt_cl_t3", "name": "Tim Jandreau"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm8561011?ref_=tt_cl_t3", "name": "Wayne Blackburn"}]}, {"actor": {"@type": "Person", "url": "/name/nm9759906/?ref_=tt_cl_t5", "name": "Leroy Pourier"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm9759906?ref_=tt_cl_t5", "name": "Frank"}]}, {"actor": {"@type": "Person", "url": "/name/nm8561014/?ref_=tt_cl_t7", "name": "Tanner Langdeau"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm8561014?ref_=tt_cl_t7", "name": "Tanner Langdeau"}]}, {"actor": {"@type": "Person", "url": "/name/nm8561013/?ref_=tt_cl_t9", "name": "Lane Scott"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm8561013?ref_=tt_cl_t9", "name": "Lane Scott"}]}, {"actor": {"@type": "Person", "url": "/name/nm9759913/?ref_=tt_cl_t11", "name": "Jordon Slick Phelps"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm9759913?ref_=tt_cl_t11", "name": "Rodeo Cowboy #2"}]}, {"actor": {"@type": "Person", "url": "/name/nm8561016/?ref_=tt_cl_t13", "name": "Terri Dawn Pourier"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm8561016?ref_=tt_cl_t13", "name": "Terri Dawn"}]}, {"actor": {"@type": "Person", "url": "/name/nm9759910/?ref_=tt_cl_t15", "name": "Greg Barber"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm9759910?ref_=tt_cl_t15", "name": "Bar Owner"}]}, {"actor": {"@type": "Person", "url": "/name/nm4185714/?ref_=tt_cl_t2", "name": "Mooney"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm4185714?ref_=tt_cl_t2", "name": "Gus"}]}, {"actor": {"@type": "Person", "url": "/name/nm8561012/?ref_=tt_cl_t4", "name": "Lilly Jandreau"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm8561012?ref_=tt_cl_t4", "name": "Lilly Blackburn"}]}, {"actor": {"@type": "Person", "url": "/name/nm6324453/?ref_=tt_cl_t6", "name": "Cat Clifford"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm6324453?ref_=tt_cl_t6", "name": "Cat Clifford"}]}, {"actor": {"@type": "Person", "url": "/name/nm8561015/?ref_=tt_cl_t8", "name": "James Calhoon"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm8561015?ref_=tt_cl_t8", "name": "James Calhoon"}]}, {"actor": {"@type": "Person", "url": "/name/nm9759907/?ref_=tt_cl_t10", "name": "Cameron Wright"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm9759907?ref_=tt_cl_t10", "name": "Rodeo Cowboy #1"}]}, {"actor": {"@type": "Person", "url": "/name/nm9759908/?ref_=tt_cl_t12", "name": "Donnie Whirlwind Horse"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm9759908?ref_=tt_cl_t12", "name": "Rodeo Cowboy #3"}]}, {"actor": {"@type": "Person", "url": "/name/nm6324451/?ref_=tt_cl_t14", "name": "Allen Reddy"}, "character_and_episodes": [{"url": "/title/tt6217608/characters/nm6324451?ref_=tt_cl_t14", "name": "Bill"}]}]}