{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0044706/", "name": "High Noon", "image": "https://m.media-amazon.com/images/M/MV5BOWIzZGUxZmItOThkMS00Y2QxLTg0MTYtMDdhMjRlNTNlYTI3L2ltYWdlXkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg", "genre": ["Drama", "Thriller", "Western"], "contentRating": "PG", "actor": [{"@type": "Person", "url": "/name/nm0000011/", "name": "Gary Cooper"}, {"@type": "Person", "url": "/name/nm0000038/", "name": "Grace Kelly"}, {"@type": "Person", "url": "/name/nm0593775/", "name": "Thomas Mitchell"}, {"@type": "Person", "url": "/name/nm0000978/", "name": "Lloyd Bridges"}], "director": {"@type": "Person", "url": "/name/nm0003593/", "name": "Fred Zinnemann"}, "creator": [{"@type": "Person", "url": "/name/nm0286025/", "name": "Carl Foreman"}, {"@type": "Person", "url": "/name/nm0192356/", "name": "John W. Cunningham"}, {"@type": "Organization", "url": "/company/co0136675/"}], "description": "High Noon is a movie starring Gary Cooper, Grace Kelly, and Thomas Mitchell. A town Marshal, despite the disagreements of his newlywed bride and the townspeople around him, must face a gang of deadly killers alone at high noon when...", "datePublished": "1952-06-09", "keywords": "one against many,sheriff,old west,frontier town,fistfight", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 97839, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.9"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0044706/"}, "author": {"@type": "Person", "name": "stryker-5"}, "dateCreated": "2000-07-15", "inLanguage": "English", "name": "\"I've Got To.  That's The Whole Thing.\"", "reviewBody": "The sombre ballad, the beleaguered marshall, the cold wife who deserts her man within an hour of marrying him ... \"High Noon\" is part of everyone's consciousness.  \n\n     Will Kane is the veteran lawman of Hadleyville, a small Kansas town that used to be the playground of bad men, notorious among them one Frank Miller.  \"This is just a dirty little village in the middle of nowhere,\" but Kane cleaned it up.  Five years ago he had Frank Miller committed to a distant federal court on a murder charge.  Today, as Kane weds his quaker bride, news arrives that Miller is free and heading for Hadleyville.  His henchmen gather at the depot, and it becomes clear that Frank will arrive on the midday train, looking to settle scores with the marshall who arrested him.  Should Kane leave town with his bride, thus avoiding trouble for himself and for Hadleyville?  Or should he stay and face the Miller gang? Will the citizens rally round their marshall?\n\n     John Wayne famously criticised the film for being 'unAmerican', in that (in his view) a frontier community would not desert its lawman so abjectly. Implicit in Wayne's malediction is the notion that mainstream movies should promote wholesome patriotic values - a notion that led in Wayne's case to the debacle of \"The Green Berets\".  Zinneman's acclaimed film probes the ugly side of human nature, \"sifting out the hearts of men\".\n\n     Zinneman and Director of Photography Floyd Crosby devoted a lot of care to the look of the film, effort that paid off handsomely.  From our first view of Lee Van Cleef as an ominous shadow on the horizon to the climactic cuts which seem to accelerate the arrival of the fateful train, this is a movie which speaks through images.  The arid, flat expanses of Kansas mirror the impassive sky, and the town's rickety structures seem puny against the bleak magnificence of nature.  Human wishes are vain in the face of Fate. Rail tracks extend with cruel exactitude into the distance, converging in perspective upon the vanishing point, the symbolic spot whence Frank Miller will materialise.  Lurking in the depot's shade, the dark presence which is the Miller Gang bristles with malice.\n\n     Zinneman is not afraid of extreme close-ups, which he uses to reinforce moments of emotional power (Kane realising that he has no support, Helen refusing to beg).  He shoots Kane predominantly from below waist height, stressing his tall, erect stance as a symbol of moral authority. Compositions are tight and attractive throughout.\n\n     Gary Cooper was fifty-one years old and quite ill when \"High Noon\" was shot.  He is, in truth, too old for the part.  Gregory Peck had turned it down, and it is fascinating to imagine Peck as Kane.  There is no rapport whatsoever between Cooper and Grace Kelly, and they make unconvincing newly-weds.  \"I won't be there when it's over,\" says the blushing bride, and though the script tries valiantly to give Amy a motivation (she became a quaker after seeing her menfolk gunned down), the abiding impression is of Kelly's prissy coldness.\n\n     \"High Noon\" is, for an action western, surprisingly strong on character.  The judge (Otto Kruger) is clear-headed about running away from the Millers, and argues his position powerfully, yet his authority is punctured by his actions as he speaks - lowering the Old Glory, and concealing the scales of justice.  Lloyd Bridges is excellent as Harvey, the deputy whose moral vision is clouded by lust for Helen and immature resentment of Kane.  Katy Jurado never looked lovelier than here, playing the fallen woman Helen Ramirez who loved and lost Kane - and loves him still.  A young Harry Morgan is Sam Fuller, the self-important coward who cannot face Kane.  Marshall Howe (Lon Chaney Jr.) is the retired lawman who is now embittered and counsels Kane against throwing his life away for the sake of these undeserving citizens - \"They just don't care!\"  In a cameo of pivotal importance that must have been great fun to play, Howland Chamberlain is the bitchy hotel desk clerk who hits Amy with a few home truths.  James Millican is Herb, the dependable deputy who vacillates when the chips are down, and Jack Elam makes a fleeting appearance as the town drunk who sleeps through the entire drama.\n\n     One interesting plot development is the strange alliance which forms between Kane's two women.  They meet in Helen's hotel room and decide to leave town together.  Significantly, as they ride past Kane in the buggy, it is Helen who looks back, not Amy.\n\n     It has been suggested that \"High Noon\" obeys Aristotle's three unities, especially that of time, the depicted events being capable of fitting into the film's ninety-minute span.  Clocks are everywhere in Hadleyville, and the passing of the minutes is constantly emphasised.  My only observation is, it remains ten minutes to twelve for an unconscionably long time.\n\n     \"The day cometh that shall burn like an oven,\" we are informed, and I for one found the film's climax rather disappointing after the intense build-up.  \"It's our problem because this is our town,\" declares a local worthy, but neither he nor anyone does anything about it.  Zinneman's great crane shot, about halfway through the film, speaks more eloquently than the hollow words, zooming back to show a silent, friendless street, and one upright man, utterly alone."}, "duration": "PT1H25M", "trailer": {"@type": "VideoObject", "name": "High Noon", "embedUrl": "/video/imdb/vi3442326553", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmViZTI3MTgtZmQxNi00NmNjLWJiMjEtZmIyNzA3NGYxOTc0XkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmViZTI3MTgtZmQxNi00NmNjLWJiMjEtZmIyNzA3NGYxOTc0XkEyXkFqcGdeQXRoaXJkLXBhcnR5LXZpZGVvLXVwZGF0ZXI@._V1_.jpg", "description": "Trailer 2", "uploadDate": "2019-06-28T17:10:48Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000011/?ref_=tt_cl_t1", "name": "Gary Cooper"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0000011?ref_=tt_cl_t1", "name": "Marshal Will Kane"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000978/?ref_=tt_cl_t3", "name": "Lloyd Bridges"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0000978?ref_=tt_cl_t3", "name": "Deputy Marshal Harvey Pell"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000038/?ref_=tt_cl_t5", "name": "Grace Kelly"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0000038?ref_=tt_cl_t5", "name": "Amy Fowler Kane"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001033/?ref_=tt_cl_t7", "name": "Lon Chaney Jr."}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0001033?ref_=tt_cl_t7", "name": "Martin Howe"}]}, {"actor": {"@type": "Person", "url": "/name/nm0531756/?ref_=tt_cl_t9", "name": "Ian MacDonald"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0531756?ref_=tt_cl_t9", "name": "Frank Miller"}]}, {"actor": {"@type": "Person", "url": "/name/nm0267670/?ref_=tt_cl_t11", "name": "Morgan Farley"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0267670?ref_=tt_cl_t11", "name": "Dr. Mahin - Minister"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001812/?ref_=tt_cl_t13", "name": "Lee Van Cleef"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0001812?ref_=tt_cl_t13", "name": "Jack Colby"}]}, {"actor": {"@type": "Person", "url": "/name/nm0941125/?ref_=tt_cl_t15", "name": "Sheb Wooley"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0941125?ref_=tt_cl_t15", "name": "Ben Miller"}]}, {"actor": {"@type": "Person", "url": "/name/nm0593775/?ref_=tt_cl_t2", "name": "Thomas Mitchell"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0593775?ref_=tt_cl_t2", "name": "Mayor Jonas Henderson"}]}, {"actor": {"@type": "Person", "url": "/name/nm0432827/?ref_=tt_cl_t4", "name": "Katy Jurado"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0432827?ref_=tt_cl_t4", "name": "Helen Ramírez"}]}, {"actor": {"@type": "Person", "url": "/name/nm0472603/?ref_=tt_cl_t6", "name": "Otto Kruger"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0472603?ref_=tt_cl_t6", "name": "Judge Percy Mettrick"}]}, {"actor": {"@type": "Person", "url": "/name/nm0604702/?ref_=tt_cl_t8", "name": "Harry Morgan"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0604702?ref_=tt_cl_t8", "name": "Sam Fuller"}]}, {"actor": {"@type": "Person", "url": "/name/nm0574670/?ref_=tt_cl_t10", "name": "Eve McVeagh"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0574670?ref_=tt_cl_t10", "name": "Mildred Fuller"}]}, {"actor": {"@type": "Person", "url": "/name/nm0788288/?ref_=tt_cl_t12", "name": "Harry Shannon"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0788288?ref_=tt_cl_t12", "name": "Cooper"}]}, {"actor": {"@type": "Person", "url": "/name/nm0929057/?ref_=tt_cl_t14", "name": "Robert J. Wilke"}, "character_and_episodes": [{"url": "/title/tt0044706/characters/nm0929057?ref_=tt_cl_t14", "name": "Jim Pierce"}]}]}