{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0093428/", "name": "The Living Daylights", "image": "https://m.media-amazon.com/images/M/MV5BZjI4MjBmYzItYTY5OC00OWYzLWE0NWYtZDQxNDQxM2QzYjA4XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg", "genre": ["Action", "Adventure", "Thriller"], "contentRating": "PG", "actor": [{"@type": "Person", "url": "/name/nm0001096/", "name": "Timothy Dalton"}, {"@type": "Person", "url": "/name/nm0001881/", "name": "Maryam d'Abo"}, {"@type": "Person", "url": "/name/nm0469103/", "name": "Jeroen Krabbé"}, {"@type": "Person", "url": "/name/nm0000833/", "name": "Joe Don Baker"}], "director": {"@type": "Person", "url": "/name/nm0322515/", "name": "John Glen"}, "creator": [{"@type": "Person", "url": "/name/nm0537363/", "name": "Richard Maibaum"}, {"@type": "Person", "url": "/name/nm0933865/", "name": "Michael G. Wilson"}, {"@type": "Person", "url": "/name/nm0001220/", "name": "Ian Fleming"}, {"@type": "Organization", "url": "/company/co0054040/"}], "description": "The Living Daylights is a movie starring Timothy Dalton, Maryam d'Abo, and Jeroen Krabbé. James Bond is sent to investigate a KGB policy to kill all enemy spies and uncovers an arms deal that potentially has major global...", "datePublished": "1987-06-30", "keywords": "soviet general,defection,soviet afghanistan war,deception,betrayal", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 89984, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0093428/"}, "author": {"@type": "Person", "name": "timdalton007"}, "dateCreated": "2005-11-29", "inLanguage": "English", "name": "Ian Fleming's James Bond 007 Returns At Last!", "reviewBody": "At the end of thirteen years of comedic 007 adventures, opinions among many fans were for a return to the more serious films of the early Connery era. The hopes of fans were realized with this film that began a new era in the world of 007.\n\nTimothy Dalton is perhaps the closest actor in terms of vision to Ian Fleming's idea of Bond. He certainly looks the part, with his scalp of wild black hair and his piercing blue eyes, and can actually visualize 007. Just look when Bond is at the fair, having lost Saunders's murderer amongst the crowd and found the balloon with Smyert Spionam scrawled over them. This guy can act. Despite this being his first film as Bond, we get the feeling that he's been playing the part for years with his mastering of the character. Dalton is also great in the action sequences and his belief that he should do as many of his stunts as possible makes it hard to determine when its him and when its a stuntman. \n\nThe change continues on with the Bond girl Kara Milovy. Maryam d'Abo may not have had a lot of acting experience before this but she is a good actress. Her character goes far beyond being just eye candy. She's realistic. She's an average woman who is drawn into this world on intrigue, action, and danger. Kara is an innocent brought into it all by a man she cares for deeply and whom she owes everything to. She is also very beautiful and while she isn't the smartest Bond girl of them all, her gradual relationship with Bond provides one of the series few true love stories.\n\nIf the film has a fault in it, it would have to be the villains. While both Jeroen Krabbe and Joe Don Baker are great actors, this isn't there shinning moment. Both of the characters of General Georgi Koskov and Brad Whitaker are too UN-villain like to be bad guys. Any menace that Koskov might have had is ruined by the fact that he is constantly kissing everyone on the cheek. Brad Whitaker is also too weird to be a villain. He is in many respects the ultimate military historian and in another the craziest. At least unlike Koskov, he does have a great final showdown with Bond during the fantastic gun battle at the films end.\n\nThe supporting cast is also excellent. Andreas Wisniewski is great as Necros. He is menacing and despite being an obvious take on Red Grant from FRWL, he manages to be original. John Rhys-Davies and Art Malik are fantastic as the allies of the film. Both actors are initially suspicious to us, but when they are revealed as allies they are the ones we want on Bond's side. Too bad we didn't see more of them. And let's not forget Thomas Wheatley as Saunders. He is the ultimate bureaucratic agent. But he can get the job done and he's so good that when he becomes the film's sacrificial lamb we feel for his loss. As for Caroline Bliss and John Terry it is hard to find good things to say. Both were replacements for well-known and beloved characters in the series and it wasn't going to be easy. Here they failed. Neither has enough screen time to establish them in the parts and when they are on screen they are lousy at best. \n\nThe action sequences are among the best in the series. The teaser featuring the training exercise and later chase on Gibraltar was the best until Goldeneye. The car chase is not only the best car chase since FYEO but also the triumphant return of the classic Aston Martin. While the car has gadgets, they are at least believable and the chase features the classic scene of the police car being split in half and Bond and Kara escaping over the border in the cello case. Other great action scenes include the roof top chase in Morocco, the battle at the Afghan airbase, and the gun battle between Bond and Whitaker. But the films best action sequence is the cargo net fight at the film's end. The excellent editing together of the aerial footage and footage shot in the studio puts together the best fight sequence since the beach fight in OHMSS. Despite the action, the film's plot never suffers and makes this perhaps the best-paced Bond film.\n\nThere is also the matter of John Barry's score. It is largely action based making excellent use of the main title theme song, the song \"Where Has Everybody Gone?\" and the James Bond Theme and taking a heavy synthesizer feel. That the score a feel of being both modern and yet a classic feeling. But perhaps the films best music is the romantic music used in the scenes between Bond and Kara. There is also the suspenseful music used in the desert sequences that, while featuring the synthesizer feel of the action scenes, still feels in place and reminds the listener of Barry's classic suspense music.\n\nThe films songs are a mixed bag. The main title theme, a musical collaboration between Barry and the rock group aha, is a good main title song. It is heavily rock though and the lack of an orchestral feel hurts the song considerable and it pales in comparison to the main title song from AVTAK. The films other two songs , while being great to listen to, feel out of place in a Bond movie.\n\nDespite weak villains, a couple of questionable supporting players, a rather complicated plot, and a mixed song bag, this film delivers. With Timothy Dalton's grand performance as Bond, Maryam d'Abo as Kara, a good supporting cast, great action scenes, and a great score, The Living Daylights delivers a classic Bond adventure that ranks just outside the top five classic films.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT2H10M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi4162371097", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGUzNDA3YmYtYWNiZS00YjAxLTk3OTEtMTM5MWFhMjI2ZjVhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGUzNDA3YmYtYWNiZS00YjAxLTk3OTEtMTM5MWFhMjI2ZjVhXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "uploadDate": "2020-06-29T13:17:15Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0001096/?ref_=tt_cl_t1", "name": "Timothy Dalton"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0001096?ref_=tt_cl_t1", "name": "James Bond"}]}, {"actor": {"@type": "Person", "url": "/name/nm0469103/?ref_=tt_cl_t3", "name": "Jeroen Krabbé"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0469103?ref_=tt_cl_t3", "name": "General Georgi Koskov"}]}, {"actor": {"@type": "Person", "url": "/name/nm0722636/?ref_=tt_cl_t5", "name": "John Rhys-Davies"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0722636?ref_=tt_cl_t5", "name": "General Leonid Pushkin"}]}, {"actor": {"@type": "Person", "url": "/name/nm0936591/?ref_=tt_cl_t7", "name": "Andreas Wisniewski"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0936591?ref_=tt_cl_t7", "name": "Necros"}]}, {"actor": {"@type": "Person", "url": "/name/nm0005155/?ref_=tt_cl_t9", "name": "Desmond Llewelyn"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0005155?ref_=tt_cl_t9", "name": "Q"}]}, {"actor": {"@type": "Person", "url": "/name/nm0444584/?ref_=tt_cl_t11", "name": "Geoffrey Keen"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0444584?ref_=tt_cl_t11", "name": "Minister of Defence"}]}, {"actor": {"@type": "Person", "url": "/name/nm0088504/?ref_=tt_cl_t13", "name": "Caroline Bliss"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0088504?ref_=tt_cl_t13", "name": "Miss Moneypenny"}]}, {"actor": {"@type": "Person", "url": "/name/nm0382162/?ref_=tt_cl_t15", "name": "Virginia Hey"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0382162?ref_=tt_cl_t15", "name": "Rubavitch"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001881/?ref_=tt_cl_t2", "name": "Maryam d'Abo"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0001881?ref_=tt_cl_t2", "name": "Kara Milovy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000833/?ref_=tt_cl_t4", "name": "Joe Don Baker"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0000833?ref_=tt_cl_t4", "name": "Brad Whitaker"}]}, {"actor": {"@type": "Person", "url": "/name/nm0539562/?ref_=tt_cl_t6", "name": "Art Malik"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0539562?ref_=tt_cl_t6", "name": "Kamran Shah"}]}, {"actor": {"@type": "Person", "url": "/name/nm0923703/?ref_=tt_cl_t8", "name": "Thomas Wheatley"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0923703?ref_=tt_cl_t8", "name": "Saunders"}]}, {"actor": {"@type": "Person", "url": "/name/nm0114533/?ref_=tt_cl_t10", "name": "Robert Brown"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0114533?ref_=tt_cl_t10", "name": "M"}]}, {"actor": {"@type": "Person", "url": "/name/nm0331770/?ref_=tt_cl_t12", "name": "Walter Gotell"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0331770?ref_=tt_cl_t12", "name": "General Anatol Gogol"}]}, {"actor": {"@type": "Person", "url": "/name/nm0856012/?ref_=tt_cl_t14", "name": "John Terry"}, "character_and_episodes": [{"url": "/title/tt0093428/characters/nm0856012?ref_=tt_cl_t14", "name": "Felix Leiter"}]}]}