{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0240278/", "name": "The Lost World", "image": "https://m.media-amazon.com/images/M/MV5BNDg3ZjFiY2EtODEwZS00MzE2LWE1M2ItZmUyZGM3ZjZlOTA2XkEyXkFqcGdeQXVyMTk5MjAyMjM@._V1_.jpg", "genre": ["Action", "Adventure", "Sci-Fi"], "contentRating": "TV-PG", "actor": [{"@type": "Person", "url": "/name/nm0565518/", "name": "Peter McCauley"}, {"@type": "Person", "url": "/name/nm0086800/", "name": "Rachel Blakely"}, {"@type": "Person", "url": "/name/nm0640660/", "name": "Jennifer O'Dell"}, {"@type": "Person", "url": "/name/nm0811334/", "name": "William Snow"}], "description": "The Lost World is a TV series starring Peter McCauley, Rachel Blakely, and Jennifer O'Dell. The adventures of a band of explorers stranded in a mysterious land inhabited by dinosaurs and other dangers.", "datePublished": "1999-04-03", "creator": [{"@type": "Organization", "url": "/company/co0057546/"}, {"@type": "Organization", "url": "/company/co0133229/"}, {"@type": "Organization", "url": "/company/co0022693/"}, {"@type": "Organization", "url": "/company/co0185731/"}], "keywords": "dinosaur,expedition,lost world,exploration,based on novel", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 3625, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0240278/"}, "author": {"@type": "Person", "name": "cariart"}, "dateCreated": "2004-02-10", "inLanguage": "English", "name": "Cheesy, at Times, But an Exciting, Guilty Pleasure!", "reviewBody": "It is easy, perhaps TOO easy, to heap abuse on this series, very loosely adapted from Sir Arthur Conan Doyle's fantasy novel. Certainly, Doyle would not have recognized much of it; then again, would he have recognized a majority of the 'Sherlock Holmes' features over the years? And what would he have made of Steven Spielberg's \"borrowing\" his title for the second \"Jurassic Park\" film? Ultimately, any production's success or failure shouldn't be judged solely by the fidelity to the original work, but whether or not audiences accept it. Many marvelous adaptations, from the theatrical WAR OF THE WORLDS to television's \"The Third Man\" have carried over little of the original source material, but have won a place in our hearts, nonetheless.\n\nAnd this New Line-produced series, filmed in Australia, even at it's most absurd, was always an enjoyable thrill ride, with a very ingratiating cast!\n\nA spin off of a 1998 TV-movie, the series follows the adventures of an early 20th century party of explorers, stranded on a mysterious plateau in South America where multi-dimensional 'rifts' have allowed animals and cultures from past and future to co-exist. Led by brilliant Professor George Challenger (the wonderful Peter McCauley), a bearded, wild-haired scientist who thrives on facing the unknown, the party consists of handsome big game hunter Lord John Roxton (Australian actor/model Will Snow), mysterious benefactress Marguerite Krux (beautiful Australian actress Rachel Blakely), American journalist Ned Malone (Canadian actor David Orth), and elderly scientist, Professor Arthur Summerlee (Michael Sinelnikoff, whose character would 'die' by season's end). The TV-movie introduced a new character to the mix, blond 'native girl', Veronica, whose scientist parents had disappeared eleven years earlier. Portrayed by \"Beverly Hills 90210\" alumni Jennifer O'Dell, the voluptuous 'savage', scantily dressed, raised the level of sex appeal for the program immediately, and quickly became a fan favorite.\n\nWorking out of Veronica's huge tree house (a split-level that Tarzan would have been envious of), the characters would, each week, encounter everything from dinosaurs (created through CGI, and, while not quite 'realistic', still vastly superior to the stop-motion models, puppets, or rear-screen projected lizards of previous \"Lost World\" adaptations), to sophisticated cultures practicing human sacrifice, to demons and wizards, to nearly any kind of bizarre civilization one might imagine. Glimpses of each character's past allowed the cast to 'grow', and become more interesting, each season, and provided enjoyable subplots; Lord Roxton falls in love with the greedy, but lovely Marguerite, but her past includes espionage and other unsavory activities, so she only gradually accepts his advances; Veronica, drawn to Ned, must deal with his moodiness (WWI had left him emotionally fragile) and his sense of wanderlust. It is a tribute to the writers and talented cast that the subplots never sank into mini-soap operas!\n\nAustralian tax laws nearly sabotaged the series' third season; Canadian Orth and American O'Dell were forced to limit their appearances because of their being non-Australians. So Ned Malone was often away on a 'identity-crisis'-fueled quest, and Veronica, whisked away by a runaway balloon, returned later in the season with a pendant her mother had left for her with a distant tribe, and new responsibilities as 'Protector' of the plateau. A new character was introduced, a wise-cracking girl named Finn, from a hundred years in the future, who was transported back to the plateau by a Challenger invention. Portrayed by 24-year old Australian actress Lara Cox, she was a survivor of a radiation-poisoned Earth, and was quickly 'adopted' by the scientist, who made it his mission to prevent her future world from happening.\n\nDespite very respectable ratings, \"The Lost World\" was canceled after the third season (with a cliffhanger ending to end ALL cliffhanger endings!), because of spiraling production costs. The cast and crew have remained loyal to the series since cancellation, however, and there is still a slight, if dwindling, hope that the show may reappear, either in series format, or as TV-movies. \n\n\"The Lost World\" may never please Doyle 'purists', but it was certainly a most enjoyable 'guilty pleasure'. I join with it's many other fans in hoping it will return!"}, "trailer": {"@type": "VideoObject", "name": "Trailer", "embedUrl": "/video/imdb/vi1858519321", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGI0YmQ0YmMtYTk3Ni00YmNjLTk5ZDEtNDNmMmMyNDNlM2YxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGI0YmQ0YmMtYTk3Ni00YmNjLTk5ZDEtNDNmMmMyNDNlM2YxXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "uploadDate": "2020-11-17T02:02:01Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0565518/?ref_=tt_cl_t1", "name": "Peter McCauley"}, "character_and_episodes": [{"url": "/title/tt0240278/characters/nm0565518?ref_=tt_cl_t1", "name": "Professor George Challenger"}, {"url": "#", "name": "66 episodes, 1999-2002"}]}, {"actor": {"@type": "Person", "url": "/name/nm0640660/?ref_=tt_cl_t3", "name": "Jennifer O'Dell"}, "character_and_episodes": [{"url": "/title/tt0240278/characters/nm0640660?ref_=tt_cl_t3", "name": "Veronica Layton"}, {"url": "#", "name": "66 episodes, 1999-2002"}]}, {"actor": {"@type": "Person", "url": "/name/nm0650991/?ref_=tt_cl_t5", "name": "David Orth"}, "character_and_episodes": [{"url": "/title/tt0240278/characters/nm0650991?ref_=tt_cl_t5", "name": "Ned Malone"}, {"url": "#", "name": "54 episodes, 1999-2002"}]}, {"actor": {"@type": "Person", "url": "/name/nm0086800/?ref_=tt_cl_t2", "name": "Rachel Blakely"}, "character_and_episodes": [{"url": "/title/tt0240278/characters/nm0086800?ref_=tt_cl_t2", "name": "Marguerite Krux"}, {"url": "#", "name": "66 episodes, 1999-2002"}]}, {"actor": {"@type": "Person", "url": "/name/nm0811334/?ref_=tt_cl_t4", "name": "William Snow"}, "character_and_episodes": [{"url": "/title/tt0240278/characters/nm0811334?ref_=tt_cl_t4", "name": "Lord John Roxton"}, {"url": "#", "name": "66 episodes, 1999-2002"}]}, {"actor": {"@type": "Person", "url": "/name/nm0801831/?ref_=tt_cl_t6", "name": "Michael Sinelnikoff"}, "character_and_episodes": [{"url": "/title/tt0240278/characters/nm0801831?ref_=tt_cl_t6", "name": "Professor Arthur Summerlee"}, {"url": "#", "name": "23 episodes, 1999-2001"}]}]}