{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0315983/", "name": "House of Sand and Fog", "image": "https://m.media-amazon.com/images/M/MV5BMTIzMjQ5NzM2M15BMl5BanBnXkFtZTYwMzU2NDY3._V1_.jpg", "genre": ["Crime", "Drama"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000124/", "name": "Jennifer Connelly"}, {"@type": "Person", "url": "/name/nm0001426/", "name": "Ben Kingsley"}, {"@type": "Person", "url": "/name/nm0253035/", "name": "Ron Eldard"}, {"@type": "Person", "url": "/name/nm0004920/", "name": "Frances Fisher"}], "director": {"@type": "Person", "url": "/name/nm1166926/", "name": "Vadim Perelman"}, "creator": [{"@type": "Person", "url": "/name/nm1164318/", "name": "Andre Dubus III"}, {"@type": "Person", "url": "/name/nm1166926/", "name": "Vadim Perelman"}, {"@type": "Person", "url": "/name/nm1171067/", "name": "Shawn Lawrence Otto"}, {"@type": "Organization", "url": "/company/co0819670/"}, {"@type": "Organization", "url": "/company/co0008653/"}, {"@type": "Organization", "url": "/company/co0084186/"}, {"@type": "Organization", "url": "/company/co0022594/"}], "description": "House of Sand and Fog is a movie starring Jennifer Connelly, Ben Kingsley, and Ron Eldard. An abandoned wife is evicted from her house and starts a tragic conflict with her house's new owners.", "datePublished": "2004-01-09", "keywords": "tragedy,based on novel,suicide,depressed woman,family abandonment", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 65546, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0315983/"}, "author": {"@type": "Person", "name": "Rich B"}, "dateCreated": "2005-10-21", "inLanguage": "English", "name": "Superb movie, well directed and a stunning performance from Connelly. Shakespearean Tragedy in a modern setting.", "reviewBody": "Movie It's a great movie, without a doubt, a strong and intelligent offering with some of the strongest and most heartfelt performances I've seen for a long time. Jennifer Connelly is stunning, and I don't just mean in looks, her acting is amazing and is picked up on the audio commentary again and again. One scene early on requires her to shed a single tear while talking quite normally on the phone, as if on queue it drops. You can hardly believe someone could give such a heart wrenchingly emotional and confused performance as this and manage to retain a normal life, watching her you believe that she is in a downward spiral of depression and self destruction. A totally believable and emotionally charged performance.\n\nBen Kingsley also gives a great performance, although not so outwardly recognisable in emotion, it's only really until you watch the audio commentary and listen to the praise given by the Director and author that you realise how subtle and exacting his performance is. His character is defined by strength, beliefs and pride, and Kingsley gives an excellent performance, Shakespearean in stature.\n\nThe film itself is emotionally draining, and you feel you're being taken on that roller-coaster drop along with Connelly's character, but don't for a second think that you shouldn't see it for those reasons, it's a journey that is superbly rewarding as a movie and an education in the miscommunication of people. Particularly people of different cultures.\n\nAs the movie progresses and the events step further and further down towards their tragic conclusion, the characters become more and more complex. Starting as simple, pigeon holed characters that you've seen before, they soon become more real and pull you into the movie, wrapping you up in them. They become utterly engaging and you totally disengage from life around you.\n\nThere's a strong supporting cast, although the performance from Jonathan Ahdout is not too convincing, those around them are, I think a particular mention is required to Shohreh Aghdashloo who provides an emotional balance for the coldness of Kingsley's character and an emotional mirror to the devastation of Connelly's character.\n\nTwo things are mentioned in the audio commentary that I didn't really pick up on until then, but retrospectively you realise these contribute greatly to making it a great movie. The first is the subtlety, there are many images and scenes without words that you don't truly appreciate until a second viewing, or a very careful first one. The second is the way that Kinglsey praises the Director's style of never telling the audience what did happen and is going to happen, events just occur. For instance the breaking of the marriage of Ron Eldard, where there is no explanation given, it's just happened. This has the effect of treating the audience with respect and realising that they have intelligence, and it also makes for an excellent way of keeping the pace of the movie.\n\nPicture Presented: The picture is crisp and sharp, a superb use of lighting in the movie moving from the bright opening beginning of the story it darkens through time to the bleak and dismal closing scenes. The light is always warm and inviting, with any artificial light looking sterile, and the darker shots bleak and dismal. Some of the time lapse shots between scenes are beautiful.\n\nAudio Presented: The audio is very good, although there is nothing to really take advantage of a surrounding speaker system, the sound is kept sparse and atmospheric, with an extremely subtle and limited soundtrack it gives everything to the movie and never distracts.\n\nExtras Presented: What strikes you about this DVD are the beautiful animated menus, black and white shots from through the movie fill the background giving you the feeling of mystery and indeed sadness.\n\nThe Deleted Scenes are good, although alongside they have a dull and very annoying commentary. Rather than talking about the scene and giving some insights you are treated to noises of laughter, snorting and approval interspersed with over the top bouts of backslapping. Awful, before it's over you're dreading the onset of the audio commentary. The Behind the Scenes is good, but nothing new.\n\nThe Photo Gallery is very well done as it's not a gallery at all, it's a featurette that is filled with stills between interviews with people talking about actors, characters and key scenes. It's a very engaging way of creating a gallery. Another huge extra is the Shohreh Aghdashloo Audition, it's truly amazing to see this actress work through some very emotionally harrowing scenes one after the other right in front of your eyes, it gives you a superb grounding in what it really means to be an actor and auditioning. With this performance it's hardly surprising she gained the role.\n\nFinally there is the Audio Commentary, and after the pathetic commentary on the deleted scenes I was really concerned. However the backslapping was slightly subdued for the full commentary, still very evident but much more bearable due to the amount of information that was given about the story, filming and the actors themselves. Combining Kingsley, Vadim Perelman and Andre Dubus III, you are treated to a really wide view from story conception through development, filming, acting and ultimately post production. I really enjoyed this insightful commentary, although bordering on the crawling at parts, it gave you a lot more about the movie and the story. It also provides an interesting look at the actors and their methods.\n\nOverall The movie is superb and firmly fixes itself in the realms of classic tragedy. The acting from both leads is stunning, particularly Connelly, and the supporting cast provide strong backing. Powerful, emotional and at times quite harrowing, this is superb entertainment and a movie deserving far more recognition than it did, again particularly for Connelly.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT2H6M", "trailer": {"@type": "VideoObject", "name": "House of Sand and Fog", "embedUrl": "/video/imdb/vi4272750873", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2JhNjIwMGItODNlOS00MTVlLWJlMjgtNDNlMzVjYjA2ZWM5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2JhNjIwMGItODNlOS00MTVlLWJlMjgtNDNlMzVjYjA2ZWM5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "TH post", "uploadDate": "2008-04-11T14:28:20Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000124/?ref_=tt_cl_t1", "name": "Jennifer Connelly"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm0000124?ref_=tt_cl_t1", "name": "Kathy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0253035/?ref_=tt_cl_t3", "name": "Ron Eldard"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm0253035?ref_=tt_cl_t3", "name": "Lester"}]}, {"actor": {"@type": "Person", "url": "/name/nm0225332/?ref_=tt_cl_t5", "name": "Kim Dickens"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm0225332?ref_=tt_cl_t5", "name": "Carol Burdon"}]}, {"actor": {"@type": "Person", "url": "/name/nm1332975/?ref_=tt_cl_t7", "name": "Jonathan Ahdout"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm1332975?ref_=tt_cl_t7", "name": "Esmail"}]}, {"actor": {"@type": "Person", "url": "/name/nm0326988/?ref_=tt_cl_t9", "name": "Carlos Gómez"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm0326988?ref_=tt_cl_t9", "name": "Lt. Alvarez"}]}, {"actor": {"@type": "Person", "url": "/name/nm1503545/?ref_=tt_cl_t11", "name": "Jaleh Modjallal"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm1503545?ref_=tt_cl_t11", "name": "Yasmin"}]}, {"actor": {"@type": "Person", "url": "/name/nm1503524/?ref_=tt_cl_t13", "name": "Matthew Simonian"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm1503524?ref_=tt_cl_t13", "name": "Little Esmail"}]}, {"actor": {"@type": "Person", "url": "/name/nm0267503/?ref_=tt_cl_t15", "name": "Nasser Faris"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm0267503?ref_=tt_cl_t15", "name": "Wedding Guest"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001426/?ref_=tt_cl_t2", "name": "Ben Kingsley"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm0001426?ref_=tt_cl_t2", "name": "Behrani"}]}, {"actor": {"@type": "Person", "url": "/name/nm0004920/?ref_=tt_cl_t4", "name": "Frances Fisher"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm0004920?ref_=tt_cl_t4", "name": "Connie Walsh"}]}, {"actor": {"@type": "Person", "url": "/name/nm0013037/?ref_=tt_cl_t6", "name": "Shohreh Aghdashloo"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm0013037?ref_=tt_cl_t6", "name": "Nadi"}]}, {"actor": {"@type": "Person", "url": "/name/nm0712550/?ref_=tt_cl_t8", "name": "Navi Rawat"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm0712550?ref_=tt_cl_t8", "name": "Soraya"}]}, {"actor": {"@type": "Person", "url": "/name/nm0416164/?ref_=tt_cl_t10", "name": "Kia Jam"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm0416164?ref_=tt_cl_t10", "name": "Ali"}]}, {"actor": {"@type": "Person", "url": "/name/nm1393410/?ref_=tt_cl_t12", "name": "Samira Damavandi"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm1393410?ref_=tt_cl_t12", "name": "Little Soraya"}]}, {"actor": {"@type": "Person", "url": "/name/nm1068905/?ref_=tt_cl_t14", "name": "Namrata Singh Gujral"}, "character_and_episodes": [{"url": "/title/tt0315983/characters/nm1068905?ref_=tt_cl_t14", "name": "Wedding Guest"}]}]}