{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1111422/", "name": "The Taking of Pelham 123", "image": "https://m.media-amazon.com/images/M/MV5BMTU3NzA4MDcwNV5BMl5BanBnXkFtZTcwMDAyNzc1Mg@@._V1_.jpg", "genre": ["Action", "Crime", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000243/", "name": "Denzel Washington"}, {"@type": "Person", "url": "/name/nm0000237/", "name": "John Travolta"}, {"@type": "Person", "url": "/name/nm0350079/", "name": "Luis Guzmán"}, {"@type": "Person", "url": "/name/nm2963873/", "name": "Victor Gojcaj"}], "director": {"@type": "Person", "url": "/name/nm0001716/", "name": "Tony Scott"}, "creator": [{"@type": "Person", "url": "/name/nm0001338/", "name": "Brian Helgeland"}, {"@type": "Person", "url": "/name/nm0323945/", "name": "John Godey"}, {"@type": "Organization", "url": "/company/co0050868/"}, {"@type": "Organization", "url": "/company/co0007143/"}, {"@type": "Organization", "url": "/company/co0142678/"}, {"@type": "Organization", "url": "/company/co0074212/"}, {"@type": "Organization", "url": "/company/co0035535/"}], "description": "The Taking of Pelham 123 is a movie starring Denzel Washington, John Travolta, and Luis Guzmán. Armed men hijack a New York City subway train, holding the passengers hostage in return for a ransom, and turning an ordinary day's work...", "datePublished": "2009-06-10", "keywords": "man wears eyeglasses,woman wears eyeglasses,train,hostage,subway", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 187217, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1111422/"}, "author": {"@type": "Person", "name": "jaredmobarak"}, "dateCreated": "2009-06-10", "inLanguage": "English", "name": "You a Yankees fan? \u0085 The Taking of Pelham 123", "reviewBody": "Go as far back to Top Gun and as far forward to the gem Déjà Vu and there are few blatant blemishes on Tony Scott's resume. Truthfully, Spy Game, Man on Fire, Domino, and Déjà Vu are a high-octane run of real winners in my opinion. So, I went into the new version of The Taking of Pelham 123, (adapted from the original novel and not the previous film), with a mix of excitement and cautiousness that the streak may come to an end. Don't get me wrong, the new flick is fun, however, it is the first time I actually thought to myself that the flash was too much—visceral overkill. I never thought I'd say it, but Tony's style over substance knock finally showed face.\n\nWhat do I love about Tony's films? Mostly his unabashed approach to using hyper cuts, loud beats, and a no-holds-barred, knock me upside the head, execution. His films are more a ride than a journey; strap yourself in and let the imagery flow over you. Generally this works wonders as his films take place in multiple locales with many story lines and or timelines playing out simultaneously. With Pelham, however, we are given a pretty straightforward hostage situation, only two locations, (the hijacked subway car and base control), and really no twists or surprises to be had. Frankly, Ridley may have been better suited to this material as he is the storyteller of the duo. I love Tony's use of text and moving subtitles, but here, the minutes of a deadline being our only vested interest, it becomes a gimmick. We know time is running out, we don't need the freeze-frames telling us again and again. I also understand his want to utilize the speed of the train as a means to show motion and MTV-generation style, but honestly, I think it was utilized more successfully in his Amazon.com short Agent Orange. The flash and trademark style sadly becomes fluff. My God, I sound like all those Tony detractors I despise.\n\nThe story itself is an intriguing one, if not original. We have a man out for money, taking hostages in a well-thought out plan. With an inside man who knows the tunnels and workings of the subway, his own keen sense of the way the world works, and a remorseless mind when it comes to innocent civilians, (each death is at the hands of NYC, not him; \"we all owe God a death\"), John Travolta's Ryder is a sick cookie just waiting to blow and completely unafraid to die. He is forever joined with Denzel Washington's dispatcher Walter Garber, the one man he is willing to trust and use for his benefit. Will the terrorist get his spoils or will the unlikely man—the only one with the ability to stop him—rise to the occasion and save the day? Unfortunately, that question is not very hard to solve since the thriller aspects of the film are pretty paint-by-numbers. If there is one thing to take from the movie, it is the performances of our two leads. One for his understated verité and the other for his over-the-top antics.\n\nPelham is truly all about Washington vs. Travolta; simple civil servant against the crazed, tattooed villain. If you are to single out a \"twist\" it is in the backgrounds of these two men, both of which get uncovered as the plot progresses. While the truths of their pasts may help propel the story to its conclusion, they do very little to enhance the roles or bring more interest to the story. In fact, the multiple tidbits of information or sprinkling of convenient props around the sets are mere contrivances and nothing more. The blatant positioning of a laptop aboard the train could have been a key piece to the puzzle, causing major distraction, changing the whole film in fact. Instead, it is a tool used to identify the captors, discoveries that add nothing to the plot. Actually, the only thing they add is to include even more examples of lazy writing on how everyone is somehow connected, whether to our leads, to the mayor, to the transit system, etc. I so wanted the underlying topic of Wall Street and the Stock Market to mean something, but again, all it did was help uncover the name of the assailant, a minor point that is brushed aside without further relevance.\n\nAgain, though, Washington and Travolta are great together, whether side by side or on the other end of a microphone. You cannot deny the craft of Denzel and his ability to become a character, allowing us to see the tragedy behind the eyes of his composed exterior. His Garber is a man at a crossroads; unknowing what his future holds—either a return to his old position, a career demotion, or a jail cell. But he keeps his wits and does his best job to become a hostage negotiator with Travolta's Ryder. The courage and fortitude of this man may be the only things that could save the nineteen innocents on that train. As for Mr. Travolta, although he may have just one notch on the gauge—that being wild and over-the-top—he is having fun and plays the bad guy perfectly. Whereas his manic demeanor elicits laughs in serious, heroic roles, he really does hit villainy out of the park. Whether his Ryder is in this thing for the money or just to prove that he can do it, we may never know. However, the ride—there's that word again—he takes us on is worth the admission. I just wish it would have warranted a second ticket, but alas, I believe one trip may be enough."}, "duration": "PT1H46M", "trailer": {"@type": "VideoObject", "name": "The Taking of Pelham 123: Trailer #2", "embedUrl": "/video/imdb/vi1348535065", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTc4NTQ4Mjc4Nl5BMl5BanBnXkFtZTgwNjk4MTgyMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTc4NTQ4Mjc4Nl5BMl5BanBnXkFtZTgwNjk4MTgyMzE@._V1_.jpg", "description": "Armed men hijack a New York City subway train, holding the passengers hostage in return for a ransom, and turning an ordinary day's work for dispatcher Walter Garbe (Washington) into a face-off with the mastermind behind the crime (Travolta).", "uploadDate": "2009-04-03T09:47:34Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000243/?ref_=tt_cl_t1", "name": "Denzel Washington"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm0000243?ref_=tt_cl_t1", "name": "Walter Garber"}]}, {"actor": {"@type": "Person", "url": "/name/nm0350079/?ref_=tt_cl_t3", "name": "Luis Guzmán"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm0350079?ref_=tt_cl_t3", "name": "Phil Ramos"}]}, {"actor": {"@type": "Person", "url": "/name/nm2963717/?ref_=tt_cl_t5", "name": "Robert Vataj"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm2963717?ref_=tt_cl_t5", "name": "Emri"}]}, {"actor": {"@type": "Person", "url": "/name/nm0728346/?ref_=tt_cl_t7", "name": "Michael Rispoli"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm0728346?ref_=tt_cl_t7", "name": "John Johnson"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001254/?ref_=tt_cl_t9", "name": "James Gandolfini"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm0001254?ref_=tt_cl_t9", "name": "Mayor"}]}, {"actor": {"@type": "Person", "url": "/name/nm2191189/?ref_=tt_cl_t11", "name": "Alex Kaluzhsky"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm2191189?ref_=tt_cl_t11", "name": "George"}]}, {"actor": {"@type": "Person", "url": "/name/nm2081916/?ref_=tt_cl_t13", "name": "Katherine Sigismund"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm2081916?ref_=tt_cl_t13", "name": "Mom"}]}, {"actor": {"@type": "Person", "url": "/name/nm0124798/?ref_=tt_cl_t15", "name": "Jason Butler Harner"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm0124798?ref_=tt_cl_t15", "name": "Mr. Thomas"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000237/?ref_=tt_cl_t2", "name": "John Travolta"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm0000237?ref_=tt_cl_t2", "name": "Ryder"}]}, {"actor": {"@type": "Person", "url": "/name/nm2963873/?ref_=tt_cl_t4", "name": "Victor Gojcaj"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm2963873?ref_=tt_cl_t4", "name": "Bashkin"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001806/?ref_=tt_cl_t6", "name": "John Turturro"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm0001806?ref_=tt_cl_t6", "name": "Camonetti"}]}, {"actor": {"@type": "Person", "url": "/name/nm1913125/?ref_=tt_cl_t8", "name": "Ramon Rodriguez"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm1913125?ref_=tt_cl_t8", "name": "Delgado"}]}, {"actor": {"@type": "Person", "url": "/name/nm0382632/?ref_=tt_cl_t10", "name": "John Benjamin Hickey"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm0382632?ref_=tt_cl_t10", "name": "Deputy Mayor LaSalle"}]}, {"actor": {"@type": "Person", "url": "/name/nm1782153/?ref_=tt_cl_t12", "name": "Gbenga Akinnagbe"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm1782153?ref_=tt_cl_t12", "name": "Wallace"}]}, {"actor": {"@type": "Person", "url": "/name/nm2973456/?ref_=tt_cl_t14", "name": "Jake Siciliano"}, "character_and_episodes": [{"url": "/title/tt1111422/characters/nm2973456?ref_=tt_cl_t14", "name": "8-Year-Old Boy"}]}]}