{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2226597/", "name": "The Mountain Between Us", "image": "https://m.media-amazon.com/images/M/MV5BNjllMWJmZTEtODA2Mi00MzY3LThiYmMtZDFjYjQ2NDM2MWJkXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg", "genre": ["Action", "Adventure", "Drama", "Romance", "Thriller"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0000701/", "name": "Kate Winslet"}, {"@type": "Person", "url": "/name/nm0252961/", "name": "Idris Elba"}, {"@type": "Person", "url": "/name/nm0000977/", "name": "Beau Bridges"}, {"@type": "Person", "url": "/name/nm0000551/", "name": "Dermot Mulroney"}], "director": {"@type": "Person", "url": "/name/nm0009463/", "name": "Hany Abu-Assad"}, "creator": [{"@type": "Person", "url": "/name/nm0919363/", "name": "Chris Weitz"}, {"@type": "Person", "url": "/name/nm0328987/", "name": "J. Mills Goodloe"}, {"@type": "Person", "url": "/name/nm4887947/", "name": "Charles Martin"}, {"@type": "Organization", "url": "/company/co0286257/"}, {"@type": "Organization", "url": "/company/co0000756/"}], "description": "The Mountain Between Us is a movie starring Kate Winslet, Idris Elba, and Beau Bridges. Stranded after a tragic plane crash, two strangers must forge a connection to survive the extreme elements of a remote snow-covered mountain....", "datePublished": "2017-10-05", "keywords": "survival,mountain,wilderness,neurosurgeon,stroke", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 68334, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2226597/"}, "author": {"@type": "Person", "name": "rgkarim"}, "dateCreated": "2017-10-06", "inLanguage": "English", "name": "The Mixture Between Us", "reviewBody": "The mighty majestic mountains that line the world. These monolithic displays of nature are icons for so many forms of expression such as poetry, video game stages, and yes even movies. Such symbolism is perfect to craft such an obstruction for heroes to face, all while teaching valuable lessons. And thus leads me to my next review, on a movie that centers on the immobile giants that watch over the world. The Mountain Between Us is the name of the film and its trailers have certainly stirred up a storm in the world of reviews. Robbie K here hoping to guide you through the mess to help guide your viewing pleasures. \n\nLIKES:\n\nThe acting: Like the mountains they are stuck in, the lead actors in this movie are giants themselves, displaying their talents to high levels. Idris Elba once more blows my mind out how well he executes his roles. He sells the suffering surgeon well, playing the internalization well and the survivalist even more. Kate Winslet as ever brings her character to life, taking the fiery spirit she has within, and unleashing it in a manner that is wild, yet honed as the movie progresses. The two certainly have the portrayal of suffering down pat (they can really shiver) but on many levels they play well off each other, especially in the beginning. \n\nThe Dog: While not the main human actor, the dog is by far the character I cared about the most. This animal, while of course like many of his canine brethren, was cute to me and impressive in the work it had to do. Trekking through the show, climbing mountains, and a variety of other things the dog certainly caught my eye for much of the screen. In addition, because I'm a big animal fan, the dog was the character that kept me engaged in the film. Every scene transition, or new challenge I couldn't help, but think \"What happened to the dog.\" That component is perhaps the biggest hooking element in the movie to keep you into the film. What is its fate? Can't tell you, you'll have to watch. \n\nThe Scenery: While it is no substitute for the real thing, The Mountain Between Us is a great example of stunning camera work. My breath was taken away by all the panoramic shots of the wilderness from the ever expanding sky in the peaks, to the silent wonder of the forest littering the valleys below. It brings out the deadly force that mother nature holds and stunned me by the majesty of the visual prowess cameras can pick up. So while it is again not the same thing as hiking these majestic peaks, it is the next best thing. \n\nDISLIKES:\n\nDiluted Suspense: If you are like me, the trailers might have you believe this was going to be the most suspenseful movie of the year. Unfortunately, I was fooled again. This film has some moments that got my anxiety building, but a majority of it is an almost peaceful trek through the snow. While they are certainly cold, our character's journey through the frozen wastelands lacked many elements to build up the intensity. Perhaps the lack of a cinematic score, or the fact that obstacles seemed cleared too easily thanks to convenience, this movies frozen fury was almost a little too fragile for me. Or maybe it was the other focus of the movie that downgraded the suspense for me\u0085\n\nThe Love Theme: Yes, just like the symbolic title suggests, the main wedge is the character's backstories preventing them from moving to the obvious sign of starting a romance. Much of the film tries to get the two to address their rather quick development of passion for one another in some rather lackluster ways. I wasn't sold on the romance for the most part, and the actors themselves didn't seem quite charmed by each other outside of one rather pointless scene. The friendship factor at the beginning was much stronger, and would have been the route I had taken in developing the story. Again, I don't necessarily hate love, but I would like it better portrayed for my investment. \n\nDisproportion: Timing the movie, as good geeks do, it took only 8 minutes to get up on the mountain. While I appreciate the fast pace, it gave little time to get to know the characters or at least give them a decent introduction to the madness about to be had. This opening was rather shallow and quite disappointing in the grand scheme of the movie. Yet it's not quite as bad as the dragged out ending of this film. While not as long as Return of The King, and all its false exits, The Mountain Between Us sort fizzles out in the end. This tangent was not necessary, a quick closure to try and tidy up some loose ends of a weaker component of the film. Worst off, the chemistry started to falter, making this an awkward mess with a rather cheesy, albeit poetic, ending. Not sure why these last 25 minutes needed to exist, but it could have been better spent in the beginning and end of the movie. \n\nThe VERDICT:\n\nThe Mountain Between Us is a beautiful spectacle of what the world can provide in terms of a stage, certainly blowing my mind on the visuals. Alongside this majestic scenery comes some quality acting and a hooking factor in the form of the dog. Yet these tools alone couldn't save this movie from being semi-dull. With the tension dropped to a PG level for symbolism and awkward love, alongside disproportioned parts, I can't say this movie delivered all I wanted. The visuals might be the main theater worthy component, but this reviewer suggests holding out for RedBox to catch it. \n\nMy Scores:\n\nAction/Adventure/Drama: 6.5 Movie Overall: 5.5", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H52M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi619886873", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTUzMjYxNzgzN15BMl5BanBnXkFtZTgwMTI5Njc0MjI@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTUzMjYxNzgzN15BMl5BanBnXkFtZTgwMTI5Njc0MjI@._V1_.jpg", "description": "Stranded after a tragic plane crash, two strangers must forge a connection to survive the extreme elements of a remote snow covered mountain.", "uploadDate": "2017-05-31T13:06:44Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000701/?ref_=tt_cl_t1", "name": "Kate Winslet"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm0000701?ref_=tt_cl_t1", "name": "Alex Martin"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000977/?ref_=tt_cl_t3", "name": "Beau Bridges"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm0000977?ref_=tt_cl_t3", "name": "Walter"}]}, {"actor": {"@type": "Person", "url": "/name/nm0814857/?ref_=tt_cl_t5", "name": "Linda Sorensen"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm0814857?ref_=tt_cl_t5", "name": "Pamela"}]}, {"actor": {"@type": "Person", "url": "/name/nm0396685/?ref_=tt_cl_t7", "name": "Marci T. House"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm0396685?ref_=tt_cl_t7", "name": "Airline Rep"}]}, {"actor": {"@type": "Person", "url": "/name/nm2837384/?ref_=tt_cl_t9", "name": "Lee Majdoub"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm2837384?ref_=tt_cl_t9", "name": "Translator"}]}, {"actor": {"@type": "Person", "url": "/name/nm0803337/?ref_=tt_cl_t11", "name": "Nancy Sivak"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm0803337?ref_=tt_cl_t11", "name": "Nurse"}]}, {"actor": {"@type": "Person", "url": "/name/nm9301676/?ref_=tt_cl_t13", "name": "Orval Roberts"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm9301676?ref_=tt_cl_t13", "name": "Logging Truck Driver"}]}, {"actor": {"@type": "Person", "url": "/name/nm9301678/?ref_=tt_cl_t15", "name": "Austin"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm9301678?ref_=tt_cl_t15", "name": "Dog"}]}, {"actor": {"@type": "Person", "url": "/name/nm0252961/?ref_=tt_cl_t2", "name": "Idris Elba"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm0252961?ref_=tt_cl_t2", "name": "Ben Bass"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000551/?ref_=tt_cl_t4", "name": "Dermot Mulroney"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm0000551?ref_=tt_cl_t4", "name": "Mark"}]}, {"actor": {"@type": "Person", "url": "/name/nm0301925/?ref_=tt_cl_t6", "name": "Vincent Gale"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm0301925?ref_=tt_cl_t6", "name": "Airline Customer Service"}]}, {"actor": {"@type": "Person", "url": "/name/nm9301674/?ref_=tt_cl_t8", "name": "Dania Nassar"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm9301674?ref_=tt_cl_t8", "name": "Female Patient (Mrs. Qabbani)"}]}, {"actor": {"@type": "Person", "url": "/name/nm7739715/?ref_=tt_cl_t10", "name": "Andres Joseph"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm7739715?ref_=tt_cl_t10", "name": "Dinner Guest"}]}, {"actor": {"@type": "Person", "url": "/name/nm2718637/?ref_=tt_cl_t12", "name": "Bethany Brown"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm2718637?ref_=tt_cl_t12", "name": "New York Waiter"}]}, {"actor": {"@type": "Person", "url": "/name/nm9301677/?ref_=tt_cl_t14", "name": "Raleigh"}, "character_and_episodes": [{"url": "/title/tt2226597/characters/nm9301677?ref_=tt_cl_t14", "name": "Dog"}]}]}