{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0112913/", "name": "Do lok tin si", "image": "https://m.media-amazon.com/images/M/MV5BZjM4NWRhYTQtYTJlNC00ZmMyLWEzNTAtZDA2MjJjYTQ5ZTVmXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Comedy", "Crime", "Drama", "Romance"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm0481709/", "name": "Leon Lai"}, {"@type": "Person", "url": "/name/nm0718348/", "name": "Michelle Reis"}, {"@type": "Person", "url": "/name/nm0437580/", "name": "Takeshi Kaneshiro"}, {"@type": "Person", "url": "/name/nm0947777/", "name": "Charlie Yeung"}], "director": {"@type": "Person", "url": "/name/nm0939182/", "name": "Kar-Wai Wong"}, "creator": [{"@type": "Person", "url": "/name/nm0939182/", "name": "Kar-Wai Wong"}, {"@type": "Organization", "url": "/company/co0070147/"}, {"@type": "Organization", "url": "/company/co0028255/"}, {"@type": "Organization", "url": "/company/co0074316/"}], "description": "Do lok tin si is a movie starring Leon Lai, Michelle Reis, and Takeshi Kaneshiro. This Hong Kong-set crime drama follows the lives of a hitman, hoping to get out of the business, and his elusive female partner.", "datePublished": "1995-09-06", "keywords": "female masturbation,slow motion scene,urban setting,pineapple,heartbreak", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 27147, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0112913/"}, "author": {"@type": "Person", "name": "p_radulescu"}, "dateCreated": "2011-08-22", "inLanguage": "English", "name": "Buddha said, If I don't descend into hell, who will?", "reviewBody": "Fallen Angels: like the companion movie (Chungking Express), it's a pure cinematographic gem born unexpectedly. Wong Kar-Wai and Chris Doyle were working on Ashes of Time, and the project was exhausting. They decided suddenly to put Ashes of Time on hold and to produce quickly something light, unpretentious, just to warm their spirits. There was no script, just a loose idea: some slices of life in today's Hong Kong, kind of romantic comedies with young heroes hanging around Chungking Mansions and Midnight Express. Two vignettes were made this way, with young cops falling in love, drug dealers wearing sun glasses and blond wigs, barmaids becoming flight attendants and flight attendants returning from San Francisco: this was Chungking Express, released in 1994.\n\nAs the third vignette was unfolding, it became clear for the director that the mood of the story was different, and it deserved a separate movie: that was Fallen Angels, released in 1995. Two completely distinct plots evolving in parallel, and intertwining only in brief moments and only by hazard. A young hit-man getting his assignments through a fax machine and a sympathetic and totally immature mute (played with irresistible charm by Takeshi Kaneshiro, who was also an irresistible cop-in-love in Chungking Express).\n\nWell, a mute cannot talk, everybody knows it, but what happens in Fallen Angels is that actually nobody seems able to communicate through human speech. The agent (Michelle Reis - I saw her also in Flowers of Shanghai) who gives the assignments to the hit-man (and even visits his narrow apartment when he is out) is a gorgeous girl, unconditionally in love for his subordinate. However she never meets him and prefers to masturbate instead. It is a terrifying impression of loneliness in a frenetic city, everybody is alone there, on her or his own, deepened in her or his own thoughts and dreams, and everybody's dreams seem crazy while only dreams keep you there to not get crazy.\n\nI remember the cabs in a region I used to live for many years: the driver had a small computer on board and all communication with the dispatcher was through the screen, no room for bargaining of any kind, no space for any human feeling, of joy or sorrow, of sympathy or sarcasm. Here in Fallen Angels it's the fax machine, the same sensation of alienation, of loss of humanity. Humans transformed in robots, keeping their human condition for themselves only, through masturbating dreams of impossible love.\n\nAnd it remains the city itself. Mark Rothko has a great observation about the relation between foreground and background in an art work: sometimes the personages (or the objects) have only the function to glorify the background (\"... may limit space arbitrarily and thus heron his objects. Or he makes infinite space, dwarfing the importance of objects, causing them to merge and become part of the space world\"). The same observation is somehow made by Malevich when analyzing the way Monet had rendered the Cathedral of Rouen: \"...when the artist paints, and he plants the paint, and the object is his flower-bed, he must sow the paint in such a way that the object disappears, because it is merely a ground for the visible paint with which it is painted.\" Is this movie about people alienated by Hong Kong, or is it here a meditative poem about the city itself? One of the personages in the movie has an unexpected sentence, \"Buddha said, If I don't descend into hell, who will?\" The sentence passes quickly and seems at first sight without any meaning in the logic of the story. Maybe it offers the clue: Hong Kong, this space of \"hyper-sub-reality\" (as one of the reviewers puts it), this \"Űbertraumstadt of ultimate nightmare\" (apud another reviewer), actually offers the image of hell, and the heroes of the story descend there, why? To follow the archetype? And if we go again to the observation made by Malevich on Monet and Rouen Cathedral, here in Fallen Angels subject and city disappear in the gorgeous cinematic language: a great movie pushing the cinematic language to its ultimate expression. A couple of great creators: Wong Kar-Wai and Chris Doyle. Let me add here that another great contemporary cinematographer was also part in the team: Mark Lee Ping-Bin.\n\nAnd if I were to choose an image from Fallen Angels, this one would be: the city in the night with its endless traffic and movement and changing lights, near the narrow apartment where the hit-man inspects quietly the fax machine."}, "duration": "PT1H39M", "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0481709/?ref_=tt_cl_t1", "name": "Leon Lai"}, "character_and_episodes": [{"url": "/title/tt0112913/characters/nm0481709?ref_=tt_cl_t1", "name": "Wong Chi-Ming"}, {"url": "/title/tt0112913/characters/nm0481709?ref_=tt_cl_t1", "name": "Killer"}]}, {"actor": {"@type": "Person", "url": "/name/nm0437580/?ref_=tt_cl_t3", "name": "Takeshi Kaneshiro"}, "character_and_episodes": [{"url": "/title/tt0112913/characters/nm0437580?ref_=tt_cl_t3", "name": "He Zhiwu"}]}, {"actor": {"@type": "Person", "url": "/name/nm0596297/?ref_=tt_cl_t5", "name": "Karen Mok"}, "character_and_episodes": [{"url": "/title/tt0112913/characters/nm0596297?ref_=tt_cl_t5", "name": "Punkie"}, {"url": "/title/tt0112913/characters/nm0596297?ref_=tt_cl_t5", "name": "Blondie"}, {"url": "/title/tt0112913/characters/nm0596297?ref_=tt_cl_t5", "name": "Baby"}]}, {"actor": {"@type": "Person", "url": "/name/nm0151014/?ref_=tt_cl_t7", "name": "Man-Lei Chan"}, "character_and_episodes": [{"url": "/title/tt0112913/characters/nm0151014?ref_=tt_cl_t7", "name": "He Zhiwu's father"}]}, {"actor": {"@type": "Person", "url": "/name/nm0389883/?ref_=tt_cl_t9", "name": "To-Hoi Kong"}, "character_and_episodes": [{"url": "/title/tt0112913/characters/nm0389883?ref_=tt_cl_t9", "name": "Ah-hoi"}]}, {"actor": {"@type": "Person", "url": "/name/nm0943206/?ref_=tt_cl_t11", "name": "Yuhao Wu"}, "character_and_episodes": [{"url": "/title/tt0112913/characters/nm0943206?ref_=tt_cl_t11", "name": "Man forced to have his clothes washed"}]}, {"actor": {"@type": "Person", "url": "/name/nm0718348/?ref_=tt_cl_t2", "name": "Michelle Reis"}, "character_and_episodes": [{"url": "/title/tt0112913/characters/nm0718348?ref_=tt_cl_t2", "name": "The Killer's Agent"}]}, {"actor": {"@type": "Person", "url": "/name/nm0947777/?ref_=tt_cl_t4", "name": "Charlie Yeung"}, "character_and_episodes": [{"url": "/title/tt0112913/characters/nm0947777?ref_=tt_cl_t4", "name": "Charlie"}, {"url": "/title/tt0112913/characters/nm0947777?ref_=tt_cl_t4", "name": "Cherry"}]}, {"actor": {"@type": "Person", "url": "/name/nm0150887/?ref_=tt_cl_t6", "name": "Fai-Hung Chan"}, "character_and_episodes": [{"url": "/title/tt0112913/characters/nm0150887?ref_=tt_cl_t6", "name": "The Man Forced to Eat Icecream"}]}, {"actor": {"@type": "Person", "url": "/name/nm0756873/?ref_=tt_cl_t8", "name": "Toru Saito"}, "character_and_episodes": [{"url": "/title/tt0112913/characters/nm0756873?ref_=tt_cl_t8", "name": "Sato"}]}, {"actor": {"@type": "Person", "url": "/name/nm0477082/?ref_=tt_cl_t10", "name": "Lee-Na Kwan"}, "character_and_episodes": [{"url": "/title/tt0112913/characters/nm0477082?ref_=tt_cl_t10", "name": "Woman Pressed to Buy Vegetables"}]}]}