{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt3850214/", "name": "Dope", "image": "https://m.media-amazon.com/images/M/MV5BMjA3MjYyNTk0Nl5BMl5BanBnXkFtZTgwODc1NzQ1NTE@._V1_.jpg", "genre": ["Adventure", "Comedy", "Crime", "Drama"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm4271336/", "name": "Shameik Moore"}, {"@type": "Person", "url": "/name/nm1727825/", "name": "Tony Revolori"}, {"@type": "Person", "url": "/name/nm4169922/", "name": "Kiersey Clemons"}, {"@type": "Person", "url": "/name/nm0253708/", "name": "Kimberly Elise"}], "director": {"@type": "Person", "url": "/name/nm0266622/", "name": "Rick Famuyiwa"}, "creator": [{"@type": "Person", "url": "/name/nm0266622/", "name": "Rick Famuyiwa"}, {"@type": "Organization", "url": "/company/co0493679/"}, {"@type": "Organization", "url": "/company/co0316424/"}, {"@type": "Organization", "url": "/company/co0141580/"}, {"@type": "Organization", "url": "/company/co0489361/"}], "description": "Dope is a movie starring Shameik Moore, Tony Revolori, and Kiersey Clemons. Life changes for Malcolm, a geek who's surviving life in a tough neighborhood, after a chance invitation to an underground party leads him and his friends...", "datePublished": "2015-06-19", "keywords": "african american,geek,hip hop,tomboy,bitcoin", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 81061, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt3850214/"}, "author": {"@type": "Person", "name": "CleveMan66"}, "dateCreated": "2015-06-20", "inLanguage": "English", "name": "\"Dope\" - come for the comedy, stay for the drama, leave entertained - and thinking.", "reviewBody": "As I was driving to the movie theater to see \"Dope\" (R, 1:43), I was thinking about how that word is usually used as a slang term and in one of three main ways. Then, as the movie opened, those three definitions appeared on the screen. (Thank you, filmmakers, for making it so easy for me to decide how to open this review.) In short, dope can mean a stupid person, something really cool or refer to an illegal drug. All this begs the question, which of those definitions applies to this film? Short answer: all of them.\n\nThe movie centers on highly intelligent black high school senior Malcolm (Shameik Moore) and his two friends, multi-racial Jib (Tony Revolori) and lesbian Diggy (Kiersey Clemons). Now, I only use these labels because these characters use them for themselves. (They also refer to each other using the n-word, a situation which is used both for laughs and social commentary.) Here's another label the three use for themselves: geeks. Malcolm, Jib and Diggy geek out over 1990s-era rap and hip-hop. They see the 90s as a golden age for these kinds of music and they dress accordingly. In their spare time, however, we see them practicing in their punk rock band. Yup, the three main characters use lots of labels, but they defy them at the same time. For example, even though they see themselves as geeks, it doesn't mean that they're not cool or are incapable of getting along with non-geeks. In short, these labels describe the characters, but don't define them. And that distinction is really what this movie is about.\n\n\"Dope\" takes place in one of the rougher neighborhoods in L.A., another circumstance that Malcolm seems intent on rising above. He is just hanging out with his friends and working at getting into Harvard when a chance meeting with a neighborhood drug dealer named Dom (A$AP Rocky) gets him invited to Dom's birthday party at a local club. The party\u0085 doesn't exactly go as planned. Malcolm ends up leaving with Nakia (Zoë Kravitz), a girl who Dom thinks belongs to him, but seems more attracted to Malcolm for being \"different from the others\" (and maybe because he can help her pass her GED). The next day, Malcolm discovers that he has also left the party with a significant amount of Ecstasy (aka Molly) and a gun that does belong to Dom. When a cell phone in the bag rings, the caller demands the drugs. Before Malcolm can hand off the contents of his backpack, the cell phone rings again. It's Dom, calling from jail and warning Malcolm not to turn over the drugs to the other caller. Malcolm is caught in the middle.\n\nHe receives instructions from Dom as to where to take the drugs, but he and his friends are still being pursued by that first caller (Amin Joseph). Malcom, Jib and Diggy take the drugs to a fancy house where Dom sends them and they meet their contact's young adult children (Keith Stanfield and Chanel Iman). Daddy's not home, so the five of them decide to hang out. Things don't go much better at the house than they did at the club the night before, so Malcolm and his friends are forced to improvise. They concoct a plan to get rid of the drugs with relatively little risk to themselves and the possibility of some significant rewards. They enlist the help of an old acquaintance from band camp (who also happens to be both a druggie and a hacker) by the name of Will Sherwood (Blake Anderson). Their audacious plan may solve all their problems, or it may land them in jail – or worse. No matter what happens, the three friends seem destined to shed at least some of their labels, and maybe gain some new ones.\n\n\"Dope\" reminds me of the inner-city-set films of the 90s (the very period with which the three main characters are obsessed), but with less violence and more laughs. The movie uses humor to add entertainment value to the story, but also as a different way of approaching some very important issues, including ongoing problems in our inner cities and the use of labels in our society at large. The film's pedigree certainly contributed to its effectiveness. \"Dope\" is produced (and partially narrated by) Forest Whitaker, while Sean Combs and Pharrell Williams share executive producer credits. It also doesn't hurt that the movie is so well-written and well-directed by Rick Famuyiwa (\"Brown Sugar\", \"The Wood\") and has a strong, though little-known cast.\n\nMalcolm and his friends are appealing and sympathetic characters, but make some morally questionable decisions. While the script makes light of their circumstances, it also slyly comments on them, but without suggesting definitive right and wrong answers. This is a coming-of-age movie that is both enjoyable and thought-provoking. There are a few too many loose ends for my taste and I found much of the plot to be a little too morally ambiguous, but this is still one of the best urban dramas in the past 20 years. To sum up this review, let me suggest some slightly altered meanings for the film's title: Dope can refer to some of the movie's main characters, the curse of their neighborhoods or anyone who won't at least consider seeing the film because of labels they may have already assigned to it. \"B+\"", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H43M", "trailer": {"@type": "VideoObject", "name": "New Trailer", "embedUrl": "/video/imdb/vi813871129", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjA3OTg2NDQ3OF5BMl5BanBnXkFtZTgwNjI4NDQ2NTE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjA3OTg2NDQ3OF5BMl5BanBnXkFtZTgwNjI4NDQ2NTE@._V1_.jpg", "description": "Malcolm is a geek, carefully surviving life in The Bottoms, a tough neighborhood in Inglewood, CA filled gangsters and drugs dealers, while juggling his senior year of college applications, interviews and the SAT. His dream is to attend Harvard. A chance invitation to a big underground party leads Malcolm and his friends into a, only in Los Angeles, gritty adventure filed with offbeat characters and bad choices. If Malcolm can persevere, he'll go from being a geek, to being dope, to ultimately being himself.", "uploadDate": "2015-05-09T18:30:49Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm5473880/?ref_=tt_cl_t1", "name": "ASAP Rocky"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm5473880?ref_=tt_cl_t1", "name": "Dom"}]}, {"actor": {"@type": "Person", "url": "/name/nm0064193/?ref_=tt_cl_t3", "name": "Bruce Beatty"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm0064193?ref_=tt_cl_t3", "name": "Mr. Bailey"}]}, {"actor": {"@type": "Person", "url": "/name/nm3903943/?ref_=tt_cl_t5", "name": "Julian Bond"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm3903943?ref_=tt_cl_t5", "name": "Mario"}]}, {"actor": {"@type": "Person", "url": "/name/nm4169922/?ref_=tt_cl_t7", "name": "Kiersey Clemons"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm4169922?ref_=tt_cl_t7", "name": "Diggy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0289213/?ref_=tt_cl_t9", "name": "Rick Fox"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm0289213?ref_=tt_cl_t9", "name": "Councilman Blackmon"}]}, {"actor": {"@type": "Person", "url": "/name/nm0365244/?ref_=tt_cl_t11", "name": "Ricky Harris"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm0365244?ref_=tt_cl_t11", "name": "Tannehill James"}]}, {"actor": {"@type": "Person", "url": "/name/nm0429480/?ref_=tt_cl_t13", "name": "Wyking Jones"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm0429480?ref_=tt_cl_t13", "name": "SAT Proctor"}]}, {"actor": {"@type": "Person", "url": "/name/nm7031438/?ref_=tt_cl_t15", "name": "Kap G"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm7031438?ref_=tt_cl_t15", "name": "Fidel X"}]}, {"actor": {"@type": "Person", "url": "/name/nm2981935/?ref_=tt_cl_t2", "name": "Blake Anderson"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm2981935?ref_=tt_cl_t2", "name": "Will Sherwood"}]}, {"actor": {"@type": "Person", "url": "/name/nm0094170/?ref_=tt_cl_t4", "name": "De'aundre Bonds"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm0094170?ref_=tt_cl_t4", "name": "Stacey"}]}, {"actor": {"@type": "Person", "url": "/name/nm1938751/?ref_=tt_cl_t6", "name": "Quincy Brown"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm1938751?ref_=tt_cl_t6", "name": "Jaleel"}]}, {"actor": {"@type": "Person", "url": "/name/nm0253708/?ref_=tt_cl_t8", "name": "Kimberly Elise"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm0253708?ref_=tt_cl_t8", "name": "Lisa Hayes"}]}, {"actor": {"@type": "Person", "url": "/name/nm6400046/?ref_=tt_cl_t10", "name": "Christopher Glenn"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm6400046?ref_=tt_cl_t10", "name": "Crip 1"}]}, {"actor": {"@type": "Person", "url": "/name/nm3568982/?ref_=tt_cl_t12", "name": "Chanel Iman"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm3568982?ref_=tt_cl_t12", "name": "Lily"}]}, {"actor": {"@type": "Person", "url": "/name/nm1514763/?ref_=tt_cl_t14", "name": "Amin Joseph"}, "character_and_episodes": [{"url": "/title/tt3850214/characters/nm1514763?ref_=tt_cl_t14", "name": "The Voice"}]}]}