{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0330251/", "name": "The L Word", "image": "https://m.media-amazon.com/images/M/MV5BMzkzNDI1NTg1MF5BMl5BanBnXkFtZTcwNTg3NDg5MQ@@._V1_.jpg", "genre": ["Drama", "Romance"], "contentRating": "TV-MA", "actor": [{"@type": "Person", "url": "/name/nm0000884/", "name": "Jennifer Beals"}, {"@type": "Person", "url": "/name/nm0354157/", "name": "Leisha Hailey"}, {"@type": "Person", "url": "/name/nm0391274/", "name": "Laurel Holloman"}, {"@type": "Person", "url": "/name/nm0000477/", "name": "Mia Kirshner"}], "creator": [{"@type": "Person", "url": "/name/nm1271093/", "name": "Michele Abbott"}, {"@type": "Person", "url": "/name/nm0149669/", "name": "Ilene Chaiken"}, {"@type": "Person", "url": "/name/nm1271884/", "name": "Kathy Greenberg"}, {"@type": "Organization", "url": "/company/co0017525/"}, {"@type": "Organization", "url": "/company/co0025636/"}, {"@type": "Organization", "url": "/company/co0052980/"}, {"@type": "Organization", "url": "/company/co0059559/"}], "description": "The L Word is a TV series starring Jennifer Beals, Leisha Hailey, and Laurel Holloman. Follows the lives and loves of a small, close-knit group of gay women living in Los Angeles as well as the friends and family members that either...", "datePublished": "2004-01-18", "keywords": "lesbian,lesbian couple,african american lesbian,lesbian mother,black lesbian", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 24210, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0330251/"}, "author": {"@type": "Person", "name": "liquidcelluloid-1"}, "dateCreated": "2005-03-20", "inLanguage": "English", "name": "Normal Defined: \"L\" is a soulful, beautiful pure character drama", "reviewBody": "Network: Showtime; Genre: Drama; Content Rating: TV-MA (for nudity, simulated sex, graphic sexual dialog and profanity); Available: DVD; Classification: Modern Classic (star range: 1 - 5) \n\nSeasons Reviewed: Complete Series (6 seasons)\n\nLlene Chaiken's \"The L Word\" is an ensemble melodrama that plunges us into the world of a tight-nit group of lesbians including Bette (Jennifer Beals) and Tina (Laurel Holloman), a long-time couple trying to start a family, bi-sexual creator of \"the chart\" Alice (Leisha Hailey , inspired as the comic relief), grating, tortured newcomer Jenny (Mia Kirshner), sex-magnet and hair-stylist to the stars Shane (Katherine Moennig) and celebrity tennis player Dana Fairbanks (Erin Daniels). Once the show starts rolling, the characters sink their teeth into you and don't let go. \n\nIf HBO is the standard setter, Showtime has carved out a niche \"answering\" HBO. A niche series played so specifically to a sliver demographic it could only work on Showtime, \"L\" is a strong-fisted answer to \"Sex and the City\" - though different in every possible way. Stripping away the romanticized fairy tale of the relationship show, \"Word\" runs on pure, naked authenticity. While it lacks \"Sex's\" intellectual pontification, everything - everything - about \"Word\" feels real. A gay marriage coupled coupled with a gay divorce, the excitement of new love coupled with the misery of a cheating partner, and sex is sometimes a beautiful expression of companionship and sometimes a meaty, awkward, disgusting mess. \"L\" has a late night Showtime inclination to titillate, but often the sex scenes and plentiful gratuitous nudity are the dullest part. You don't need a man to ruin your life, these women make each other miserable all on their own. The dramatic outbursts are raw and, at their best, difficult to watch. The performances are precise and jump boldly and with full commitment through each flaming hoop and some sloppy writing.\n\nIn these PC times it is hard not to talk about a show like \"L\" without stepping into the middle of a political firestorm. In some ways the show brings this on, from a hyper-defensive title to some unnecessary posturing in its more manipulative story lines (a to-the-camera speech by Gloria Steinham is a low point). There is no mistaking that, \"L\" has an out-in-your-face feminist agenda to shake up and reshape the world's traditional norms with the questions posed by the simple existence of the characters. What defines a marriage? What defines sex? What is art? What defines a parent/grandparent? It is all fascinating stuff. A few years ago this all may have been mind-blowingly iconoclastic material, but now with homosexuality the new media sacred cow, \"L\" is given a free license to do whatever it wants.\n\nThe difference between this show and others is that it takes full advantage in exploring this fertile ground. It doesn't fall back on its identity, taking for granted an audience that is starved for intelligent entertainment, but explores and expands beyond the one-note characters of \"Will & Grace\" or simply identifiable caricatures of \"Queer Eye\". Instead it is a multi-layered tapestry playing like a little epic, spanning the lesbian experience. I won't say that \"L\" is going to \"strike a civil rights blow\" for \"progressives\", but I will say that its sliver demographic has never been so well spoken for and the show never stops going all out to entertain. \n\nFirst and foremost a relationship series, \"L\"s characters open the door for some truly unique plot lines \u0096 such as Alice's relationship with a lesbian identified man, Dana's fiancé planning the first gay celebrity wedding out from under her and, the big season 1 question, Jenny's moral crisis over cheating on her male fiancé, Tim (Eric Mabius, given dignity few shows would allow), with another women. The weak link in the chain is Pam Grier as Bette's heterosexual sister Kit. The show about grinds to a halt when she appears to sing or whine about her alcoholism.\n\nThe production is beautiful all around. With a little imagination the show-runners have broken the restraints of the genre, as with the surreal sequences that evolve around Jenny's pretentious novels. The musical choice is always spot-on. The show is bathed in an atmospheric soundtrack (many remixes of the show's fun and boisterously embarrassing season 2 theme) and, minus that, the ambient noise of passing cars and motorcycles on the LA streets. \"L\" washes the audience in atmosphere.\n\nThe first season climaxes in a knock-down brawl between Bette and Tina the likes of which I've never seen. In \"Liberally\" Bette's battle with a fanatical Christian group is brought to a stirring climax. \"Lonliest Number\" takes the show into more surreal territory. The show's best moments are when it lightens up and just lets the characters have fun together. In \"Let's Do It\" the gang set up a sting to see if Dana's crush is on their team. \"Looking Back\" finds them on a trip to the Dina Shore Invitational and recounting \"coming out stories\". At the end of the day the show is elevated on the backs of the cast, their chemistry, and the honest crafting of these characters. \n\n\"L Word\" could have coasted by on a lesbian theme, but it doesn't settle for doing anything easy and becomes so much more. After the 3rd season the quality goes downhill, stories are recycled, ending in a scattershot final season and one of the most ridiculous, mis-calculated messes of a series finale I've ever witnessed. Still, I'm the exact opposite of the demographic this narrow-cast series is going for and I can't get enough. The mark left by a great series is one that creates a world that you would want to live in, and \"L\" puts you right in its universe. \"The L Word\" is a soulful, addictive thing of beauty - often surreal, at times maddening - and a remarkable pure character drama.\n\n* * * * / 5"}, "trailer": {"@type": "VideoObject", "name": "The L Word", "embedUrl": "/video/imdb/vi162839833", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BOGY5NTlmODQtZDAxNC00ZjJmLTk5OWYtYzM2YzNkZTU2OTA2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOGY5NTlmODQtZDAxNC00ZjJmLTk5OWYtYzM2YzNkZTU2OTA2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "The L Word", "uploadDate": "2019-03-15T00:24:54Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000884/?ref_=tt_cl_t1", "name": "Jennifer Beals"}, "character_and_episodes": [{"url": "/title/tt0330251/characters/nm0000884?ref_=tt_cl_t1", "name": "Bette Porter"}, {"url": "#", "name": "70 episodes, 2004-2009"}]}, {"actor": {"@type": "Person", "url": "/name/nm0391274/?ref_=tt_cl_t3", "name": "Laurel Holloman"}, "character_and_episodes": [{"url": "/title/tt0330251/characters/nm0391274?ref_=tt_cl_t3", "name": "Tina Kennard"}, {"url": "#", "name": "70 episodes, 2004-2009"}]}, {"actor": {"@type": "Person", "url": "/name/nm0595485/?ref_=tt_cl_t5", "name": "Katherine Moennig"}, "character_and_episodes": [{"url": "/title/tt0330251/characters/nm0595485?ref_=tt_cl_t5", "name": "Shane McCutcheon"}, {"url": "#", "name": "70 episodes, 2004-2009"}]}, {"actor": {"@type": "Person", "url": "/name/nm0791226/?ref_=tt_cl_t7", "name": "Rachel Shelley"}, "character_and_episodes": [{"url": "/title/tt0330251/characters/nm0791226?ref_=tt_cl_t7", "name": "Helena Peabody"}, {"url": "#", "name": "54 episodes, 2005-2009"}]}, {"actor": {"@type": "Person", "url": "/name/nm0006439/?ref_=tt_cl_t9", "name": "Erin Daniels"}, "character_and_episodes": [{"url": "/title/tt0330251/characters/nm0006439?ref_=tt_cl_t9", "name": "Dana Fairbanks"}, {"url": "#", "name": "39 episodes, 2004-2007"}]}, {"actor": {"@type": "Person", "url": "/name/nm0354157/?ref_=tt_cl_t2", "name": "Leisha Hailey"}, "character_and_episodes": [{"url": "/title/tt0330251/characters/nm0354157?ref_=tt_cl_t2", "name": "Alice Pieszecki"}, {"url": "#", "name": "70 episodes, 2004-2009"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000477/?ref_=tt_cl_t4", "name": "Mia Kirshner"}, "character_and_episodes": [{"url": "/title/tt0330251/characters/nm0000477?ref_=tt_cl_t4", "name": "Jenny Schecter"}, {"url": "#", "name": "70 episodes, 2004-2009"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000427/?ref_=tt_cl_t6", "name": "Pam Grier"}, "character_and_episodes": [{"url": "/title/tt0330251/characters/nm0000427?ref_=tt_cl_t6", "name": "Kit Porter"}, {"url": "#", "name": "70 episodes, 2004-2009"}]}, {"actor": {"@type": "Person", "url": "/name/nm2121084/?ref_=tt_cl_t8", "name": "Daniela Sea"}, "character_and_episodes": [{"url": "/title/tt0330251/characters/nm2121084?ref_=tt_cl_t8", "name": "Max Sweeney"}, {"url": "#", "name": "44 episodes, 2006-2009"}]}, {"actor": {"@type": "Person", "url": "/name/nm0559144/?ref_=tt_cl_t10", "name": "Marlee Matlin"}, "character_and_episodes": [{"url": "/title/tt0330251/characters/nm0559144?ref_=tt_cl_t10", "name": "Jodi Lerner"}, {"url": "#", "name": "29 episodes, 2007-2009"}]}]}