{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0048028/", "name": "East of Eden", "image": "https://m.media-amazon.com/images/M/MV5BMzE1MzdjNmUtOWU5MS00OTgwLWIzYjYtYTYwYTM0NDkyOTU1XkEyXkFqcGdeQXVyMTY5Nzc4MDY@._V1_.jpg", "genre": "Drama", "contentRating": "PG", "actor": [{"@type": "Person", "url": "/name/nm0000015/", "name": "James Dean"}, {"@type": "Person", "url": "/name/nm0557339/", "name": "Raymond Massey"}, {"@type": "Person", "url": "/name/nm0364915/", "name": "Julie Harris"}, {"@type": "Person", "url": "/name/nm0412322/", "name": "Burl Ives"}], "director": {"@type": "Person", "url": "/name/nm0001415/", "name": "Elia Kazan"}, "creator": [{"@type": "Person", "url": "/name/nm0825705/", "name": "John Steinbeck"}, {"@type": "Person", "url": "/name/nm0651585/", "name": "Paul Osborn"}, {"@type": "Organization", "url": "/company/co0002663/"}], "description": "East of Eden is a movie starring James Dean, Raymond Massey, and Julie Harris. Two brothers struggle to maintain their strict, Bible-toting father's favor.", "datePublished": "1955-04-10", "keywords": "love triangle,brother versus brother,salinas california,abandoned by mother,jealousy", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 40703, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.9"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0048028/"}, "author": {"@type": "Person", "name": "aimless-46"}, "dateCreated": "2006-11-17", "inLanguage": "English", "name": "Dean's Best Performance-An Outstanding Film", "reviewBody": "If you have ever come out on the short end of a sibling rivalry and/or felt seriously wronged by a parent(s), you will probably connect nicely with \"East of Eden\" (1955). Since the majority of viewers meet these criteria it is easy to see why the film finds a new audience with each generation. And it is easy to understand the tears that are often shed by both first-time and repeat viewers.\n\nAlthough set at the start of World War I, the generational issues portrayed really had came to a head by the mid-1950's. Which is why the film was so timely and contemporary when it was released. It was Elia Kazan's troubled relationship with his own father that first attracted him to Steinbeck's novel and caused him to focus the film on the portion of the story that addressed this issue. \n\nOriginally I ranked it a distant third in the James Dean film pecking order but over the years it has somehow passed \"Giant\" and \"Rebel Without a Cause\" IMHO, and I now find it to be clearly his best and more enduring work. It is a real actors/director's film, with just six significant characters and with especially good performances from Dean and from Julie Harris. Both were a bit old for their parts but Dean's boyish manner allowed him to sell the character and Harris (who had convincingly played a twelve year old just a few years earlier in \"Member of the Wedding\") looks the proper age in every scene except one (an outdoor scene shot in the bright sun). She struggles sometimes with reining in her sophistication but that could just be the subjective perception of this viewer. \n\nHere are some random points to appreciate in this great film:\n\nDon't misinterpret Cal's (Dean) motivation, he is not doing things to win his father's love but because he loves his father (communicated by the early scene where he watches his father working in the kitchen). The former motivation would be simplistic; the latter opens up a host of interesting and ironic interpretations as you realize the seemingly bad son Cal actually understands his father and admires his goodness more than \"good\" son Aron (Richard Davalos).\n\nAron is not really the innocent figure he appears to be, he does not like Cal and throughout the film betrays him.\n\nAbra (Harris) is caught between the two brothers, moving steadily from Aron to Cal as the film progresses. Aron represents everything she understands that she should be and Cal represents everything she has been denying herself. The story is largely seen from her point of view, and her growth parallels her (and the audiences) slow realization that Cal is not bad but misunderstood. The two are slowly falling in love but do not kiss until she gets up in the ferris wheel, a place where (symbolically) she is no longer standing on solid practical ground.\n\nIt is really a coming of age story for both of them, with Abra slowly embracing new areas of human experience and Cal moving from adolescence to manhood; thanks largely to her timely interventions. Watch for subtle details that Kazan has included, like Cal's inability to make extended eye contact with his father, brother, and mother; something that he has no problem doing with Abra. And Cal's unsteady progress as he moves forward momentarily and then retreats by looking away.\n\nNote Kazan's use of a raked camera angle for the scenes inside the Trask home, unfortunately this device is a little too extreme and calls attention to itself. Also used in \"The Third Man\", it was done here to reinforce the off-kilter nature of this family's dynamic. It goes away after the scene in which Cal finally confronts his lifelong jealousy of his brother and accuses his father of rejecting him because he is so much like his mother, telling Adam (Raymond Massey) that he cannot forgive himself for having married Kate. This is the point at which Cal moves forward into permanent manhood, prior to this he had stepped forward briefly and then retreated back into childhood.\n\nWatch for the method-acting device of an actor playing with an object as a means to introduce naturalism into the scene (Abra first flirts with Cal with a flower, Jo Van Fleet makes a show of taking out and lighting a cigarette, Cal repeatedly dips his finger into a wine glass). \"East of Eden\" would be nothing but an overwrought melodrama without a host of little things like this that humanize the story.\n\nWatch for the awkward tension in all the scenes between Cal and Adam, Kazan cultivated the off-screen friction between Dean and Massey; reasoning that it would translate into more realistic on-screen sequences between the two actors. \n\nWatch for the stunning sequence late in the film when Cal slowly moves out from under the tree branches (his menace reinforced nicely by the score).\n\nFinally note the contrast between the restrained closing scene (which is also the climax) and the melodramatic style of the almost everything that has preceded it in the film. \n\nThen again, what do I know? I'm only a child.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT1H58M", "trailer": {"@type": "VideoObject", "name": "East of Eden", "embedUrl": "/video/imdb/vi1688469785", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BN2ZkZDM0MmQtMzRlYy00ZTI4LWI2MDUtMGI2ZmYxNTMzNzI1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BN2ZkZDM0MmQtMzRlYy00ZTI4LWI2MDUtMGI2ZmYxNTMzNzI1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Trailer for East Of Eden", "uploadDate": "2008-04-11T13:58:35Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0364915/?ref_=tt_cl_t1", "name": "Julie Harris"}, "character_and_episodes": [{"url": "/title/tt0048028/characters/nm0364915?ref_=tt_cl_t1", "name": "Abra"}]}, {"actor": {"@type": "Person", "url": "/name/nm0557339/?ref_=tt_cl_t3", "name": "Raymond Massey"}, "character_and_episodes": [{"url": "/title/tt0048028/characters/nm0557339?ref_=tt_cl_t3", "name": "Adam Trask"}]}, {"actor": {"@type": "Person", "url": "/name/nm0202501/?ref_=tt_cl_t5", "name": "Richard Davalos"}, "character_and_episodes": [{"url": "/title/tt0048028/characters/nm0202501?ref_=tt_cl_t5", "name": "Aron Trask"}]}, {"actor": {"@type": "Person", "url": "/name/nm0215260/?ref_=tt_cl_t7", "name": "Albert Dekker"}, "character_and_episodes": [{"url": "/title/tt0048028/characters/nm0215260?ref_=tt_cl_t7", "name": "Will Hamilton"}]}, {"actor": {"@type": "Person", "url": "/name/nm0330241/?ref_=tt_cl_t9", "name": "Harold Gordon"}, "character_and_episodes": [{"url": "/title/tt0048028/characters/nm0330241?ref_=tt_cl_t9", "name": "Gustav Albrecht"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000015/?ref_=tt_cl_t2", "name": "James Dean"}, "character_and_episodes": [{"url": "/title/tt0048028/characters/nm0000015?ref_=tt_cl_t2", "name": "Cal Trask"}]}, {"actor": {"@type": "Person", "url": "/name/nm0412322/?ref_=tt_cl_t4", "name": "Burl Ives"}, "character_and_episodes": [{"url": "/title/tt0048028/characters/nm0412322?ref_=tt_cl_t4", "name": "Sam - the Sheriff"}]}, {"actor": {"@type": "Person", "url": "/name/nm0886888/?ref_=tt_cl_t6", "name": "Jo Van Fleet"}, "character_and_episodes": [{"url": "/title/tt0048028/characters/nm0886888?ref_=tt_cl_t6", "name": "Kate"}]}, {"actor": {"@type": "Person", "url": "/name/nm0809135/?ref_=tt_cl_t8", "name": "Lois Smith"}, "character_and_episodes": [{"url": "/title/tt0048028/characters/nm0809135?ref_=tt_cl_t8", "name": "Anne"}]}, {"actor": {"@type": "Person", "url": "/name/nm0219528/?ref_=tt_cl_t10", "name": "Nick Dennis"}, "character_and_episodes": [{"url": "/title/tt0048028/characters/nm0219528?ref_=tt_cl_t10", "name": "Rantani"}]}]}