{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0088527/", "name": "Growing Pains", "image": "https://m.media-amazon.com/images/M/MV5BYjhiNDNkNTAtNTE4Yi00YWQ0LTlhMzItMThiYjNjMmFkZWIxXkEyXkFqcGdeQXVyMjExMjk0ODk@._V1_.jpg", "genre": ["Comedy", "Family"], "contentRating": "TV-G", "actor": [{"@type": "Person", "url": "/name/nm0005484/", "name": "Alan Thicke"}, {"@type": "Person", "url": "/name/nm0005088/", "name": "Joanna Kerns"}, {"@type": "Person", "url": "/name/nm0131647/", "name": "Kirk Cameron"}, {"@type": "Person", "url": "/name/nm0588595/", "name": "Jeremy Miller"}], "creator": [{"@type": "Person", "url": "/name/nm0549107/", "name": "Neal Marlens"}, {"@type": "Organization", "url": "/company/co0186467/"}, {"@type": "Organization", "url": "/company/co0005035/"}], "description": "Growing Pains is a TV series starring Alan Thicke, Joanna Kerns, and Kirk Cameron. The misadventures of a family with a home business father and a journalist mother.", "datePublished": "1985-09-24", "keywords": "long island,new york,two word title,father daughter relationship,father son relationship", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 13631, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0088527/"}, "author": {"@type": "Person", "name": "steve-575"}, "dateCreated": "2003-09-07", "inLanguage": "English", "name": "A solid, family sitcom that has faded with time", "reviewBody": "Like many series from the 80s, \"Growing Pain\" was one of those long-running shows that was immensely popular at the time but has kind of fizzled out 25 years later. It is rarely seen in syndication and has only released two seasons on DVD. \n\nThe show originally centered around upper class parents Maggie and Jason Seaver and their pains raising three kids: Mike, Carol, and Ben. The show had the unenviable task of being aired at around the same time as two highly-rated and similar-themed family sitcoms: \"Family Ties\" and \"The Cosby Show\". While it was never as critically acclaimed as \"Family Ties\" nor as groundbreaking as \"The Cosby Show\", \"Growing Pains\" built up a loyal fan following that allowed it to run for 7 seasons.\n\nIn some ways, the show was both exactly similar and exactly opposite to \"Family Ties\". Maggie and Jason were similar to Steven and Elyse in their methods of parenting. Like the Keatons, they grew up in the 60s and had mellowed with the advent of a family. Their eldest, Mike, was basically the anti-Alex Keaton. While Alex was a habitual overachiever, Mike was the chronic underachiever who was always trying to talk his way out of trouble. Carol was the anti-Mallory Keaton. While Mallory was shallow, ditzy and popular, Carol was brainy, deep and struggled to fit in. Ben was similar to Jennifer Keaton. He was cute as a youngster but as he got older, he never really did anything to stand out. He wasn't as outgoing and charming as Mike and wasn't as smart as Carol. The similarities don't end there. Both shows added babies late in their runs and both babies mysteriously aged like 3 years during the summer hiatuses. Both Mike and Alex had strange best friends with weird names (Boner and Skippy). Both Carol and Mallory had weird, spacey boyfriends (Dwight and Nick). Both shows started with the parents being the focus and then shifted to the children with Michael J. Fox and Kirk Cameron becoming the faces of their respective shows. \n\nAs the shows ratings began to fall, the producers began to bring new characters to try and breathe new life into the show. Maggie gave birth to Chrissy in the third season. Between seasons 5 and 6, she showed \"remarkable maturity\". They also brought in Luke (Leonardo DiCaprio) as a homeless kid that the Seavers adopt for a season and Dwight as Carol's weirdo boyfriend.\n\nIn the later years, the show lost some of the dynamics that made it a top-rated sitcom but was still very entertaining nonetheless. The ongoing conflict between Mike and his parents had run its course. Mike had gone from being an irresponsible teen to a very responsible adult who was in charge of Luke. Carol was seen less during the final season as Tracy Gold had temporarily left the show. The producers had almost tried too hard to make Ben into a younger version of Mike. I think they eventually realized that it was not working and brought in Luke.\n\nWhile the show dealt with many serious subjects, it never really took itself too seriously and found different ways to be creative. There was a show where Ben dreams that he was actually Jeremy Miller (the actor who played him) and everyone began to act as if they were not their respective characters but the actors playing them who were part of a show called \"Meet The Seavers\". There were also several variations on the opening song. On one episode, Mike was in an acting class where they reenacted the opening song. On another episode, Maggie went into labor at the end of the opening credits.\n\nWhile this show has lost steam since it went off the air in 1992, it was one of the last truly traditional family sitcoms to grace the airwaves. With most sitcoms today being adult-themed, it is refreshing to go back in time and watch a well-meaning family show like \"Growing Pains\"."}, "trailer": {"@type": "VideoObject", "name": "Trailer", "embedUrl": "/video/imdb/vi2224472345", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BODVjOTY3MjEtMjQ5Yi00ODgwLTg4NzAtODBkZTRkM2I1YTY4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BODVjOTY3MjEtMjQ5Yi00ODgwLTg4NzAtODBkZTRkM2I1YTY4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "uploadDate": "2020-09-29T19:50:09Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0005484/?ref_=tt_cl_t1", "name": "Alan Thicke"}, "character_and_episodes": [{"url": "/title/tt0088527/characters/nm0005484?ref_=tt_cl_t1", "name": "Dr. Jason Seaver"}, {"url": "#", "name": "167 episodes, 1985-1992"}]}, {"actor": {"@type": "Person", "url": "/name/nm0131647/?ref_=tt_cl_t3", "name": "Kirk Cameron"}, "character_and_episodes": [{"url": "/title/tt0088527/characters/nm0131647?ref_=tt_cl_t3", "name": "Mike Seaver"}, {"url": "#", "name": "167 episodes, 1985-1992"}]}, {"actor": {"@type": "Person", "url": "/name/nm0325097/?ref_=tt_cl_t5", "name": "Tracey Gold"}, "character_and_episodes": [{"url": "/title/tt0088527/characters/nm0325097?ref_=tt_cl_t5", "name": "Carol Seaver"}, {"url": "#", "name": "166 episodes, 1985-1992"}]}, {"actor": {"@type": "Person", "url": "/name/nm0005088/?ref_=tt_cl_t2", "name": "Joanna Kerns"}, "character_and_episodes": [{"url": "/title/tt0088527/characters/nm0005088?ref_=tt_cl_t2", "name": "Maggie Malone Seaver"}, {"url": "#", "name": "167 episodes, 1985-1992"}]}, {"actor": {"@type": "Person", "url": "/name/nm0588595/?ref_=tt_cl_t4", "name": "Jeremy Miller"}, "character_and_episodes": [{"url": "/title/tt0088527/characters/nm0588595?ref_=tt_cl_t4", "name": "Ben Seaver"}, {"url": "#", "name": "167 episodes, 1985-1992"}]}]}