{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0113189/", "name": "GoldenEye", "image": "https://m.media-amazon.com/images/M/MV5BMzk2OTg4MTk1NF5BMl5BanBnXkFtZTcwNjExNTgzNA@@._V1_.jpg", "genre": ["Action", "Adventure", "Thriller"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0000112/", "name": "Pierce Brosnan"}, {"@type": "Person", "url": "/name/nm0000293/", "name": "Sean Bean"}, {"@type": "Person", "url": "/name/nm0001713/", "name": "Izabella Scorupco"}, {"@type": "Person", "url": "/name/nm0000463/", "name": "Famke Janssen"}], "director": {"@type": "Person", "url": "/name/nm0132709/", "name": "Martin Campbell"}, "creator": [{"@type": "Person", "url": "/name/nm0001220/", "name": "Ian Fleming"}, {"@type": "Person", "url": "/name/nm0289833/", "name": "Michael France"}, {"@type": "Person", "url": "/name/nm0128997/", "name": "Jeffrey Caine"}, {"@type": "Person", "url": "/name/nm0270761/", "name": "Bruce Feirstein"}, {"@type": "Organization", "url": "/company/co0054040/"}, {"@type": "Organization", "url": "/company/co0026841/"}], "description": "GoldenEye is a movie starring Pierce Brosnan, Sean Bean, and Izabella Scorupco. Years after a friend and fellow 00 agent is killed on a joint mission, a secret space based weapons program known as \"GoldenEye\" is stolen. James Bond...", "datePublished": "1995-11-16", "keywords": "official james bond series,james bond character,evil woman,007,chemical weapons", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 240134, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0113189/"}, "author": {"@type": "Person", "name": "TimBoHannon"}, "dateCreated": "2004-08-13", "inLanguage": "English", "name": "Brosnan helps resurrect Bond in an \"A\" effort", "reviewBody": "Much had changed for James Bond since Sean Connery first took the role in 1962. The series had taken a turn for the worse in the seventies, when five films were made but zero good ones were. Still, the public was willing to grant Bond limitless amnesty that decade, even as his escapades grew less and less exciting and more and more campy with each new film. The 70s came and went, ushering in the 80s, which kicked off well with 1981's \"For Your Eyes Only.\" However, it went all downhill from there as the public finally stopped tolerating the bad movies and his popularity tanked in favor of superior competition. Bruce Willis and Arnold Schwarzenegger became mega stars during that time, and the emergence Indiana Jones was making Bond look dull and decrepit by comparison. Tim Burton's summer sweep of the cinemas with \"Batman\" in 1989 exacerbated Bond's woes, and when legal disputes arose between the production company and the studio shortly thereafter, it appeared that Bond had finally died his horrible but well deserved death.\n\nWhen the legal issues were finally put to rest in 1994, it was announced that another Bond film was going to be made, but not with erstwhile incumbent Timothy Dalton. Pierce Brosnan was given the role after being forced to reject it in the late eighties, and production began. The success of the film was crucial. If it lacked spark or came across as campy, it was likely that Bond would be finished forever. With the stakes in mind, the Broccoli family (the Bond producers) hired an all-new creative team and set to work re-establishing 007 in a new era.\n\nI knew none of that when I first saw the film in 1999. It was my introduction to the world of James Bond, and was a truly an exceptional first handshake. Knowing what I know now, and seeing the Bond films I have seen now, I still find it as worthwhile as I did then, and I am forever thankful that it was made well enough to not only resuscitate Bond, but propel him into the nineties with the momentum of a blazing fastball.\n\nThe film opens in the eighties, ironically, with a scene depicting the Bond and Agent 006, real name Alec Trevelyan, being detected inside a Soviet chemical weapons factory. This section also introduces the character of Ourumov (Gottfried John), who murders Alec seemingly on a whim.\n\nNine years later, Bond meets an appealing young lady (Famke Janssen) while driving...make that playfully racing, near Monte Carlo. Suspicious, he follows her to a nearby casino where he finds out that her name is Xenia Onatopp and she carries ties to the Janus crime syndicate in St. Petersburg. He chases Xenia when he suspects an imminent crime, but is not in time to avert her theft of the Tiger--a helicopter that is hardened to all forms of electronic interference.\n\nBack at MI-6 headquarters, the Tiger is spotted via satellite at Russian satellite control facility, and it soon becomes obvious that the copter is merely part of a grander scheme to steal a scary satellite weapon called GoldenEye. What it does can be described with words, but not with as much clarity as seeing it in the movie (there are lapses in the visuals here, but the sight is so impressive that they hardly matter). Bond then departs for St. Petersburg to find the Janus head man (Sean Bean) and stop him from using GoldenEye on a more vulnerable target. Much mystery surrounds the identity of Janus, but it is in the trailer and I suspect most people know it by now.\n\nThere are several reasons that \"GoldenEye\" is the best Bond film made in many, many years. The first is the tone, which has ushered out all of the giddy goofiness of Roger Moore's films and assumed one reminiscent of the earliest Bond films. The sets, the camera work and the dialogue all come across as subtle, subconscious reminders of why Bond became so beloved to begin with.\n\nI always felt there were two major problems with the Bonds of the seventies and eighties. The first is the inane tone (exception: \"For Your Eyes Only,\"), a point I am driving into the ground. With the same exception, they also featured uniformly unexciting (read it: bad) action plus horrendous acting. There are light moments in \"GoldenEye,\" as there should be, but the correct tone is never compromised. \n\nThe only problem is that there is a little too much padding in the middle. The story is well told, although there is a meeting with Bond and Valentin Zukovsky (reprised by Robbie Coltrane in \"The World is Not Enough\") that has no significance to the advancement of the story. It is unnecessary and causes the film to drag some. After Bond meets Janus, though, prepare for the film to take off, as there will be little rest from there on out.\n\nJust like in the early Bonds, the acting transcends the genre. Pierce Brosnan is the clear focal point, and is mostly successful. He seems too reserved at times, as if he is a little timid at acting his best for fear it might look bad. He does not lack charm, though, because there is something about Pierce that makes him the ultimate ladies man on screen and off.\n\n More successful is Sean Bean as James's opponent. Bean brings cold, subtle intensity to the role that shows off the acting skills that got him cast in \"The Fellowship of the Ring.\" General Ourumov, who is in bed with Janus, provides a second bad guy. Gottfried John portrays him as a demonstrative brute, and his style provides a fine foil to Bean's controlled anger. Alan Cumming plays an evil computer nerd who provides most the light moments I referred to earlier. Fellow X-Man Famke Janssen's character is downright demented, and will not be forgotten easily.\n\nMy friends, I have just explained why \"GoldenEye\" is a most superior Bond film that brought Agent 007 back from the dead and won over a new generation of fans. The best way I can think of to conclude this review is to comment on the film's conclusion. At one point it involves a brawl between Bond and Janus (who is referred to by his real name by that time) that buries just about every other one in the series. While it does quite not take the gold from the fistfight that opens \"Thunderball,\" is does serve as a final reminder that Bond is indeed back, and that he is once again a force best not ignored.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT2H10M", "trailer": {"@type": "VideoObject", "name": "GoldenEye", "embedUrl": "/video/imdb/vi2674918169", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzM3MmNmZGQtNzUxYi00N2Q5LTg0YmYtY2ZjMWUwMWFlMWI3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzM3MmNmZGQtNzUxYi00N2Q5LTg0YmYtY2ZjMWUwMWFlMWI3XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Theatrical Trailer from MGM/UA", "uploadDate": "2009-03-20T03:44:16Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000112/?ref_=tt_cl_t1", "name": "Pierce Brosnan"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0000112?ref_=tt_cl_t1", "name": "James Bond"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001713/?ref_=tt_cl_t3", "name": "Izabella Scorupco"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0001713?ref_=tt_cl_t3", "name": "Natalya Simonova"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000833/?ref_=tt_cl_t5", "name": "Joe Don Baker"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0000833?ref_=tt_cl_t5", "name": "Jack Wade"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001059/?ref_=tt_cl_t7", "name": "Robbie Coltrane"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0001059?ref_=tt_cl_t7", "name": "Valentin Zukovsky"}]}, {"actor": {"@type": "Person", "url": "/name/nm0424167/?ref_=tt_cl_t9", "name": "Gottfried John"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0424167?ref_=tt_cl_t9", "name": "Colonel Ourumov"}]}, {"actor": {"@type": "Person", "url": "/name/nm0005155/?ref_=tt_cl_t11", "name": "Desmond Llewelyn"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0005155?ref_=tt_cl_t11", "name": "Q"}]}, {"actor": {"@type": "Person", "url": "/name/nm0457655/?ref_=tt_cl_t13", "name": "Michael Kitchen"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0457655?ref_=tt_cl_t13", "name": "Bill Tanner"}]}, {"actor": {"@type": "Person", "url": "/name/nm0475336/?ref_=tt_cl_t15", "name": "Simon Kunz"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0475336?ref_=tt_cl_t15", "name": "Severnaya Duty Officer"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000293/?ref_=tt_cl_t2", "name": "Sean Bean"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0000293?ref_=tt_cl_t2", "name": "Alec Trevelyan"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000463/?ref_=tt_cl_t4", "name": "Famke Janssen"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0000463?ref_=tt_cl_t4", "name": "Xenia Onatopp"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001132/?ref_=tt_cl_t6", "name": "Judi Dench"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0001132?ref_=tt_cl_t6", "name": "M"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001409/?ref_=tt_cl_t8", "name": "Tchéky Karyo"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0001409?ref_=tt_cl_t8", "name": "Dimitri Mishkin"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001086/?ref_=tt_cl_t10", "name": "Alan Cumming"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0001086?ref_=tt_cl_t10", "name": "Boris Grishenko"}]}, {"actor": {"@type": "Person", "url": "/name/nm0094039/?ref_=tt_cl_t12", "name": "Samantha Bond"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0094039?ref_=tt_cl_t12", "name": "Moneypenny"}]}, {"actor": {"@type": "Person", "url": "/name/nm0330601/?ref_=tt_cl_t14", "name": "Serena Gordon"}, "character_and_episodes": [{"url": "/title/tt0113189/characters/nm0330601?ref_=tt_cl_t14", "name": "Caroline"}]}]}