{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0317919/", "name": "Mission: Impossible III", "image": "https://m.media-amazon.com/images/M/MV5BOThhNTA1YjItYzk2Ny00M2Y1LWJlYWUtZDQyZDU0YmY5Y2M5XkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg", "genre": ["Action", "Adventure", "Thriller"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0000129/", "name": "Tom Cruise"}, {"@type": "Person", "url": "/name/nm1157358/", "name": "Michelle Monaghan"}, {"@type": "Person", "url": "/name/nm0000609/", "name": "Ving Rhames"}, {"@type": "Person", "url": "/name/nm0000450/", "name": "Philip Seymour Hoffman"}], "director": {"@type": "Person", "url": "/name/nm0009190/", "name": "J.J. Abrams"}, "creator": [{"@type": "Person", "url": "/name/nm0476064/", "name": "Alex Kurtzman"}, {"@type": "Person", "url": "/name/nm0649460/", "name": "Roberto Orci"}, {"@type": "Person", "url": "/name/nm0009190/", "name": "J.J. Abrams"}, {"@type": "Person", "url": "/name/nm0312367/", "name": "Bruce Geller"}, {"@type": "Organization", "url": "/company/co0023400/"}, {"@type": "Organization", "url": "/company/co0012382/"}, {"@type": "Organization", "url": "/company/co0178758/"}, {"@type": "Organization", "url": "/company/co0078389/"}, {"@type": "Organization", "url": "/company/co0228509/"}, {"@type": "Organization", "url": "/company/co0049799/"}, {"@type": "Organization", "url": "/company/co0053177/"}, {"@type": "Organization", "url": "/company/co0138901/"}], "description": "Mission: Impossible III is a movie starring Tom Cruise, Michelle Monaghan, and Ving Rhames. IMF agent Ethan Hunt comes into conflict with a dangerous and sadistic arms dealer who threatens his life and his fiancée in response.", "datePublished": "2006-05-03", "keywords": "fictional government agency,ethan hunt character,luther stickell character,tape over mouth,tough woman", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 332275, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.9"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0317919/"}, "author": {"@type": "Person", "name": "fernandoschiavi"}, "dateCreated": "2020-07-19", "inLanguage": "English", "name": "Fast-paced, with eye-popping acrobatics and competent visual effects, this third Mission Impossible offers everything an action fan could ask for", "reviewBody": "Certainly one of the most virtuous modern action franchises, Mission Impossible reaches the third chapter full of expectations. With completely different films in approach, the Mission: Impossible franchise achieved a feat that few works achieve: being captivating and engaging with each new sequel. Which brings us to Mission: Impossible 3, directed by J.J. Abrams, egress from the TV series Alias and Lost, to command his first feature film having to maintain the quality of before and still presents his style in a great blockbuster. Unlike the previous film, which suffered from serious problems of rhythm break and an extremely explanatory script that underestimated the audience's intelligence, this third part has the merit of bringing together the main characteristics of the previous films in a consistent manner. It is true that the script by Alex Kurtzman, Roberto Orci and Abrams himself does not have the same subtlety in the construction of suspense as the original film by Brian De Palma, but again brings the concept of interesting twists, dubious and questionable characters, unexpected betrayals and a more elaborate and intelligent plot. Allied to this, we have breathtaking action scenes, which are among some of the best in the series, managing to further elevate the pyrotechnics and genuine tension of Ethan Hunt's second adventure. De Palma did what he knows best: a game of illusion with what our eyes believe to be the truth. In the second, from 2000, John Woo reproduced the mannerisms that enshrined him in the genre of action: incessant slow motion, drama, duels, pyrotechnics and dance choreography in electrifying action sequences. What kind of subscription does Abrams want for you? A Mission: Impossible to be more human, capable of giving an identity and personality to the range of people who will cross the screen between one explosion and another - even if that human is as fleeting as an exchange of complicit glances before a nitroglycerin capsule implodes the subject's brain.\n\nJ.J. Abrams brings to the center of the protagonist's narrative the woman he loves and for whom he gave up acting in the field - the constant dialogues between Cruise and Rhames about marriage are very revealing about this intention that permeates the entire narrative. Ethan is no longer an impersonal character, with no previous or parallel life - even his parents are mentioned. The agent who needs to save the world leaves, and in his place comes the hero who wants to save his beloved and stay alive in order to be able to return home again. In this way, Ethan Hunt starts the film with a status quo completely different from those presented before, being in a relationship with Julia (Michelle Monaghan) and away from the special operations he previously participated in. Only the news that a former student of his time as a trainer is being held captive by criminals allows this situation to be redefined, taking him to the impossible mission at the time, accompanied by a disposable supporting team, with the exception of Ving Rhames. Therefore, it is clear that the narrative intention is much more focused on an action loaded dramatically than an action loaded with fun - an extremely welcome change in order to renew the franchise's goal with each exploration orchestrated by the creative minds behind from the project. The problem is that, in terms of dramatic potential, development is not the most accurate, even though this change in perspective is interesting. The feature itself begins by showing us an extremely tense moment, putting the villain to directly rival the hero. But what is the use of starting the plot with this fuse, to be fully revealed on the way to the end of the tape, if the emotional involvement, at that moment, is still null? In addition, the whole trajectory becomes extremely predictable, especially because the play plays with the Machiavellian antagonist of the time, played by Phillip Seymour Hoffman, causing the character to threaten people close to Ethan Hunt. We know that there will be a turn of roles, from the character captured to the character he captures. But it doesn't take long to start yet another Mission: Impossible firework show. It would not be a movie in the series without these shows that Cruise always makes a point of doing without the use of any stuntmen. It is an inescapable habit that does not depend on the tastes of the current director. Point for the screenwriters Roberto Orci and Alex Kurtzman, aliases, who are competent to dry the intervals between actions to the maximum, using time ellipses. Abrams' direction delivers ingenious action sequences and brings Mission: Impossible 3 closer to The Bourne Identity (2002), with a lot of handheld camera, close and shaky, transmitting urgency; and the accelerated zoom, coming from far away, in an approximation of the focal point typical of a documentary and television medium - there are many close-ups. The classic theme of the series was orchestrated in a military style by Michael Giacchino and used a few times - but in a surgical way, throughout the plot, further elevating the more frantic scenes.\n\nThe pace only grows over the course of its three major acts. Right from the start, we have the planning and unsuccessful rescue effort of an agent in a kind of abandoned warehouse in Berlin, with sequences of gunfire, explosions and even a helicopter chase in the middle of a wind power generation park. The second act features yet another seemingly impossible mission that is perfectly executed by Ethan Hunt and his team in a spectacular invasion of Rome / Vatican, which begins with a surprising climb, passes through the making of a 3D facial mold of the villain, and his kidnapping that still simulates his death for his potential buyers. Soon after, we still have an action sequence of air rescue in the middle of a bridge in Maryland that is very well choreographed and brings an absurd tension, even more with the events that follow the escape of the villain. The third act, however, leaves nothing to be desired in Shanghai. From a grand entrance to a building to rescue McGuffin from the movie, Rabbit's Foot, to the kidnapping of Ethan and his wife and all the twists and turns filled with tension.\n\nJust as Hunt's human relationships were developed, Mission Impossible 3 has something that only, probably, Mission: Impossible, the original, has: a good villain. Like Owen Davian, Phillip Seymour Hoffman steals the show, developing a very interesting, cynical and really threatening personality. Like the other antagonists in the franchise, the villain this time also interacts with the narrative in a way that is associated with the recurring Macguffin - totally disposable. The difference, however, is exactly the actor, highlighting a casting that distinguishes the mediocre from the competent. At the same time, understanding that the macguffin is expendable, the interest is not in it, but in the dramatic value on the scene - the work does better. No slogans, no taunting the hero, no exaggerating. Hoffman does not repeat the same threat twice. Basically, this is the difference between the two. If the trend was already rooting for the villain, then it gets even easier. Although weakened by the script decisions of the third act, Hoffman's performance manages to hover above everything from the initial moments. Without exaggeration, without raising your voice or shouting, always speaking only when necessary, in a controlled and cold manner, your Owen Davian never repeats a threat - and fulfills all that he does. The sequence on the plane is emblematic: even captured, it is Owen who maintains his calm and arrogance and manages to destabilize Ethan and make him fall into a series of mistakes that will cause the villain to later kidnap his bride.\n\nEven more than before, Tom Cruise runs, runs and runs. And jump and fight - a lot. Always determined, always at a breakneck pace. He manages to take down three officers even though he is tied and gagged on a stretcher inside an elevator; escapes from a police siege, from an attack on a bridge; jumps between skyscrapers. And he always convinces that he would really be able to accomplish all these feats. In the midst of many twists and revelations that are not always really impactful - those involving Billy Crudup and Laurence Fishburne are the ones that work the most - and with the constant use of the franchise's classic gadgets - now we see how silicone masks are made - Mission: Impossible 3 does not raise the bar compared to previous work, but with lots of suspense and adrenaline it is one of the most energetic chapters in the franchise. At a cost of $ 150 million, MI3 features all the usual absurdities of the genre, with mind-blowing action scenes, twists that add to the tension considerably - but not to the point of letting anyone in the audience doubt the hero's efficiency - and the same technical efficiency that has already become standard in Hollywood. Commanding the action safely, JJ Abrams is adept at allowing the viewer to clearly follow what is happening on the screen, speeding events up without sacrificing our understanding - we always know exactly what role each is playing from Ethan's team agents, which makes the missions a lot more interesting. Fast-paced, with eye-popping acrobatics and competent visual effects, this third Mission Impossible offers everything an action fan could ask for.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT2H6M", "trailer": {"@type": "VideoObject", "name": "Mission: Impossible III", "embedUrl": "/video/imdb/vi1587151129", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzBlNGVmZjQtNjMwOC00N2ZiLTllNWUtMWY0MzRlNWVlMjI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzBlNGVmZjQtNjMwOC00N2ZiLTllNWUtMWY0MzRlNWVlMjI5XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Theatrical Trailer from Paramount", "uploadDate": "2008-04-11T15:17:46Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000129/?ref_=tt_cl_t1", "name": "Tom Cruise"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm0000129?ref_=tt_cl_t1", "name": "Ethan Hunt"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000609/?ref_=tt_cl_t3", "name": "Ving Rhames"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm0000609?ref_=tt_cl_t3", "name": "Luther"}]}, {"actor": {"@type": "Person", "url": "/name/nm1157358/?ref_=tt_cl_t5", "name": "Michelle Monaghan"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm1157358?ref_=tt_cl_t5", "name": "Julia"}]}, {"actor": {"@type": "Person", "url": "/name/nm0005392/?ref_=tt_cl_t7", "name": "Keri Russell"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm0005392?ref_=tt_cl_t7", "name": "Lindsey Farris"}]}, {"actor": {"@type": "Person", "url": "/name/nm0670408/?ref_=tt_cl_t9", "name": "Simon Pegg"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm0670408?ref_=tt_cl_t9", "name": "Benji"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000401/?ref_=tt_cl_t11", "name": "Laurence Fishburne"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm0000401?ref_=tt_cl_t11", "name": "Theodore Brassel"}]}, {"actor": {"@type": "Person", "url": "/name/nm0153779/?ref_=tt_cl_t13", "name": "Jeff Chase"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm0153779?ref_=tt_cl_t13", "name": "Davian's Bodyguard"}]}, {"actor": {"@type": "Person", "url": "/name/nm0303013/?ref_=tt_cl_t15", "name": "Carla Gallo"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm0303013?ref_=tt_cl_t15", "name": "Beth"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000450/?ref_=tt_cl_t2", "name": "Philip Seymour Hoffman"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm0000450?ref_=tt_cl_t2", "name": "Owen Davian"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001082/?ref_=tt_cl_t4", "name": "Billy Crudup"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm0001082?ref_=tt_cl_t4", "name": "Musgrave"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001667/?ref_=tt_cl_t6", "name": "Jonathan Rhys Meyers"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm0001667?ref_=tt_cl_t6", "name": "Declan"}]}, {"actor": {"@type": "Person", "url": "/name/nm0702572/?ref_=tt_cl_t8", "name": "Maggie Q"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm0702572?ref_=tt_cl_t8", "name": "Zhen"}]}, {"actor": {"@type": "Person", "url": "/name/nm0550371/?ref_=tt_cl_t10", "name": "Eddie Marsan"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm0550371?ref_=tt_cl_t10", "name": "Brownway"}]}, {"actor": {"@type": "Person", "url": "/name/nm1587232/?ref_=tt_cl_t12", "name": "Bahar Soomekh"}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm1587232?ref_=tt_cl_t12", "name": "Davian's Translator"}]}, {"actor": {"@type": "Person", "url": "/name/nm1400913/?ref_=tt_cl_t14", "name": "Michael Berry Jr."}, "character_and_episodes": [{"url": "/title/tt0317919/characters/nm1400913?ref_=tt_cl_t14", "name": "Julia's Kidnapper"}]}]}