{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1000774/", "name": "Sex and the City", "image": "https://m.media-amazon.com/images/M/MV5BMTYyMzYxMjM3OF5BMl5BanBnXkFtZTcwNjg2OTA3MQ@@._V1_.jpg", "genre": ["Comedy", "Drama", "Romance"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000572/", "name": "Sarah Jessica Parker"}, {"@type": "Person", "url": "/name/nm0000326/", "name": "Kim Cattrall"}, {"@type": "Person", "url": "/name/nm0633223/", "name": "Cynthia Nixon"}, {"@type": "Person", "url": "/name/nm0004862/", "name": "Kristin Davis"}], "director": {"@type": "Person", "url": "/name/nm0455078/", "name": "Michael Patrick King"}, "creator": [{"@type": "Person", "url": "/name/nm0455078/", "name": "Michael Patrick King"}, {"@type": "Person", "url": "/name/nm0124299/", "name": "Candace Bushnell"}, {"@type": "Person", "url": "/name/nm0823015/", "name": "Darren Star"}, {"@type": "Organization", "url": "/company/co0046718/"}, {"@type": "Organization", "url": "/company/co0008693/"}, {"@type": "Organization", "url": "/company/co0020963/"}], "description": "Sex and the City is a movie starring Sarah Jessica Parker, Kim Cattrall, and Cynthia Nixon. A New York City writer on sex and love is finally getting married to her Mr. Big. But her three best girlfriends must console her after one...", "datePublished": "2008-05-28", "keywords": "sequel to tv series,wedding dress,overreaction,2000s,coitus", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 116575, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1000774/"}, "author": {"@type": "Person", "name": "Chris_Docker"}, "dateCreated": "2008-05-30", "inLanguage": "English", "name": "Vuitton and the vixens", "reviewBody": "Girls love sex - especially when it comes packaged as, \"big love of one's life.\" Who wouldn't? And 'The City' has nothing to do with stockbrokers. It's bright lights. Excitement. The girls' nights out. Successful, independent women. Expensive shoes. Designer label. Labels and love - the two big \"l's\". Big Apple. New York. City of Dreams. So is Sex and the City, the film version of an award-winning TV show, every girl's dream movie? The film \u0096 a short two and a half hours \u0096 successfully reprises the TV show format. A decade on in the lives of our characters and we follow them for another eventful year. Carrie now a successful book author - and sometimes contributor to Vogue. Says Kim Catrall (who plays Carrie's friend Samantha), \"It was about women joining together as the new family, girlfriends sticking together through thick and thin.\" As a girl-bonding movie, it certainly works. On the way home, several hundred dresses to discuss, Manolo strappy sandals, and moral dilemmas like, if you have a secret that would hurt your best friend to know, should you 'fess up? Says, writer-producer-director Michael Patrick King, \"Miranda's the sarcastic, sort of angry, one. Charlotte's the sweeter, sort of preppy one, the more traditional one. Samantha's the sexy, sort of power-hungry one. And then, there's Carrie, the indefinable one.\" Their TV personas are already developed and, unlike many TV-shows-made-into-movies, Sex and the City doesn't try to go overboard but develops existing characters and situations.\n\nAlthough everything in the film is well-signposted, I don't want to give anything away. As with genre films, it's the small variations of plot that make it satisfying. A couple of scenes stand out for me. One is where Samantha covers her naked body with hand-made sushi as a Valentine's gift. Beautifully shot, it illustrates her outrageous sexual appetite in a moment that is genuinely artistic and more memorable than a bedroom full of dildos wrapped in cling-film. More clichéd, is the man next door having a slow-motion outdoor shower, but even that didn't seem out of place given Samantha's showy temperament and transfixed gaze.\n\nThe plot development where Miranda makes an unguarded comment which she is afraid to tell Carrie is well-handled. The restaurant scene where Miranda finally screws up the courage is believable and dramatic while still retaining its humour.\n\nBut I felt it would be unfair to review this film from a male-only point of view, so duly took my partner along. I tried to set the mood with Shiraz and Spanish tapas, casually asking what she thought of the TV series. \"It's the ultimate sell-out!\" she says. I was taken aback. I thought it was about strong, liberated women of today? \"Yes, but their lives revolve around getting a man.\" Seen from that perspective, it is hardly the feminist frolic of fashion and feisty friendship. And of course, our whole film is obsessed with the idea of marriage. In a neat tables-turn \u0096 what Scarlett O'Hara might call giving men some of their own medicine \u0096 men are casually dehumanised. Either as sex-objects (for Samantha), or as provider (for Carrie, remarkably). The other two males (those stabled by Miranda and Charlotte) are insignificant and weak. Carrie's man is famously not given a name (recall how Célestine was reduced to an object in Buñuel's Diary of a Chambermaid by the old man who simply called her 'what he called all the maids'). Carrie is a successful author yet, when contemplating a new flat with her man, she lets him pick up the bill, \"like he was picking up the check for coffee.\" The romantic dénouement is based on what would, without the happy Hollywood coincidences, be deemed stalking in real life.\n\nThe best part for me was seeing Jennifer Hudson, who plays Carrie's assistant Louise. Hudson also contributes a fine song for the film which adequately expresses the theme of, \"Good men are like designer labels and it's hard to spot the knock-offs.\" Hudson is a fine actress in her own right, not just a one hit wonder who got an Oscar for Dreamgirls after failing to win American Idol. She exudes screen charisma. Every expression, every intonation, was a joy to behold. Although the clip from Meet Me in St Louis rather reminded me of what a really good movie looks like, Sex and the City, however enjoyable, isn't one. It's a remarkably pleasant way of spending two and a half hours, but the performances are largely pedestrian. Unlike Devil Wears Prada, it's about labels, not an appreciation of the design behind them. By being successfully chic and delightfully superficial, the characters distract us from the wedding bells goal and the way their lives really stereotype them. We never learn much about their work, or about them as people independent of a man's penis. It provides the dual fantasy of apparently liberated woman while retaining the old penchant for ball and chain.\n\n\"I want people leaving the movie theater feeling, 'all right, great, that was a lot!'\" King says. \"That was drinks, appetizer, main course, and dessert, dessert, dessert!\" And, like most desserts, Sex and the City is ninety per cent sugar.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "5"}}, "duration": "PT2H25M", "trailer": {"@type": "VideoObject", "name": "Sex and the City - Miranda: Where We Left Off", "embedUrl": "/video/imdb/vi1977811225", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjI2NDcxNjc1OF5BMl5BanBnXkFtZTgwMDk4NTIyMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjI2NDcxNjc1OF5BMl5BanBnXkFtZTgwMDk4NTIyMzE@._V1_.jpg", "description": "Before you see the movie, catch up with your favorite characters from the hit HBO show. In this clip, find out \"Where We Left Off\" with Miranda Hobbes, played by Cynthia Nixon.", "uploadDate": "2008-04-29T08:26:25Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000572/?ref_=tt_cl_t1", "name": "Sarah Jessica Parker"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0000572?ref_=tt_cl_t1", "name": "Carrie Bradshaw"}]}, {"actor": {"@type": "Person", "url": "/name/nm0004862/?ref_=tt_cl_t3", "name": "Kristin Davis"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0004862?ref_=tt_cl_t3", "name": "Charlotte York"}]}, {"actor": {"@type": "Person", "url": "/name/nm0636562/?ref_=tt_cl_t5", "name": "Chris Noth"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0636562?ref_=tt_cl_t5", "name": "Mr. Big"}]}, {"actor": {"@type": "Person", "url": "/name/nm1617685/?ref_=tt_cl_t7", "name": "Jennifer Hudson"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm1617685?ref_=tt_cl_t7", "name": "Louise"}]}, {"actor": {"@type": "Person", "url": "/name/nm0359577/?ref_=tt_cl_t9", "name": "Evan Handler"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0359577?ref_=tt_cl_t9", "name": "Harry Goldenblatt"}]}, {"actor": {"@type": "Person", "url": "/name/nm0134647/?ref_=tt_cl_t11", "name": "Mario Cantone"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0134647?ref_=tt_cl_t11", "name": "Anthony Marentino"}]}, {"actor": {"@type": "Person", "url": "/name/nm0308606/?ref_=tt_cl_t13", "name": "Willie Garson"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0308606?ref_=tt_cl_t13", "name": "Stanford Blatch"}]}, {"actor": {"@type": "Person", "url": "/name/nm3001482/?ref_=tt_cl_t15", "name": "Joseph Pupo"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm3001482?ref_=tt_cl_t15", "name": "Brady Hobbes"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000326/?ref_=tt_cl_t2", "name": "Kim Cattrall"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0000326?ref_=tt_cl_t2", "name": "Samantha Jones"}]}, {"actor": {"@type": "Person", "url": "/name/nm0633223/?ref_=tt_cl_t4", "name": "Cynthia Nixon"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0633223?ref_=tt_cl_t4", "name": "Miranda Hobbes"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000298/?ref_=tt_cl_t6", "name": "Candice Bergen"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0000298?ref_=tt_cl_t6", "name": "Enid Frick"}]}, {"actor": {"@type": "Person", "url": "/name/nm0251678/?ref_=tt_cl_t8", "name": "David Eigenberg"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0251678?ref_=tt_cl_t8", "name": "Steve Brady"}]}, {"actor": {"@type": "Person", "url": "/name/nm0507314/?ref_=tt_cl_t10", "name": "Jason Lewis"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0507314?ref_=tt_cl_t10", "name": "Smith Jerrod"}]}, {"actor": {"@type": "Person", "url": "/name/nm0169565/?ref_=tt_cl_t12", "name": "Lynn Cohen"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0169565?ref_=tt_cl_t12", "name": "Magda"}]}, {"actor": {"@type": "Person", "url": "/name/nm0322306/?ref_=tt_cl_t14", "name": "Joanna Gleason"}, "character_and_episodes": [{"url": "/title/tt1000774/characters/nm0322306?ref_=tt_cl_t14", "name": "Therapist"}]}]}