{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt7282468/", "name": "Beoning", "image": "https://m.media-amazon.com/images/M/MV5BMWNmYjI1M2UtNDdkNi00MTgwLWFiZmYtODcxNWZhM2Y2NWFkXkEyXkFqcGdeQXVyMTMxODk2OTU@._V1_.jpg", "genre": ["Drama", "Mystery"], "contentRating": "Not Rated", "actor": [{"@type": "Person", "url": "/name/nm2584860/", "name": "Ah-in Yoo"}, {"@type": "Person", "url": "/name/nm3081796/", "name": "Steven Yeun"}, {"@type": "Person", "url": "/name/nm9311474/", "name": "Jong-seo Jun"}, {"@type": "Person", "url": "/name/nm9940627/", "name": "Soo-Kyung Kim"}], "director": {"@type": "Person", "url": "/name/nm0496969/", "name": "Chang-dong Lee"}, "creator": [{"@type": "Person", "url": "/name/nm7669131/", "name": "Jungmi Oh"}, {"@type": "Person", "url": "/name/nm0496969/", "name": "Chang-dong Lee"}, {"@type": "Person", "url": "/name/nm1633142/", "name": "Haruki Murakami"}, {"@type": "Organization", "url": "/company/co0219213/"}, {"@type": "Organization", "url": "/company/co0052417/"}, {"@type": "Organization", "url": "/company/co0129937/"}], "description": "Beoning is a movie starring Ah-in Yoo, Steven Yeun, and Jong-seo Jun. Jong-su bumps into a girl who used to live in the same neighborhood, who asks him to look after her cat while she's on a trip to Africa. When back, she introduces...", "datePublished": "2018-05-17", "keywords": "metaphor,class differences,aspiring writer,suspicion,childhood memory", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 51025, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt7282468/"}, "author": {"@type": "Person", "name": "Bertaut"}, "dateCreated": "2019-02-16", "inLanguage": "English", "name": "A slow-burning mystery about economics, class, and sexual jealousy. And cats.", "reviewBody": "A thriller about a missing person. An allegory of class division. A study of generational alienation. A fable about modern consumerism. A dramatisation of psychological breakdown and genetically inherited rage. An analysis of socio-economic disenfranchisement. A critique of toxic masculinity and its concomitant misogyny. A condemnation of middle-class gentrification. A threnody for a traditional Korea that's slowly being replaced by faceless cosmopolitanism. An extended rib on Schrödinger's cat. Beoning is all of these. And none of them. This is a narrative fundamentally built on questions, very few of which are answered definitively.\n\nIn his first film in eight years, writer/director Chang-dong Lee begins this protean narrative as an almost high school-esque teen romance, before shifting gears into a story of sexual and economic jealousy, then morphing into the tale of a pseudo-film noir amateur sleuth, before finally allowing itself to visit the thriller territory that has lurked just outside the frame since the opening few scenes. Essentially a psychological drama about three people, although it's possible that only one of those people is real. There are also two cats. Or maybe only one cat. It's a long journey (148 minutes), and, for some, the payoff won't be worth the length of time taken to get there. Others, more used to concrete black-and-white yes-and-no narratives, will be unimpressed with how steadfastly the film refuses to yield its secrets. However, it has an undeniable ability to burrow under your skin, with Lee bestowing portentous significance upon the most inanimate of objects, only to later reveal that whilst we were trying to figure out the importance of item a, we missed the significance of item b.\n\nAdapted by Lee and Jungmi Oh from Haruki Murakami's 1983 short story \"Barn Burning\", which is itself loosely inspired by William Faulkner's 1939 short story of the same name, Beoning is set in contemporary South Korea, and tells the story of aspiring novelist Lee Jong-su (Ah-in Yoo). Working as a part-time delivery man in Seoul, he encounters Shin Hae-mi (Jong-seo Jun), who claims they went to school together, although he doesn't remember her. Telling him she will shortly be travelling to Africa, she asks him to feed her cat, Boil. He agrees, and the two have sex. Jong-su happily feeds Boil, and even though every time he comes to the apartment, the cat is nowhere to be seen, the food and water are disappearing. A few weeks later, she returns with Ben (Steven Yeun), a confidant, irritatingly polite, and extremely wealthy young man. The trio develop an odd relationship, and one evening, Jong-su admits to Ben that he loves Hae-mi, and Ben tells him about his strange hobby of burning greenhouses. A few days later, Hae-mi disappears, and Jong-su, suspecting Ben, sets out to find her.\n\nBeoning is masterfully constructed upon a foundation of questions, only a very few of which are answered. Some of the bigger questions include, why does Jong-su not remember Hae-mi from school; what happened to Hae-mi; what does Ben do for a living; is his admission that he has never cried evidence of sociopathy; does he really burn down greenhouses? There are also a whole host of smaller mysteries running alongside - why does Hae-mi seem to rig a raffle so that Jong-su wins; what exactly did Jong-su's father do (when the film begins, he is standing trial on a vague assault charge); who is calling Jong-su's home in the middle of the night and hanging up; why does he stare at his father's knives the way he does; where is his sister; does Boil exist; is Ben's rescue cat the same cat as the never-seen Boil; did Hae-mi really fall down a well as a child? Some (or more) of these questions remain unanswered, although there are certainly clues scattered throughout.\n\nThematically, the film covers a plethora of issues; toxic masculinity, alpha and beta males, economics and consumerism, class, the place of women in Korean society, sexual jealousy, the death of a bucolical way of life, working-class privations, faceless capitalism, the price of success, hope, writer's block. Of course, some are more foregrounded than others, with economics in particular emphasised. For example, the film cuts from a scene of the trio at a swanky nightclub (into which Ben has ensured they could go) to a scene of Jong-su alone, mucking out the cow stable. The contrast between the lifestyles of the two men couldn't be clearer. Jong-su belongs to a generation of working-class people who will be economically worse off than their parents were at the same age, whilst the gap between the middle-class and the working class has grown wider than ever. The Korea of the film is very much a place of castes, hierarchies of privilege and social standing, with Jong-su and Ben on the opposite end of every spectrum.\n\nThe film also engages significantly with gender politics. One of the things that so captivates Jong-su about Hae-mi is her provocative behaviour. Yet later, when she dances topless outside his house, he is disgusted, telling Ben, \"only a wh-re acts like that.\" It's a succinct summary of a societal double-standard; men can behave how they wish, but women must conform to arbitrary expectations. It could be argued that Hae-mi functions primarily to further Jong-su and Ben's arcs, and is devoid of any real agency herself. An alternative reading, however, is that she is poorly sketched as a character so as to represent a patriarchal society in which women are seen as less complex than men. For the most part, Beoning avoids didacticism on this issue, but to suggest that Hae-mi is simply a badly written character seems to me to be a very superficial interpretation of a film with great depth.\n\nHowever, there is also the possibility that Hae-mi doesn't actually exist, and in this sense, the fact that she is presented in such sexualised terms is because she is literally a male's fantasy, a sexual obsession born in the disturbed mind of an unreliable narrator. The film is told exclusively from Jong-su's perspective, he is in every scene, and the narrative never shifts to another focal character or to an omniscient viewpoint. With this in mind, everything we see is filtered through his ideological outlook; if he attaches significance to an object, the audience is invited to do likewise. Lee masterfully handles this tricky structural device, placing the audience directly into the same (possibly paranoid) headspace as the character. So, for example, when Jong-su sees Ben yawning as Hae-mi is recreating a dance she learned in Kenya, the yawn becomes immensely sinister, because that's how Jong-su interprets it. In this sense, if one theorises that Hae-mi is, in fact, a figment of Jong-su's imagination - an idealisation of a beautiful woman who wants him - then Ben must also originate in Jong-su's mind, functioning as the inverse to Hae-mi; a personification of everything to which Jong-su aspires, but is unable to attain. The fact that Lee leaves this tantalising possibility on the table whilst still managing to analyse social-realist topics such as economics and class, is a testament to his extraordinary control over the material.\n\nOne of the most salient motifs, if not necessarily a theme unto itself, is that of disappearance, with references scattered throughout the film - Hae-mi notes that her childhood home is gone, as is the well she fell into; Jong-su recollects how after his mother abandoned the family, his father burnt her clothes; when Ben tells Jong-su about his greenhouse hobby, he states, \"you can make it disappear as if it never even existed\"; Hae-mi literally says she wants to disappear; when Jong-su asks Ben if it's possible Hae-mi has gone on another trip, Ben says, \"maybe she disappeared like a puff of smoke\". The most important scene in this sense is an early one. Explaining that she's learning pantomime, Hae-mi proceeds to mime peeling and eating a tangerine, telling Jong-su the trick isn't to pretend the tangerine is really there, but to \"forget it doesn't exist\". This challenge to perception is crucial not just in how Jong-su becomes convinced Hae-mi has met foul play despite the lack of evidence, it also provides a clue for the audience as to how best to parse the film itself.\n\nOf course, for all that, there are a few problems. For one, it's a little too long, and there are occasions when the narrative seems somewhat desultory. I would imagine that a lot of people will also dislike the ambiguity. Personally, I loved this aspect and thought Lee handled it magnificently, but it certainly isn't for everyone. A minor issue is that as protagonists go, Jong-su is extremely passive, a character to whom things happen rather than the narrative's driving force. Again, some people will dislike this aspect, but I think it's important that Jong-su is depicted this way, especially in relation to the final scene. Of that scene, it could be seen as disappointingly familiar, something seen in any number of standard genre pieces. I disagree with that, but I can see where the criticism is coming from, as it does conform neatly to the rubric of a quotidian thriller.\n\nAll in all, I found Beoning to be a haunting film, one which I couldn't get out of head for days, and I'm keen to see it again. Lee's masterful control of tone is extraordinary, balancing a plethora of themes within a half-social-realist/half-magic-realist milieu. As good an exercise in cinematic suggestiveness as you're likely to see, Lee subtly alters mood so as to manipulate, push, prod, guide, and fool the audience. The film is such that everything on screen, every word spoken, every background detail could be important. Or not. Fiercely intelligent, deeply nuanced, complexly layered, it's a film that rewards concentration. It is, simply put, the finely crafted work of a distinct and relevant auteur.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT2H28M", "trailer": {"@type": "VideoObject", "name": "Burning", "embedUrl": "/video/imdb/vi1202305817", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTZmM2Y5ODAtYjQwMi00NmU5LWE2YzMtYjRiYmI4OTY3ZjZlXkEyXkFqcGdeQXRzdGFzaWVr._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTZmM2Y5ODAtYjQwMi00NmU5LWE2YzMtYjRiYmI4OTY3ZjZlXkEyXkFqcGdeQXRzdGFzaWVr._V1_.jpg", "description": "A woman's life is intertwined with two men - one rich and the other a courier who struggles to make ends meet.", "uploadDate": "2018-05-24T21:21:27Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm2584860/?ref_=tt_cl_t1", "name": "Ah-in Yoo"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm2584860?ref_=tt_cl_t1", "name": "Lee Jong-su"}]}, {"actor": {"@type": "Person", "url": "/name/nm9311474/?ref_=tt_cl_t3", "name": "Jong-seo Jun"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm9311474?ref_=tt_cl_t3", "name": "Shin Hae-mi"}]}, {"actor": {"@type": "Person", "url": "/name/nm8639907/?ref_=tt_cl_t5", "name": "Seung-ho Choi"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm8639907?ref_=tt_cl_t5", "name": "Lee Yong-seok"}]}, {"actor": {"@type": "Person", "url": "/name/nm5651810/?ref_=tt_cl_t7", "name": "Bok-gi Min"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm5651810?ref_=tt_cl_t7", "name": "Judge"}]}, {"actor": {"@type": "Person", "url": "/name/nm3674439/?ref_=tt_cl_t9", "name": "Hye-ra Ban"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm3674439?ref_=tt_cl_t9", "name": "Jong-su's Mom"}]}, {"actor": {"@type": "Person", "url": "/name/nm6771505/?ref_=tt_cl_t11", "name": "Lee Bong-Ryun"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm6771505?ref_=tt_cl_t11", "name": "Hae-mi's Sister"}]}, {"actor": {"@type": "Person", "url": "/name/nm6564367/?ref_=tt_cl_t12", "name": "Wonhyeong Jang"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm6564367?ref_=tt_cl_t12", "name": "Won-hyeong"}]}, {"actor": {"@type": "Person", "url": "/name/nm12141029/?ref_=tt_cl_t14", "name": "Shin-rok Kim"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm12141029?ref_=tt_cl_t14", "name": "Shin-rok"}]}, {"actor": {"@type": "Person", "url": "/name/nm3081796/?ref_=tt_cl_t2", "name": "Steven Yeun"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm3081796?ref_=tt_cl_t2", "name": "Ben"}]}, {"actor": {"@type": "Person", "url": "/name/nm9940627/?ref_=tt_cl_t4", "name": "Soo-Kyung Kim"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm9940627?ref_=tt_cl_t4", "name": "Yeon-ju"}]}, {"actor": {"@type": "Person", "url": "/name/nm0600673/?ref_=tt_cl_t6", "name": "Seong-kun Mun"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm0600673?ref_=tt_cl_t6", "name": "Lawyer"}]}, {"actor": {"@type": "Person", "url": "/name/nm9940628/?ref_=tt_cl_t8", "name": "Soo-Jeong Lee"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm9940628?ref_=tt_cl_t8", "name": "Prosecutor"}]}, {"actor": {"@type": "Person", "url": "/name/nm9940629/?ref_=tt_cl_t10", "name": "Mi-Kyung Cha"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm9940629?ref_=tt_cl_t10", "name": "Hae-mi's Mom"}]}, {"actor": {"@type": "Person", "url": "/name/nm8675635/?ref_=tt_cl_t13", "name": "Seok-Chan Jeon"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm8675635?ref_=tt_cl_t13", "name": "Seok-chan"}]}, {"actor": {"@type": "Person", "url": "/name/nm9242569/?ref_=tt_cl_t15", "name": "Joong-ok Lee"}, "character_and_episodes": [{"url": "/title/tt7282468/characters/nm9242569?ref_=tt_cl_t15", "name": "Patrolman"}]}]}