{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1179904/", "name": "Paranormal Activity", "image": "https://m.media-amazon.com/images/M/MV5BMjY1NjcxODQ4MV5BMl5BanBnXkFtZTcwMzUxNjM4Mg@@._V1_.jpg", "genre": ["Horror", "Mystery"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm2209370/", "name": "Katie Featherston"}, {"@type": "Person", "url": "/name/nm2913790/", "name": "Micah Sloat"}, {"@type": "Person", "url": "/name/nm2104166/", "name": "Mark Fredrichs"}, {"@type": "Person", "url": "/name/nm2910808/", "name": "Amber Armstrong"}], "director": {"@type": "Person", "url": "/name/nm2305431/", "name": "Oren Peli"}, "creator": [{"@type": "Person", "url": "/name/nm2305431/", "name": "Oren Peli"}, {"@type": "Organization", "url": "/company/co0336921/"}, {"@type": "Organization", "url": "/company/co0098315/"}], "description": "Paranormal Activity is a movie starring Katie Featherston, Micah Sloat, and Mark Fredrichs. After moving into a suburban home, a couple becomes increasingly disturbed by a nightly demonic presence.", "datePublished": "2009-10-16", "keywords": "found footage,entity,dark force,evil force,darkness", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 221552, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1179904/"}, "author": {"@type": "Person", "name": "Matt_Layden"}, "dateCreated": "2009-10-24", "inLanguage": "English", "name": "A Theatre Experience I'll Never Forget.", "reviewBody": "A couple decide to document their nights while they sleep, after they hear strange noises that they believe to be a haunting.\n\nI respect this film, for the fact that it was shot for less than 20,000, had absolutely no marketing campaign and has become a huge success based on word of mouth and the audience demanding to see it. If only other studios would follow suit and listen to people demanding to see movies they want to see, maybe there wouldn't be so much crap out there. \n\nParanormal Activity is shot like Cloverfield, Blair Witch Project, REC, Cannibal Holocaust, etc. If any of those films gave you motion sickness, you might want to skip this one. Half the film is shot while they sleep, so the film is on a tri-pod, the other half is them walking around with it. So if you've never been a fan of those films, skip this one. Second, the film is not as scary as people make it out to be. Instead, it is one creepy and suspenseful film, that seeing in a theatre, only heightened my enjoyment of it. \n\nThe audience I went with, all had a collective \"Oh My God\". I could hear it every time something creepy happened. You could literally feel everyone in the theatre holding their breath every time they went to sleep. Again, if you are the type of person who wants to watch a film and not hear a peep out of anyone else, skip this film.\n\nNow the film itself, shot in one week, small (very small) budget and every penny of it went towards the special effects. The special effects are what sell the film, if you don't buy them, the film will not creep you out. They looked real and impressive enough to push the film into a successful goal, which is to scare people. If you are already afraid of the dark, this film will not help you. Every creek, thump, noise you hear in your house will now have you thinking twice. \n\nLess is more, The Blair Witch Project uses this, as does Paranormal Activity. The two leads, are haunted by a demon, one we never see, only hear. Whenever you go into a horror film, as a kid you would close your eyes in fear. Big mistake, because it's the ears you need to be covering. The sound is what makes you jump, hear nothing, fear nothing. The sound design behind this film is what is scary people, accompanied by the visuals (memorable scenes with the powder and bed sheets).\n\nAs the film progresses, the haunting gets worse. I don't want to give anything away, and I urge you to not watch the trailer. I watched the trailer and was waiting for those things to happen, it took away from the general fear. Not knowing what to expect will make this film that much better, that much creepier and that much more entertaining. I didn't expect it to be as funny as it was either, the lead male had some comic relief dialogue, the ease the tension. \n\nThe couple are believable, the hand held camera angle works here and the fear will set in. I applaud Paranormal Activity, for not only becoming an unheard of success, but for being one of the creepiest films I've ever seen.\n\nBravo.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H26M", "trailer": {"@type": "VideoObject", "name": "Paranormal Activity: Trailer #2", "embedUrl": "/video/imdb/vi1135609113", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTQ3NTEwNjExMV5BMl5BanBnXkFtZTcwNDMyNDE5Mg@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTQ3NTEwNjExMV5BMl5BanBnXkFtZTcwNDMyNDE5Mg@@._V1_.jpg", "description": "While settling into her new home, Katie (Featherston) is disturbed in her sleep by a mysterious presence. Her husband, Micah (Sloat), tries to ease her fear by installing video cameras in an attempt to capture the strange behavior on tape. Bad idea.", "uploadDate": "2009-10-17T10:41:14Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm2209370/?ref_=tt_cl_t1", "name": "Katie Featherston"}, "character_and_episodes": [{"url": "/title/tt1179904/characters/nm2209370?ref_=tt_cl_t1", "name": "Katie"}]}, {"actor": {"@type": "Person", "url": "/name/nm2104166/?ref_=tt_cl_t3", "name": "Mark Fredrichs"}, "character_and_episodes": [{"url": "/title/tt1179904/characters/nm2104166?ref_=tt_cl_t3", "name": "Psychic"}]}, {"actor": {"@type": "Person", "url": "/name/nm2032098/?ref_=tt_cl_t5", "name": "Ashley Palmer"}, "character_and_episodes": [{"url": "/title/tt1179904/characters/nm2032098?ref_=tt_cl_t5", "name": "Diane"}]}, {"actor": {"@type": "Person", "url": "/name/nm2913790/?ref_=tt_cl_t2", "name": "Micah Sloat"}, "character_and_episodes": [{"url": "/title/tt1179904/characters/nm2913790?ref_=tt_cl_t2", "name": "Micah"}]}, {"actor": {"@type": "Person", "url": "/name/nm2910808/?ref_=tt_cl_t4", "name": "Amber Armstrong"}, "character_and_episodes": [{"url": "/title/tt1179904/characters/nm2910808?ref_=tt_cl_t4", "name": "Amber"}]}]}