{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt3874544/", "name": "The Boss Baby", "image": "https://m.media-amazon.com/images/M/MV5BMTg5MzUxNzgxNV5BMl5BanBnXkFtZTgwMTM2NzQ3MjI@._V1_.jpg", "genre": ["Animation", "Adventure", "Comedy", "Family", "Fantasy"], "contentRating": "PG", "actor": [{"@type": "Person", "url": "/name/nm0000285/", "name": "Alec Baldwin"}, {"@type": "Person", "url": "/name/nm0000114/", "name": "Steve Buscemi"}, {"@type": "Person", "url": "/name/nm0453994/", "name": "Jimmy Kimmel"}, {"@type": "Person", "url": "/name/nm0001435/", "name": "Lisa Kudrow"}], "director": {"@type": "Person", "url": "/name/nm0569891/", "name": "Tom McGrath"}, "creator": [{"@type": "Person", "url": "/name/nm0567112/", "name": "Michael McCullers"}, {"@type": "Person", "url": "/name/nm2807682/", "name": "Marla Frazee"}, {"@type": "Organization", "url": "/company/co0129164/"}], "description": "The Boss Baby is a movie starring Alec Baldwin, Steve Buscemi, and Jimmy Kimmel. A suit-wearing, briefcase-carrying baby pairs up with his 7-year old brother to stop the dastardly plot of the CEO of Puppy Co.", "datePublished": "2017-03-23", "keywords": "baby,puppy,cookie,puppy love,mother son relationship", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 109905, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt3874544/"}, "author": {"@type": "Person", "name": "moviexclusive"}, "dateCreated": "2017-03-23", "inLanguage": "English", "name": "Never fully expanding on the promise of its appealing conceit, 'The Boss Baby' is typical hijinks-driven entertainment, despite boasting a pitch-perfect Alec Baldwin", "reviewBody": "Loosely based on Marla Frazee's 2010 picture book of the same name, 'The Boss Baby' pits a seven-year-old boy named Tim against his arrogant, manipulative and precocious walking-and-talking baby brother. Wait, did we say walking and talking? Oh yes, this titular infant is no ordinary baby; dubbed the Boss Baby from start to finish, he wears a suit and tie and carries a tiny briefcase wherever he goes. That's because he happens to be an ambitious management executive from the baby-making organization known as Baby Corp, whose deliberate entry into the Templetons' family is really for cover to infiltrate arch-rival company Puppyco and stop their newest invention – the ne'er-grow-old 'Forever Puppy' – that threatens to further divert humans' affection (presumed to be finite) away from babies. If all that sounds a little far-fetched, you're absolutely right; in fact, these events are happening inside the mind of a wildly imaginative only child, who concocts this elaborate scenario as an analogy of how his newborn sibling is usurping the time, attention and love of his parents.\n\nBecause most of it happens inside Tim's head (who narrates the story as an adult voiced by Tobery Maguire), director Tom McGrath (co- director of the three 'Madagascar' movies) and screenwriter Michael McCullers (Mike Myers' co-writer on the second and third 'Austin Powers' movies) get plenty of leeway to let their own imagination run wild. That includes conceiving conception as coming off an assembly line, where babies are diapered, powdered and sorted into 'Family' or 'Management' depending on how they respond to stimuli. That also involves throwing corporate politics into the mix, where the Boss Baby's mission success decides whether he gets promoted to CEO, upgrades to a huge office of his own complete with a private toilet, and joins the ranks of his idol 'Super Colossal Big Fat Boss Baby'. And last but not least, that culminates in the foiling of a dastardly plot hatched by Puppyco's CEO, Francis E. Francis (Steve Buscemi), to flood every corner of the world with his 'Forever Puppys' packed into a rocket ready for launch.\n\nThe late introduction of Francis E. Francis shifts the proceedings into hyperdrive, and like 'Penguins of Madagascar' or 'The Croods', delivering loud frenetic action becomes the priority in the third and final act. From the point Tim and the Boss Baby sneak into Puppyco's company headquarters on 'Bring Your Kids to Work' Day, it is one non-stop action sequence after another as the unlikely duo evade Francis' henchman within their suburban neighbourhood en route to the airport, smuggle on board a plane full of Elvis impersonators bound for Vegas, and stop the rocket countdown from a Vegas convention centre before the 'Forever Puppies' overrun the globe. All that feverish to-and-fro comes at the expense of heart, humour or even neglecting the simple truth behind all that fantasy, i.e. that Tim's just plain terrified that he is being replaced – and that not even a supposedly heartwarming resolution that has Tim finally embrace his baby brother and the latter 'family-hood' can compensate for.\n\nIn fact, it is the earlier two – and much simpler – acts that have much more meaning and laughs. An earlier sequence that pits Tim against the Boss Baby and his other Baby Corp spies in the vicinity to the theme music from that 70s TV show 'S.W.A.T.' is a lot more entertaining and inventive than the concluding melee. Even more inspired is that which introduces us to Baby Corp, centred not just on a revisionist explanation of where babies come from but also why the Boss Baby was not like most of the others bound for domestication from the beginning. There are other amusing touches of wit – such as how the Boss Baby gives a virtual tour of Baby Corp by asking Tim to suck aggressively on a special pacifier or how the Boss Baby delivers himself to the Templetons by taxi and funk waddling up the doorstep or even Tim's daily escapist adventures that turn dinner into a hunt through the Congo, daily baths into an undersea mission to save his parents from inside the jaws of a shark and his alarm clock into a Gandalf wizard wannabe named Wizzy.\n\nBut a big reason for the Boss Baby's sheer hilarity is none other than Alec Baldwin's flawless voice delivery, this being the fifth time he's lending his signature deadpan to an animated movie. Perfectly capturing the eponymous character's infantilism, brashness, egotism, insecurity and affection, Baldwin brings the man-child to vivid life, nailing the punchlines and even elevating some of the less clever puns. Indeed, it is hardly a stretch to say that Baldwin is the film's standout element, its primary source of cheer, exuberance and wackiness, and quite simply the one reason that makes it worth catching.\n\nThe basic premise of 'The Boss Baby' is undeniably an appealing and relatable one: the anxiety, uncertainty and even fear that a child faces when he is no longer the only kid in the family, especially given the demands and concessions that a newborn places on his or her parents' time. Turning that into a vivid fantasy with the newborn becoming a literal 'boss' not just of the family but also of an entire baby-making operation that views puppies as their number one enemy sounds ingenious, but the execution through hijinks-driven slapstick gags ultimately reduces it to generic hyperactive fare that too many animated comedies these days are guilty of. And by that same measure, 'The Boss Baby' has little distinction from the average cartoon, despite being admittedly beautifully visualized, cheerfully executed and boasting the top-notch voice talent of Alec Baldwin. It may be about a baby all right, but that hardly excuses why it has to resort to the attention span of one.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H37M", "trailer": {"@type": "VideoObject", "name": "Trailer #3", "embedUrl": "/video/imdb/vi4267488793", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZjI1MTU2NGItYTY3Yi00Y2U2LTk0N2ItNTBhNmY0ZWZlZmExXkEyXkFqcGdeQXVyNjMwMzc3MjE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZjI1MTU2NGItYTY3Yi00Y2U2LTk0N2ItNTBhNmY0ZWZlZmExXkEyXkFqcGdeQXVyNjMwMzc3MjE@._V1_.jpg", "description": "A suit-wearing briefcase-carrying baby pairs up with his seven-year old brother to stop the dastardly plot of the CEO of Puppy Co.", "uploadDate": "2017-03-20T14:09:28Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000285/?ref_=tt_cl_t1", "name": "Alec Baldwin"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm0000285?ref_=tt_cl_t1", "name": "Boss Baby"}]}, {"actor": {"@type": "Person", "url": "/name/nm0453994/?ref_=tt_cl_t3", "name": "Jimmy Kimmel"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm0453994?ref_=tt_cl_t3", "name": "Dad"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001497/?ref_=tt_cl_t5", "name": "Tobey Maguire"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm0001497?ref_=tt_cl_t5", "name": "Adult Tim"}, {"url": "/title/tt3874544/characters/nm0001497?ref_=tt_cl_t5", "name": "Narrator"}]}, {"actor": {"@type": "Person", "url": "/name/nm4642699/?ref_=tt_cl_t7", "name": "James McGrath"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm4642699?ref_=tt_cl_t7", "name": "Wizzie"}, {"url": "/title/tt3874544/characters/nm4642699?ref_=tt_cl_t7", "name": "Elvis Impersonator"}]}, {"actor": {"@type": "Person", "url": "/name/nm6510248/?ref_=tt_cl_t9", "name": "ViviAnn Yee"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm6510248?ref_=tt_cl_t9", "name": "Staci"}]}, {"actor": {"@type": "Person", "url": "/name/nm1659741/?ref_=tt_cl_t11", "name": "David Soren"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm1659741?ref_=tt_cl_t11", "name": "Jimbo"}]}, {"actor": {"@type": "Person", "url": "/name/nm1121631/?ref_=tt_cl_t13", "name": "James Ryan"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm1121631?ref_=tt_cl_t13", "name": "Story Bear"}]}, {"actor": {"@type": "Person", "url": "/name/nm8880559/?ref_=tt_cl_t15", "name": "Jules Winter"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm8880559?ref_=tt_cl_t15", "name": "Crying Boy"}, {"url": "/title/tt3874544/characters/nm8880559?ref_=tt_cl_t15", "name": "Little Boy"}, {"url": "/title/tt3874544/characters/nm8880559?ref_=tt_cl_t15", "name": "Boy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000114/?ref_=tt_cl_t2", "name": "Steve Buscemi"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm0000114?ref_=tt_cl_t2", "name": "Francis Francis"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001435/?ref_=tt_cl_t4", "name": "Lisa Kudrow"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm0001435?ref_=tt_cl_t4", "name": "Mom"}]}, {"actor": {"@type": "Person", "url": "/name/nm2857474/?ref_=tt_cl_t6", "name": "Miles Bakshi"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm2857474?ref_=tt_cl_t6", "name": "Tim"}]}, {"actor": {"@type": "Person", "url": "/name/nm0970447/?ref_=tt_cl_t8", "name": "Conrad Vernon"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm0970447?ref_=tt_cl_t8", "name": "Eugene"}]}, {"actor": {"@type": "Person", "url": "/name/nm6534539/?ref_=tt_cl_t10", "name": "Eric Bell Jr."}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm6534539?ref_=tt_cl_t10", "name": "Triplets"}]}, {"actor": {"@type": "Person", "url": "/name/nm0592437/?ref_=tt_cl_t12", "name": "Edie Mirman"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm0592437?ref_=tt_cl_t12", "name": "Big Boss Baby"}]}, {"actor": {"@type": "Person", "url": "/name/nm0230666/?ref_=tt_cl_t14", "name": "Walt Dohrn"}, "character_and_episodes": [{"url": "/title/tt3874544/characters/nm0230666?ref_=tt_cl_t14", "name": "Photographer"}]}]}