{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0086765/", "name": "Murder, She Wrote", "image": "https://m.media-amazon.com/images/M/MV5BOWQ1YjAyNzItYzkzYS00MDFlLTlmNWYtYjYyZWU1YjdiZDMzXkEyXkFqcGdeQXVyMTYzMDM0NTU@._V1_.jpg", "genre": ["Crime", "Drama", "Mystery"], "contentRating": "TV-PG", "actor": [{"@type": "Person", "url": "/name/nm0001450/", "name": "Angela Lansbury"}, {"@type": "Person", "url": "/name/nm0934750/", "name": "William Windom"}, {"@type": "Person", "url": "/name/nm0556041/", "name": "Ron Masak"}, {"@type": "Person", "url": "/name/nm0381043/", "name": "Louis Herthum"}], "creator": [{"@type": "Person", "url": "/name/nm0279089/", "name": "Peter S. Fischer"}, {"@type": "Person", "url": "/name/nm0506087/", "name": "Richard Levinson"}, {"@type": "Person", "url": "/name/nm0512894/", "name": "William Link"}, {"@type": "Organization", "url": "/company/co0054949/"}, {"@type": "Organization", "url": "/company/co0046592/"}], "description": "Murder, She Wrote is a TV series starring Angela Lansbury, William Windom, and Ron Masak. Professional writer and amateur sleuth Jessica Fletcher uses her intellect, charm, and persistence to get to the bottom of every crime she...", "datePublished": "1984-09-30", "keywords": "detective,murder,mystery writer,writing,author", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 19373, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0086765/"}, "author": {"@type": "Person", "name": "roghache"}, "dateCreated": "2006-04-21", "inLanguage": "English", "name": "Cherished series, mystery novelist sleuth's a genuine lady", "reviewBody": "This series is one of my all time favourites, and I still eagerly catch it on re runs. Angela Lansbury is surely one of the greatest of all the entertainment world's ladies, growing simply more graceful, dignified, and endearing as the years pass. She made a superb Miss Marple in some of the Agatha Christie movies, but her role as Jessica Fletcher, Cabot Cove's retired high school English teacher and current mystery novelist sleuth, is the one she was born to play.\n\nTrue, the series isn't very realistic, as Jessica invariably stumbles upon a murder each week and manages to ferret out the killer quite single handedly, while local law enforcement remains stumped. However, this is fairly typical of all fictional sleuths; look at Miss Marple herself. Certainly Cabot Cove has an astonishing murder rate! Some episodes are of course more captivating than others, but even when a situation is predictable, it's always a joy watching this lovely, clever, & kind lady in action as she uses her charm, wits, imagination, and instincts about human nature. Of course it's always fun to try figuring out the killer before she does.\n\nJessica's travels take her around the USA and indeed the world, as she makes frequent trips to her New York City publisher, visits friends & relatives around the country (ranches, ski resorts, Las Vegas etc.), and even travels abroad, for example to Hong Kong, Ireland, Rome, Athens, and Monte Carlo. However, my favourite episodes are set in her small Maine hometown of Cabot Cove. I always enjoy the depiction of her lovely old fashioned white house and small town New England life, her traveling about on her bicycle (like myself, Jessica does not drive a car), and especially her relationships with other townsfolk, notably series regulars Dr. Seth Hazlitt and Sheriff Amos Tupper. As Jessica is a widow, it's always interesting to watch her with her good friend, Seth; one is tempted to look for a glimmer of romance. Quite often Jessica's young nephew, Grady, appears with her as she tackles the solution to a case.\n\nThe guest list throughout the long running series does indeed read like a veritable 'Who's who' of Hollywood, including Hayley Mills, Shelley Fabares, Van Johnson, Efrem Zimbalist Jr., Polly Bergen, Wayne Rogers, Lucie Arnaz, and David Ogden Stiers...to name but a few.\n\nI'm thrilled that the series continues to live on in re runs and tip my hat to Angela Lansbury's twelve season stint as the mystery writer sleuth. Personally, I wish Jessica Fletcher had taught my son English in high school, would love to read one of her mystery novels, and think she would make a fabulous & interesting next door neighbour...except that I'd be a teeny bit afraid I might just turn up murdered!", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "trailer": {"@type": "VideoObject", "name": "Murder, She Wrote: The Complete Sixth Season", "embedUrl": "/video/imdb/vi2107310361", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZGUyMjZmOWQtYWJlYS00OTI1LWI0MDAtZWY1NWM4M2U1ODM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZGUyMjZmOWQtYWJlYS00OTI1LWI0MDAtZWY1NWM4M2U1ODM2XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Home Video Trailer from Universal Studios Home Entertainment", "uploadDate": "2008-04-11T15:21:19Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0001450/?ref_=tt_cl_t1", "name": "Angela Lansbury"}, "character_and_episodes": [{"url": "/title/tt0086765/characters/nm0001450?ref_=tt_cl_t1", "name": "Jessica Fletcher"}, {"url": "#", "name": "264 episodes, 1984-1996"}]}], "details": {"Country": ["USA"], "Language": ["English"], "Release Date": ["30 September 1984 (USA)"], "Also Known As": ["Murder, She Wrote"], "Filming Locations": ["California, USA"], "Production Co": ["Corymore Productions", "Universal Television"], "Runtime": ["50 min", "48 min", "(262 episodes)", "73 min", "(1 Episode)", "93 min", "(1 Episode)"]}}