{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0092325/", "name": "The Bold and the Beautiful", "image": "https://m.media-amazon.com/images/M/MV5BN2Q2ZWU2ZGYtNDIzOC00YzRhLWI0ZTctYTI3M2EzNmNkOWNmXkEyXkFqcGdeQXVyNDYxNDE1NjQ@._V1_.jpg", "genre": ["Drama", "Romance"], "contentRating": "TV-14", "actor": [{"@type": "Person", "url": "/name/nm0485810/", "name": "Katherine Kelly Lang"}, {"@type": "Person", "url": "/name/nm0609078/", "name": "Ronn Moss"}, {"@type": "Person", "url": "/name/nm0281224/", "name": "Susan Flannery"}, {"@type": "Person", "url": "/name/nm0198931/", "name": "John McCook"}], "creator": [{"@type": "Person", "url": "/name/nm0068589/", "name": "William J. Bell"}, {"@type": "Person", "url": "/name/nm0068347/", "name": "Lee Phillip Bell"}, {"@type": "Organization", "url": "/company/co0057028/"}], "description": "The Bold and the Beautiful is a TV series starring Katherine Kelly Lang, Ronn Moss, and Susan Flannery. The saga of high fashion glamour, honor, romance, passion, and most importantly, family.", "datePublished": "1987-03-23", "keywords": "love triangle,psychiatrist,domineering mother,repetition in title,repetition in series title", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 7074, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "3.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0092325/"}, "author": {"@type": "Person", "name": "elshikh4"}, "dateCreated": "2009-11-14", "inLanguage": "English", "name": "\"Oh Mom ! You Slept With My Brother !!\"", "reviewBody": "..And that's maybe not the worst yet!\n\nSince the 1950s, soap operas, in radio and TV, had their lovers. However, (Dallas) came out in (1979) to make a great effect on the TV soap operas with its wicked formula of manipulating everybody and everything just for having you on your seat for years! Watch that effect on next soaps like (Knots Landing - 1979) or (Falcon Crest - 1981). But some goods, when outlive for more than their competence, transform into envenomed!\n\nAt first, (B & B) was another, late 80s, so TV-ish, daytime soap. Namely hot, melodramatic and yeah.. boring! But after that, it turned - while keeping itself outwardly glossy - into ugly huge farce.\n\nI can't say it's a diary of a family. I can't say it's fine thrilling melodrama. I just can say that it's a living exploitation of soap. And you know what? It's successful. So successful indeed!\n\n(The Bold and the Beautiful), after 22 years and counting, is a real fine example of the kind of drama which some viewers need everyday like a requisite meal to satisfy their hanger; for living a romance, feeling rich, beating enemies.. etc. whatever the acting was, and whatever the manipulation is.\n\nI somewhat caught on its formula: a sexual desire, a sinful love, a separation between 2 lovers, a wicked plot and a surprise. Then another round. Then another one. Then another with other characters, with new characters, then between the old and new characters, then between them and us maybe!, then the same formula again with the same characters afresh, going on and on, till the end of you, the end of days, or the end its time on screen (meaning: its cancellation!).\n\nIt's a perfect scheme. So loved and long-lived. But who can stand endless storylines, everlasting dialogue, the silence of the actors before cutting to another scene or commercials, and - most of all - the changing of partners?? Whoever can stand all of this, for more than 5500 episodes, I'm surely not one of them. Why is that? Because I don't have non-critic mentality, a desperate passion for melodrama, and that PATIENCE!\n\nSpeaking about the changing of partners thing, I recall a line was said by (Dean Stockwell) in one of (Quantum Leap)'s episodes talking about a soap opera: \"Here Sam, everybody is sleeping with everybody!\". (B & B) maybe broke this rule since in it everybody slept, sleeps, and will sleep with everybody! Sometimes I think that they have nothing to do in this world but sleeping with each other, then chatter and chatter and chatter, to re-sleep again yet with others. It's not the story of life, it's the life of very profitable story! I know that it got the power to make you sleep in front of it too!\n\nDid its success become a curse?! I don't completely think so. Not for the actors, since they're all well-paid. Not for the viewers, since they get what they want. But maybe for the writers. These people got to write one work for over than 2 decades?? OH MY GOD! This is, in spite of all the money in the world, so heavy mission to be done. So, based on my compassion, I'll forgive them for such events like the one of my title's line which was the first thing I heard when I tried to continue watching this series again, after years of losing any interest in it (Yes, first I felt panic, thinking that the mom slept with her own son, but I understood it right later!). However, when things reach this far, I invite you to do what I already did: Change the Channel. Believe me, you'll feel so bold and beautiful after!\n\nIn the next episodes I bet you; the son will turn out to the real father of his sister, (Ridge) will turn out to be a brother of his mother, (Eric Forrester) will have a sex change operation, (Brooke) will turn into lesbian (if she didn't yet?!), and I can see the end right now; the aliens will take them all away (it kind of happened before, didn't it?!); and for that alone I'll salute the creative writers. Simply, what can a teleplay writer do.. More?!!!\n\nOriginally, as much the viewers want it, as much it gains more time on air, and so.. that's what has to happen. Though it triumphed over any jesting - even its own - already, being the most-watched soap in the world, with an audience of an estimated 26.2 million viewers in more than 110 nations. So while I believe that it is provoking sitcom; running without laughing tracks or laughing, others don't, and that's in fact what makes it provoking. But everybody got their own classics. This show is classic for some. Classic nonsense for others. GOD!, it is classic both ways!!"}, "trailer": {"@type": "VideoObject", "name": "Sneak Peak Trailer", "embedUrl": "/video/imdb/vi1827388953", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTU5ZDZkNjItODI5Zi00ZjNmLTg2ZTktMTdlNjg3NDMxM2Y2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTU5ZDZkNjItODI5Zi00ZjNmLTg2ZTktMTdlNjg3NDMxM2Y2XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "uploadDate": "2020-04-30T11:13:31Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0485810/?ref_=tt_cl_t1", "name": "Katherine Kelly Lang"}, "character_and_episodes": [{"url": "/title/tt0092325/characters/nm0485810?ref_=tt_cl_t1", "name": "Brooke Logan"}, {"url": "#", "name": "5,264 episodes, 1987-2021"}]}, {"actor": {"@type": "Person", "url": "/name/nm0281224/?ref_=tt_cl_t3", "name": "Susan Flannery"}, "character_and_episodes": [{"url": "/title/tt0092325/characters/nm0281224?ref_=tt_cl_t3", "name": "Stephanie Forrester"}, {"url": "#", "name": "3,375 episodes, 1987-2018"}]}, {"actor": {"@type": "Person", "url": "/name/nm0878950/?ref_=tt_cl_t5", "name": "Hunter Tylo"}, "character_and_episodes": [{"url": "/title/tt0092325/characters/nm0878950?ref_=tt_cl_t5", "name": "Dr. Taylor Hayes"}, {"url": "#", "name": "2,266 episodes, 1990-2019"}]}, {"actor": {"@type": "Person", "url": "/name/nm0609078/?ref_=tt_cl_t2", "name": "Ronn Moss"}, "character_and_episodes": [{"url": "/title/tt0092325/characters/nm0609078?ref_=tt_cl_t2", "name": "Ridge Forrester"}, {"url": "#", "name": "3,896 episodes, 1987-2015"}]}, {"actor": {"@type": "Person", "url": "/name/nm0198931/?ref_=tt_cl_t4", "name": "John McCook"}, "character_and_episodes": [{"url": "/title/tt0092325/characters/nm0198931?ref_=tt_cl_t4", "name": "Eric Forrester"}, {"url": "#", "name": "3,366 episodes, 1987-2021"}]}]}