{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0063654/", "name": "The Subject Was Roses", "image": "https://m.media-amazon.com/images/M/MV5BNGMxZmU3OWEtYzhhZi00MDQ2LTk3YmEtODcyNmIwMTgwYWE2XkEyXkFqcGdeQXVyNzc5MjA3OA@@._V1_.jpg", "genre": "Drama", "contentRating": "G", "actor": [{"@type": "Person", "url": "/name/nm0623658/", "name": "Patricia Neal"}, {"@type": "Person", "url": "/name/nm0016776/", "name": "Jack Albertson"}, {"@type": "Person", "url": "/name/nm0000640/", "name": "Martin Sheen"}, {"@type": "Person", "url": "/name/nm0768321/", "name": "Don Saxon"}], "director": {"@type": "Person", "url": "/name/nm0343260/", "name": "Ulu Grosbard"}, "creator": [{"@type": "Person", "url": "/name/nm0319663/", "name": "Frank D. Gilroy"}, {"@type": "Person", "url": "/name/nm0319663/", "name": "Frank D. Gilroy"}, {"@type": "Organization", "url": "/company/co0007143/"}, {"@type": "Organization", "url": "/company/co0088829/"}, {"@type": "Organization", "url": "/company/co0088830/"}, {"@type": "Organization", "url": "/company/co0088828/"}], "description": "The Subject Was Roses is a movie starring Patricia Neal, Jack Albertson, and Martin Sheen. A young man returning home from World War II finds himself caught up in his parents' turbulent relationship.", "datePublished": "1970-02-12", "keywords": "world war two veteran,radio,dance,reference to jimmy durante,jimmy durante impression", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1401, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0063654/"}, "author": {"@type": "Person", "name": "bkoganbing"}, "dateCreated": "2009-01-20", "inLanguage": "English", "name": "The Clearys From The Bronx", "reviewBody": "I'm supposing that when you deal with a three character play, expanded to five for the screen, everyone is a lead. It's strange to me that Jack Albertson was not considered for Best Actor as he has as much if not more screen time than Patricia Neal. And certainly Martin Sheen as their son equals their time in The Subject Was Roses.\n\nThe Subject Was Roses was a Pulitzer Prize winning play that ran for 832 performances on Broadway starting in 1965. Albertson and Sheen recreate the roles they did on stage and Patricia Neal replaces Irene Dailey from the Broadway cast. Albertson won a Tony Award for Best Actor yet he only one for Best Supporting Actor for the film. Go figure.\n\nAlbertson and Neal are Mr.&Mrs. Cleary who have a red letter day in their lives in 1945. Their son Tim played by Martin Sheen has come home from World War II. He's been gone for several years, probably the duration of the American involvement in World War II. \n\nAbsence has made Sheen see his parents in a whole new light. As it turns out they're not the happiest of people. Albertson's totally consumed with business and making a success for himself. He's so self absorbed that he treats Neal like a doormat. And in his cultural background the woman merely acquiesces to the men.\n\nI remember years ago a woman I knew was of Irish background and was involved politically as the female Republican State Committeewoman of her district. She was nice and popular and knew her place. When her male counterpart was getting together with some cronies to pull a power play in the party in her county of Kings, she wasn't crazy about it. When asked about whether she approved or not she wasn't sure, but since THE MEN are in favor of it, she would acquiesce.\n\nPatricia Neal stopped acquiescing after a few ugly arguments with Albertson and Sheen. Her big act of defiance was to take $50.00 worth of accumulated change, get on a bus and have a big fling just getting out and about for several hours. For her that was tantamount to a declaration of independence.\n\nThe Subject Was Roses set in the Woodlawn section of the Bronx which is still an Irish enclave there, though not anything like it was in 1946 is author Frank D. Gilroy's bittersweet memories of the place. I'd love to know who the models for his characters were, hopefully not him and his own parents.\n\nThe only other nomination was Patricia Neal for Best Actress which makes Albertson in the Supporting Category equally strange. 1968 was the year of the tie between Katharine Hepburn for The Lion In Winter and Barbra Streisand for Funny Girl. \n\nMaybe Albertson was right to be considered in the Supporting Category purely in terms of winning. Still he and Neal are a matched team of marrieds facing a most uncertain future when Sheen leaves the nest. The Subject Was Roses was a nice slice of Bronx life circa 1946 and holds up well today.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H47M", "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0623658/?ref_=tt_cl_t1", "name": "Patricia Neal"}, "character_and_episodes": [{"url": "/title/tt0063654/characters/nm0623658?ref_=tt_cl_t1", "name": "Nettie Cleary"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000640/?ref_=tt_cl_t3", "name": "Martin Sheen"}, "character_and_episodes": [{"url": "/title/tt0063654/characters/nm0000640?ref_=tt_cl_t3", "name": "Timmy Cleary"}]}, {"actor": {"@type": "Person", "url": "/name/nm3308639/?ref_=tt_cl_t5", "name": "Elaine Williams"}, "character_and_episodes": [{"url": "/title/tt0063654/characters/nm3308639?ref_=tt_cl_t5", "name": "The Woman in Club"}]}, {"actor": {"@type": "Person", "url": "/name/nm0016776/?ref_=tt_cl_t2", "name": "Jack Albertson"}, "character_and_episodes": [{"url": "/title/tt0063654/characters/nm0016776?ref_=tt_cl_t2", "name": "John Cleary"}]}, {"actor": {"@type": "Person", "url": "/name/nm0768321/?ref_=tt_cl_t4", "name": "Don Saxon"}, "character_and_episodes": [{"url": "/title/tt0063654/characters/nm0768321?ref_=tt_cl_t4", "name": "The Master of Ceremonies"}]}]}