{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0385752/", "name": "The Golden Compass", "image": "https://m.media-amazon.com/images/M/MV5BMTM2NDkxMjQxMV5BMl5BanBnXkFtZTYwNTMxMDM4._V1_.jpg", "genre": ["Adventure", "Family", "Fantasy"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0000173/", "name": "Nicole Kidman"}, {"@type": "Person", "url": "/name/nm0185819/", "name": "Daniel Craig"}, {"@type": "Person", "url": "/name/nm2301950/", "name": "Dakota Blue Richards"}, {"@type": "Person", "url": "/name/nm2036501/", "name": "Ben Walker"}], "director": {"@type": "Person", "url": "/name/nm0919363/", "name": "Chris Weitz"}, "creator": [{"@type": "Person", "url": "/name/nm0919363/", "name": "Chris Weitz"}, {"@type": "Person", "url": "/name/nm1099514/", "name": "Philip Pullman"}, {"@type": "Organization", "url": "/company/co0046718/"}, {"@type": "Organization", "url": "/company/co0136728/"}, {"@type": "Organization", "url": "/company/co0012870/"}, {"@type": "Organization", "url": "/company/co0113177/"}], "description": "The Golden Compass is a movie starring Nicole Kidman, Daniel Craig, and Dakota Blue Richards. In a parallel universe, young Lyra Belacqua journeys to the far North to save her best friend and other kidnapped children from terrible...", "datePublished": "2007-12-05", "keywords": "orphan,parallel universe,quest,missing child,kidnapping", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 180028, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0385752/"}, "author": {"@type": "Person", "name": "motta80-2"}, "dateCreated": "2007-11-28", "inLanguage": "English", "name": "Really fun, engaging and fast moving fantasy spectacle", "reviewBody": "I went in cynical about this, especially after the travesty that was the Narnia film, but i was quickly converted: it's great fun. A really entertaining and immersive film that intelligently builds a fantastical world that the uninitiated can marvel and thrill in. I have to say i haven't read the books so can't comment on a book to film comparison.\n\nOn the cast, I don't know how it works in the book but the adults are barely in this. Nicole has the most significant work and Sam Elliott, while a late arrival, is a great presence once he's around. However Daniel Craig and Eva Green are barely in it and Christopher Lee has one blink-and-you'll miss him scene. That said the casting is excellent. Green is suitably witchy and Craig makes an impact in his one/two dialogue scenes early on which, along with a couple of wordless inserts of his storyline, put him enough into your mind to wonder about him. He feels set up for a more significant role in future instalments. Elliott is great. That sonorous voice sneaking out from underneath that bushy moustache feels exactly right for Lee Scorsby.\n\nKidman is perfect. There's something indelibly creepy about her rigid manner that works for the elegant but sinister Mrs Coulter. Meanwhile Simon McBurney is magnificently slimy and loathsome as the magisterium main face. You know he's a villain from the moment he enters frame.\n\nDakota Blue Richards is a great find as Lara. While the first two Potter films and Lion, the Witch & the Wardrobe were significantly hampered by the incredibly mannered, unrealistic, wooden acting of the young leads (most of the Potter cast got better, time will tell on Narnia) Richards is a winner from the outset. Precocious and feisty without seeming too forced she is generally believable whether is her rebellion or her loyalty. This is just as well as the film is really entirely on her shoulders. It will work or not for people based on whether you like her. She's in virtually every scene and has a lot of different emotions to get across as well as having to have significant interaction with CGI creations like her spirit animal Pan (the ubiquitous Freddie Highmore) and the polar bear played by Ian McKellen. She has a couple of slightly actorly moments but does incredibly well for a first timer under this kind of pressure.\n\nOf the voice-only cast McKellen is a perfect choice for the honourable polar bear while Highmore is either getting less annoying or it's just beneficial not being able to see him, as he is nicely understated as Pan. My only note on this casting would be once or twice I couldn't tell is Lyra or Pan was speaking in their interaction as in quiet moments Highmore and Richards' voices are remarkably similar!\n\nThe effects are good but not great. I had worried they'd be as weak as Narnia and they aren't. The world is beautifully created and always feels real, whether Scorsby's flying ship or the blimp thing from the trailer, or stunning Arctic landscapes and big cities. The smaller creatures are also brilliantly rendered, Pan in particular. Some of the bigger creatures are less perfect. The polar bears have a cartoony unreal feel but in a fantasy setting with battle armour and stuff they work well enough. Certainly better than Aslan in Narnia. However the leopard creature with Daniel Craig doesn't look right at all.\n\nAs for the film itself it really zips along quickly. The uninitiated (like me) may occasionally lose track of what's going on early on as strange terms and names are thrown back and forth but it soon settles down and makes sense. Rather than frustrating me that I might be missing key elements of what this world was about I felt happy going with it and was left thinking I'll watch it again when it's released just to be sure I didn't miss anything. It's a relief to see a fantasy film that brings it in at almost exactly two hours and has a cracking momentum, as opposed to the seemingly endless drag of Lord of the Rings, Harry Potter and Narnia. Don't get me wrong taking time can work. I really liked Fellowship of the Ring but the pace of the Potters really tests my patience. Golden Compass moves so fast before you know it it's over and it leaves you wanting more. Indeed at the end of this film I could say it had succeeded in doing something the Potter franchise has never done: it left me desperate to see the next one.\n\nHowever what really made me like this film more than those others is the tone and some of the things they do in it. There are moments in this, that i won't spoil for those like me who didn't know the plot, that really surprised me that they'd do in a family film.\n\nA big fight scene between polar bears and the end battle are suitably exciting and i found myself really invested. I cared about the characters. Whereas in Narnia they hadn't done enough to make you care about Aslan's fate (criminal given how effectively the book and the 80s BBC TV serial managed it) this really has you on the edge of your seat for the good guys.\n\nOverall I really liked Golden Compass and would give it an 8/10 \u0096 compared to LOTR 10/10, 9/10, 7/10 for the series, Potter 5/10, 6/10, 8/10, 7/10, 7/10 for the series and Narnia 4/10. I will be watching this again when it comes out (something I never did for Potter or Narnia) and am looking forward to the next instalment. I hope Daniel Craig and Eva Green get bigger roles in the next film, but all round a great start to a potential franchise that I had middling hopes for.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H53M", "trailer": {"@type": "VideoObject", "name": "The Golden Compass", "embedUrl": "/video/imdb/vi2813395225", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjEyNTQ1NzgwNF5BMl5BanBnXkFtZTYwMTIxODAz._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjEyNTQ1NzgwNF5BMl5BanBnXkFtZTYwMTIxODAz._V1_.jpg", "description": "The Golden Compass - Trailer", "uploadDate": "2007-09-13T07:02:02Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000173/?ref_=tt_cl_t1", "name": "Nicole Kidman"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm0000173?ref_=tt_cl_t1", "name": "Mrs. Coulter"}]}, {"actor": {"@type": "Person", "url": "/name/nm2301950/?ref_=tt_cl_t3", "name": "Dakota Blue Richards"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm2301950?ref_=tt_cl_t3", "name": "Lyra"}]}, {"actor": {"@type": "Person", "url": "/name/nm0383603/?ref_=tt_cl_t5", "name": "Freddie Highmore"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm0383603?ref_=tt_cl_t5", "name": "Pantalaimon"}]}, {"actor": {"@type": "Person", "url": "/name/nm1200692/?ref_=tt_cl_t7", "name": "Eva Green"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm1200692?ref_=tt_cl_t7", "name": "Serafina Pekkala"}]}, {"actor": {"@type": "Person", "url": "/name/nm0183822/?ref_=tt_cl_t9", "name": "Tom Courtenay"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm0183822?ref_=tt_cl_t9", "name": "Farder Coram"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000385/?ref_=tt_cl_t11", "name": "Sam Elliott"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm0000385?ref_=tt_cl_t11", "name": "Lee Scoresby"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000218/?ref_=tt_cl_t13", "name": "Kristin Scott Thomas"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm0000218?ref_=tt_cl_t13", "name": "Stelmaria"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000870/?ref_=tt_cl_t15", "name": "Kathy Bates"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm0000870?ref_=tt_cl_t15", "name": "Hester"}]}, {"actor": {"@type": "Person", "url": "/name/nm0185819/?ref_=tt_cl_t2", "name": "Daniel Craig"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm0185819?ref_=tt_cl_t2", "name": "Lord Asriel"}]}, {"actor": {"@type": "Person", "url": "/name/nm2036501/?ref_=tt_cl_t4", "name": "Ben Walker"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm2036501?ref_=tt_cl_t4", "name": "Roger"}]}, {"actor": {"@type": "Person", "url": "/name/nm0005212/?ref_=tt_cl_t6", "name": "Ian McKellen"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm0005212?ref_=tt_cl_t6", "name": "Iorek Byrnison"}]}, {"actor": {"@type": "Person", "url": "/name/nm0141697/?ref_=tt_cl_t8", "name": "Jim Carter"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm0141697?ref_=tt_cl_t8", "name": "John Faa"}]}, {"actor": {"@type": "Person", "url": "/name/nm0574534/?ref_=tt_cl_t10", "name": "Ian McShane"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm0574534?ref_=tt_cl_t10", "name": "Ragnar Sturlusson"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000489/?ref_=tt_cl_t12", "name": "Christopher Lee"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm0000489?ref_=tt_cl_t12", "name": "First High Councilor"}]}, {"actor": {"@type": "Person", "url": "/name/nm0211767/?ref_=tt_cl_t14", "name": "Edward de Souza"}, "character_and_episodes": [{"url": "/title/tt0385752/characters/nm0211767?ref_=tt_cl_t14", "name": "Second High Councilor"}]}]}