{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1198138/", "name": "Obsessed", "image": "https://m.media-amazon.com/images/M/MV5BMjAwOTM2MzE5MF5BMl5BanBnXkFtZTcwMjM0NTcyMg@@._V1_.jpg", "genre": ["Drama", "Romance", "Thriller"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0461498/", "name": "Beyoncé"}, {"@type": "Person", "url": "/name/nm0252961/", "name": "Idris Elba"}, {"@type": "Person", "url": "/name/nm0005123/", "name": "Ali Larter"}, {"@type": "Person", "url": "/name/nm0005278/", "name": "Jerry O'Connell"}], "director": {"@type": "Person", "url": "/name/nm0793455/", "name": "Steve Shill"}, "creator": [{"@type": "Person", "url": "/name/nm0521739/", "name": "David Loughery"}, {"@type": "Organization", "url": "/company/co0010568/"}, {"@type": "Organization", "url": "/company/co0045552/"}], "description": "Obsessed is a movie starring Beyoncé, Idris Elba, and Ali Larter. A successful asset manager, who has just received a huge promotion, is blissfully happy in his career and in his marriage. But when a temp worker starts stalking him,...", "datePublished": "2009-04-24", "keywords": "temp worker,blonde,stalking,erotomania,sexually frustrated female", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 30127, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1198138/"}, "author": {"@type": "Person", "name": "Anonymous_Maxine"}, "dateCreated": "2009-05-02", "inLanguage": "English", "name": "f.", "reviewBody": "Remember that movie Wild Wild West? Will Smith has said that that movie is one of his biggest regrets, because it opened at #1 even though it sucked, and he said he hated knowing that so many people were spending their money to watch a movie that wasn't good. At the time I'm writing this, Obsessed is the #1 movie in the American box office, and I'm wondering if, for example, Beyonce feels as guilty as Will Smith did, because Wild Wild West is about ten times better than this snoozefest. Personally I doubt she has the acting chops to even realize how god-awful this thing is. \n\nI've seen some backwards thrillers in my time but THIS\u0085I care hardly think of where to start. My first question is for Beyonce. I'm wondering if, when she signed on to play the wife of a man stalked by a psychotic blonde, if she knew that her character would ultimately turn out to be just as psychotic as the psychotic one. I'm guessing yes, because here's a direct quote from her character late in the movie – \"You think you're crazy? I'll show you crazy!\"\n\nWow.\n\nIf you want to watch Ali Larter squeezing her limited talents into the form of a badly written blonde with some relationship issues and Beyonce talking all tough to her (and to her husband), you might enjoy this movie. Every once in a while a movie comes along that is so flawlessly terrible that the perfection of the way the badness fits together becomes a fascinating area of study. This is one of those times.\n\nSharon is married to Derek who has a new employee at his work, a crazy hot blonde named Lisa who was recently hired on from a temp agency. She falls in love with Derek and forms a fantasy in her head that she and Derek are together, blah blah blah blah. The movie is called Obsessed and stars two women and one man. You don't really need to know anything else in order to know everything there is to know about the movie, except how bad it is. Sadly, you have to watch it to find that out. \n\nOne of my favorite things was that the movie is as suspenseless as any movie I've ever seen, and yet the suspense music kicks up constantly and I guess we're supposed to scoot forward to the edge of our seats and get all worried and whatnot. There's a scene when Lisa e-mails a picture of herself to Derek which opens itself in a dozen windows as soon as he opens the e-mail, and the orchestra kicks in frantically as Derek slowly clicks them each closed, his wife only seconds away.\n\nDid anyone else laugh at this? First of all, why would you slowly click them closed one by one? Does he know nothing about computers? ALT-F4, man!! Or if it's a Mac, Command-W!! But of course, if he knew how to close windows like that then we would have missed out on the sheer tension of watching this guy about to suffer the wrath of Beyonce. They actually tried to generate TENSION by having a guy struggling to close windows on his computer before his wife sees it!! HAHAHAHAHAHAAA!!!\n\nThen again, with a wife as horrific as Beyonce's character, maybe it's a good idea to fear her hysterical wrath. She does, after all, kick him out of HIS OWN HOUSE for three months because she thinks. Not KNOWS, mind you. She SUSPECTS that he had an affair. And when I say his own house, I mean the beautiful, multi-million dollar mansion that they live in, with the sleek new Escalade parked out front. \n\nThis woman, ladies and gentlemen, is a COLLEGE STUDENT. I have trouble relating to a man who would suffer so much ridiculous punishment at the hands of an insecure and violently suspicious woman, and still beg on his hands an knees for her to take him back. \n\nIn order for a movie like this to work, you have to care about the characters, that's obvious, but it's impossible here. Obsessed has nothing going for it. It's a movie about one poor guy with two psychotic women around him and I'm going to go ahead and suggest that it's just not possible to make a good movie when your basic premise is so overflowing with the yawn-inducing clichés of cheap, no-rent thrillers. \n\nIt is informative that Obsessed comes from David Loughery, the same screenwriter who gave us the highly disappointing thriller Lakeview Terrace last year. Obsessed is pretty much exactly the same story, except Lakeview Terrace was about a black neighbor angry at his interracial neighbors. Now we have a black wife going crazy at her black husband's white stalker. Set your watch to beep every ten minutes or so to make sure you can stay awake. It was a struggle for me!\n\nEven worse, I'm not sure who the target is. Angry black women who hate skinny, smart-ass blondes? Maybe. Word has it that the original title was \"Oh No She Didn't,\" which would at least have been amusing and advertised right away that the whole movie is a joke. If they had made this a parody, I really think it could have been good, but it takes itself super- seriously, even when challenging us not to laugh at Beyonce flinging Ali Larter all over her house, or not to cringe when she viciously berates her boyfriend, for whom she has not the wispiest scrap of trust but who has committed no crime. The most effective thing that the movie does is convince me beyond a shadow of a doubt that if I ever find myself dating Beyonce I will throw myself in front of the nearest train.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "2"}}, "duration": "PT1H48M", "trailer": {"@type": "VideoObject", "name": "Obsessed: Trailer", "embedUrl": "/video/imdb/vi1574961945", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTk2MzA2MDkwM15BMl5BanBnXkFtZTcwMzQ0NTEyMg@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTk2MzA2MDkwM15BMl5BanBnXkFtZTcwMzQ0NTEyMg@@._V1_.jpg", "description": "A successful business man (Elba) with a beautiful wife (Knowles) becomes the target of a female stalker (Larter).", "uploadDate": "2008-12-24T12:14:30Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0252961/?ref_=tt_cl_t1", "name": "Idris Elba"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm0252961?ref_=tt_cl_t1", "name": "Derek"}]}, {"actor": {"@type": "Person", "url": "/name/nm0005123/?ref_=tt_cl_t3", "name": "Ali Larter"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm0005123?ref_=tt_cl_t3", "name": "Lisa"}]}, {"actor": {"@type": "Person", "url": "/name/nm1635154/?ref_=tt_cl_t5", "name": "Bonnie Perlman"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm1635154?ref_=tt_cl_t5", "name": "Marge"}]}, {"actor": {"@type": "Person", "url": "/name/nm3385764/?ref_=tt_cl_t7", "name": "Nathan Myers"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm3385764?ref_=tt_cl_t7", "name": "Kyle"}]}, {"actor": {"@type": "Person", "url": "/name/nm2117893/?ref_=tt_cl_t9", "name": "Matthew Humphreys"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm2117893?ref_=tt_cl_t9", "name": "Patrick"}]}, {"actor": {"@type": "Person", "url": "/name/nm0748483/?ref_=tt_cl_t11", "name": "Richard Ruccolo"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm0748483?ref_=tt_cl_t11", "name": "Hank"}]}, {"actor": {"@type": "Person", "url": "/name/nm0556335/?ref_=tt_cl_t13", "name": "Nelson Mashita"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm0556335?ref_=tt_cl_t13", "name": "Doctor"}]}, {"actor": {"@type": "Person", "url": "/name/nm0737318/?ref_=tt_cl_t15", "name": "Ron Roggé"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm0737318?ref_=tt_cl_t15", "name": "Roger"}]}, {"actor": {"@type": "Person", "url": "/name/nm0461498/?ref_=tt_cl_t2", "name": "Beyoncé"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm0461498?ref_=tt_cl_t2", "name": "Sharon"}]}, {"actor": {"@type": "Person", "url": "/name/nm0005278/?ref_=tt_cl_t4", "name": "Jerry O'Connell"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm0005278?ref_=tt_cl_t4", "name": "Ben"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001441/?ref_=tt_cl_t6", "name": "Christine Lahti"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm0001441?ref_=tt_cl_t6", "name": "Reese"}]}, {"actor": {"@type": "Person", "url": "/name/nm3385834/?ref_=tt_cl_t8", "name": "Nicolas Myers"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm3385834?ref_=tt_cl_t8", "name": "Kyle"}]}, {"actor": {"@type": "Person", "url": "/name/nm0174021/?ref_=tt_cl_t10", "name": "Scout Taylor-Compton"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm0174021?ref_=tt_cl_t10", "name": "Samantha"}]}, {"actor": {"@type": "Person", "url": "/name/nm1757199/?ref_=tt_cl_t12", "name": "Bryan Ross"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm1757199?ref_=tt_cl_t12", "name": "Security Man"}]}, {"actor": {"@type": "Person", "url": "/name/nm0569226/?ref_=tt_cl_t14", "name": "Bruce McGill"}, "character_and_episodes": [{"url": "/title/tt1198138/characters/nm0569226?ref_=tt_cl_t14", "name": "Joe Gage"}]}]}