{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt4068576/", "name": "The Nightingale", "image": "https://m.media-amazon.com/images/M/MV5BNjVmZmY1NmQtMWNhZS00ZDUwLTk5ZTQtZGE4NWIyM2YwMDRiXkEyXkFqcGdeQXVyODY3Nzc0OTk@._V1_.jpg", "genre": ["Adventure", "Drama", "Horror", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm4957233/", "name": "Aisling Franciosi"}, {"@type": "Person", "url": "/name/nm8849491/", "name": "Baykali Ganambarr"}, {"@type": "Person", "url": "/name/nm0380632/", "name": "Damon Herriman"}, {"@type": "Person", "url": "/name/nm10879988/", "name": "Charlie Jampijinpa Brown"}], "director": {"@type": "Person", "url": "/name/nm0448768/", "name": "Jennifer Kent"}, "creator": [{"@type": "Person", "url": "/name/nm0448768/", "name": "Jennifer Kent"}, {"@type": "Organization", "url": "/company/co0375200/"}, {"@type": "Organization", "url": "/company/co0634932/"}, {"@type": "Organization", "url": "/company/co0175594/"}, {"@type": "Organization", "url": "/company/co0309252/"}, {"@type": "Organization", "url": "/company/co0251858/"}, {"@type": "Organization", "url": "/company/co0234956/"}, {"@type": "Organization", "url": "/company/co0221317/"}, {"@type": "Organization", "url": "/company/co0036887/"}, {"@type": "Organization", "url": "/company/co0465018/"}], "description": "The Nightingale is a movie starring Aisling Franciosi, Baykali Ganambarr, and Damon Herriman. Set in 1825, Clare, a young Irish convict woman, chases a British officer through the rugged Tasmanian wilderness, bent on revenge for a...", "datePublished": "2019-08-29", "keywords": "rape,19th century,murder,revenge,female protagonist", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 22244, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt4068576/"}, "author": {"@type": "Person", "name": "Bertaut"}, "dateCreated": "2019-12-15", "inLanguage": "English", "name": "A superb, albeit harrowing drama about colonial violence, misogyny, and racism", "reviewBody": "Written and directed by Jennifer Kent, on the surface, The Nightingale is very much a genre picture - a rape/revenge drama set in a pseudo-western milieu. However, as it progresses, it gradually reveals itself as less concerned with hitting genre beats than engaging with issues such as racism, misogyny, the fine line between barbarism and civilisation, and the cathartic potential of revenge (or possible lack thereof). Much as Kent's debut, the exceptional The Babadook (2014), was a horror in name only, its genre serving as a means to a thematic end, so too with The Nightingale. Brutally violent (but never gratuitously so), extremely unpleasant, and downright nihilistic at times, it's not going to pack them in at the multiplex, but this is an important, relevant, and mature study of mans' innate capacity for cruelty.\n\nVan Diemen's Land, 1825. A British penal colony, the island is in the midst of the Black War, with the British army attempting to eradicate the indigenous Palawa population. In an isolated colony, Clare Carroll (a star-making turn from Aisling Franciosi) and her husband Aidan (Michael Sheasby) are Irish convicts with an infant daughter, indentured to garrison commander Lt. Hawkins (an odious Sam Claflin). Convicted of petty theft in Ireland over seven years prior, Clare has served her sentence and is waiting for Hawkins to sign her long overdue letter of recommendation, which would render her and Aidan free citizens. However, Hawkins, who calls her his Nightingale on account of her beautiful singing voice, responds by raping her, and not for the first time. The following night, Aidan drinks too much and gets into a brawl with Hawkins, the sadistic Sgt. Ruse (Damon Herriman), and the naïve Pvt. Jago (Harry Greenwood). Happening in front of a visiting superior officer who's evaluating Hawkins for promotion, the officer tells Hawkins he won't be recommending him. Infuriated, Hawkins orders Ruse and Jago to accompany him on foot through the treacherous bush to Launceston, where he intends to make an in-person appeal for promotion to army brass. However, before they leave, Hawkins and Ruse rape Clare and brutalise Aidan and the baby. And so, determined to exact revenge, she sets off in pursuit of the trio, hiring \"Billy\" Mangana (an exceptional debut from dancer Baykali Ganambarr), a Palawa tracker who hates whites as much as Clare hates Hawkins.\n\nHaving spent over five years researching the frontier wars, Kent made The Nightingale in collaboration with Palawa elders, with the story of Clare and Billy serving as Australia-specific synecdoche for the general oppression and violence of British colonialism. Both Clare and Billy have been deeply wronged by colonialists - her as a convict and woman, him as a Palawa. However, one of Kent's masterstrokes is to complicate their dynamic, whereby neither is capable of seeing their similarity to the other. When Clare is first told she'll need a Palawa tracker, she responds, \"I'm not travelling with a black. I'll end up in someone's pot of dinner\". And in literally the next scene, when Clare tries to hire Billy, his response is, \"I'm not working for a bloody white woman.\" It doesn't matter to him that Clare is in Van Diemen's Land against her will - she's part of the white race that has murdered his people and taken his land. At the same time, her view of him is based on the crudest of colonial stereotypes - that all Aborigines are cannibalistic savages. Indeed, she exerts her authority over him in a not entirely dissimilar manner to how Hawkins exerts his authority over her.\n\nHowever, it's not exactly a spoiler to say that much of the film concerns itself with the duo coming to understand the oppression experienced by the other. Indeed, in one of the strongest scenes in the film, their first real connection comes as they sit at an open fire, each cursing their oppressors in their respective native tongue, linguistically rebelling by rejecting the colonial signifiers and codes.\n\nHawkins, for his part, is a representative of the worst aspects of British colonialism, not just the kind of jingoistic and xenophobic thinking that made such colonialism possible, but so too the misogyny, racism, and savagery that underpinned it. Crucially, however, he's utterly banal; believing himself destined for greatness, he's incapable of accepting that he's a poor officer, an amoral and mediocre man whose lofty ambitions infinitely outweigh his negligible potential. He's a symbol of the toxic masculinity that engendered colonialism, but so too is he a flesh-and-blood person; he's an irredeemable monster, of course, but he's never a pantomime villain.\n\nKent uses these character to examine whether revenge can lead to peace of mind. Does revenge provide fleeting satisfaction, even though it's ultimately futile, or is it a necessary and important part of the healing process? Most troublingly of all, however, she asks, irrespective of one's awareness of the heavy psychological cost of violent revenge, are there acts which are so abhorrent, inhuman, and evil that revenge is the only possible response. And if so, how does one reconcile the futility of revenge with its necessity?\n\nFrom an aesthetic point of view, The Nightingale looks exceptional. Kent and cinematographer Radek Ladczuk shot the film in Academy ratio (1.37:1), with the claustrophobic nearly square frame trapping the characters within it. Especially important here are the BCUs of faces, which are the film's roadmap insofar as the violence is never abstract; violence happens to a person, not a depersonalised body, and it has real consequences.\n\nSpeaking of which, much has been made of that violence. At both screenings at the Sydney Film Festival, multiple audience members walked out during the second rape, and North American distributors IFC included a trigger warning independent of the MPAA rating details. Personally, although I found the scenes disturbing, I didn't think they were as bad as has been made out, and if you've survived films such as The Last House on the Left (1972), Lilja 4-ever (2002), or Irréversible (2002), you'll be fine with The Nightingale. In any case, the violence (whether sexual or otherwise) is never gratuitous, exploitative, or immature - Kent is no Quentin Tarantino; violence in her work has stomach-churning consequences, and when she chooses to show such violence, there is always a point, it's never arbitrary, violence-for-violence's-sake, or worse, violence-for-titillation's-sake.\n\nIn terms of problems, as the Sydney screenings attest, the brutality on display will simply be too much for some. This is a dark, brutal, and unrelenting film and it asks a lot of the audience. Additionally, at 136 minutes, I found the film just a tad too long, and it does lapse into repetition from time to time - if the middle act had been tightened up a bit, cutting maybe 10 or 15 minutes, it would have played better. The dénouement is also somewhat rote, which is disappointing given the strength of the filmmaking leading us to that point. I wouldn't necessarily say it doesn't work, but it's the only part of the where it feels like a genre piece.\n\nThese issues aside, however, this is exceptionally strong filmmaking. With not a hint of sentimentality in its unflinching depiction of the horrors inherent in the subjugation of an entire people, The Nightingale confirms Kent as a major auteur with a distinctive voice and the courage to remain true to her subject-matter, however abhorrent such truth might be.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT2H16M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi4241931289", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZTJiOGNlYmYtOTA0NC00ZDI4LTg1MjgtNWIyMzg3MWVmOWZkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZTJiOGNlYmYtOTA0NC00ZDI4LTg1MjgtNWIyMzg3MWVmOWZkXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "A young woman in 1800's Australia seeks vengeance for horrific acts committed against her family.", "uploadDate": "2019-05-21T22:12:10Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm4957233/?ref_=tt_cl_t1", "name": "Aisling Franciosi"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm4957233?ref_=tt_cl_t1", "name": "Clare"}]}, {"actor": {"@type": "Person", "url": "/name/nm0380632/?ref_=tt_cl_t3", "name": "Damon Herriman"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm0380632?ref_=tt_cl_t3", "name": "Ruse"}]}, {"actor": {"@type": "Person", "url": "/name/nm2113423/?ref_=tt_cl_t5", "name": "Harry Greenwood"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm2113423?ref_=tt_cl_t5", "name": "Jago"}]}, {"actor": {"@type": "Person", "url": "/name/nm4650436/?ref_=tt_cl_t7", "name": "Michael Sheasby"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm4650436?ref_=tt_cl_t7", "name": "Aidan"}]}, {"actor": {"@type": "Person", "url": "/name/nm11583458/?ref_=tt_cl_t9", "name": "Maya Christie"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm11583458?ref_=tt_cl_t9", "name": "Baby Brigit"}]}, {"actor": {"@type": "Person", "url": "/name/nm3504152/?ref_=tt_cl_t11", "name": "Eloise Winestock"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm3504152?ref_=tt_cl_t11", "name": "Luddy"}]}, {"actor": {"@type": "Person", "url": "/name/nm11583459/?ref_=tt_cl_t13", "name": "Matthew Barker"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm11583459?ref_=tt_cl_t13", "name": "Goodwin's Ensign"}]}, {"actor": {"@type": "Person", "url": "/name/nm11583461/?ref_=tt_cl_t15", "name": "Ben Morton"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm11583461?ref_=tt_cl_t15", "name": "Wallace"}]}, {"actor": {"@type": "Person", "url": "/name/nm8849491/?ref_=tt_cl_t2", "name": "Baykali Ganambarr"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm8849491?ref_=tt_cl_t2", "name": "Billy"}]}, {"actor": {"@type": "Person", "url": "/name/nm10879988/?ref_=tt_cl_t4", "name": "Charlie Jampijinpa Brown"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm10879988?ref_=tt_cl_t4", "name": "Uncle Charlie"}]}, {"actor": {"@type": "Person", "url": "/name/nm0427772/?ref_=tt_cl_t6", "name": "Claire Jones"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm0427772?ref_=tt_cl_t6", "name": "Harriet"}]}, {"actor": {"@type": "Person", "url": "/name/nm11583457/?ref_=tt_cl_t8", "name": "Addison Christie"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm11583457?ref_=tt_cl_t8", "name": "Baby Brigit"}]}, {"actor": {"@type": "Person", "url": "/name/nm3510471/?ref_=tt_cl_t10", "name": "Sam Claflin"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm3510471?ref_=tt_cl_t10", "name": "Hawkins"}]}, {"actor": {"@type": "Person", "url": "/name/nm1191900/?ref_=tt_cl_t12", "name": "Ewen Leslie"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm1191900?ref_=tt_cl_t12", "name": "Goodwin"}]}, {"actor": {"@type": "Person", "url": "/name/nm11583460/?ref_=tt_cl_t14", "name": "Charles McCarthy"}, "character_and_episodes": [{"url": "/title/tt4068576/characters/nm11583460?ref_=tt_cl_t14", "name": "Convict Violinist"}]}]}