{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0059113/", "name": "Doctor Zhivago", "image": "https://m.media-amazon.com/images/M/MV5BNzdmZTk4MTktZmExNi00OWEwLTgxZDctNTE4NWMwNjc1Nzg2XkEyXkFqcGdeQXVyNjc1NTYyMjg@._V1_.jpg", "genre": ["Drama", "Romance", "War"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0001725/", "name": "Omar Sharif"}, {"@type": "Person", "url": "/name/nm0001046/", "name": "Julie Christie"}, {"@type": "Person", "url": "/name/nm0001036/", "name": "Geraldine Chaplin"}, {"@type": "Person", "url": "/name/nm0001768/", "name": "Rod Steiger"}], "director": {"@type": "Person", "url": "/name/nm0000180/", "name": "David Lean"}, "creator": [{"@type": "Person", "url": "/name/nm0664985/", "name": "Boris Pasternak"}, {"@type": "Person", "url": "/name/nm0004122/", "name": "Robert Bolt"}, {"@type": "Organization", "url": "/company/co0007143/"}, {"@type": "Organization", "url": "/company/co0233810/"}, {"@type": "Organization", "url": "/company/co0070605/"}], "description": "Doctor Zhivago is a movie starring Omar Sharif, Julie Christie, and Geraldine Chaplin. The life of a Russian physician and poet who, although married to another, falls in love with a political activist's wife and experiences...", "datePublished": "1965-12-31", "keywords": "poet,poetry,deportation,balalaika,love", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 70437, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0059113/"}, "author": {"@type": "Person", "name": "jhclues"}, "dateCreated": "2002-01-17", "inLanguage": "English", "name": "Magnificent Film!", "reviewBody": "Within the heart and mind of the true poet resides a grasp and perception of life and the human condition unequaled in it's purity by any other art form.  From Rimbaud to Frost to Jim Morrison, he will in a few words or lines create or recreate an experience, thereby enabling his audience to know that experience, as well, albeit vicariously.  The poet, of course, will choose the medium through which he will share his vision.  For director David Lean, that medium is the cinema; and with `Doctor Zhivago,' a film of sweeping and poetic grandeur, he reveals that within, he harbors the heart and soul of the poet.  Indisputably, this is the true nature of David Lean; and it is evident in every frame of this film from the beginning to end.\n\n\tTo borrow a line from the more recent `Moulin Rouge,' this is a story bout `love.'  A love story set against the backdrop of the Russian Revolution. Dr. Yuri Zhivago (Omar Sharif) is a general practitioner, but he is also a poet; through his vocation as a man of medicine, he tends to those in need in everyday real life.  But it is through his avocation as a poet that he expresses what he sees.  He marries Tonya (Geraldine Chaplin) and has children; but the War and revolution intervene, and it is during these tumultuous times that his life becomes inexorably intertwined with a government official, Komarovsky (Rod Steiger), a young revolutionary, Pasha (Tom Courtenay), his half-brother, Yevgraf (Alec Guinness), and finally, Lara (Julie Christie).  It's desperate times for Russians from all walks of life, and Zhivago does what he can to do what he can to keep the fragile threads of his life-- and of those around him-- intact.  But fate plays a hand, and in the end, even Zhivago must go where Destiny leads.\n\n\tWith `Zhivago,' David Lean has crafted and delivered a magnificent and monumental motion picture of epic proportions that at the same time is disarmingly intimate, rendered as a world within a world, with each a vital part of the other.  Lean blends actors, cinematography, story and music with his own compassionate perspective to create a true work of art; a work of true poetry.  In telling his story, he offers breathtaking visuals, like the awesome vistas of the snow-covered Urals, or a long shot of a wide open Russian plain with a solitary figure in the distance trudging through the snow, juxtaposed against the enormity of the landscape. \n\n \tOften, however, what he doesn't show you, but suggests, is even more effective and emotionally stirring.  Consider the scene in which a complement of mounted dragoons, sabres drawn, ride down upon a crowd peacefully demonstrating in the city streets; Lean sets it up so that you understand what is about to happen, then trains his camera on Zhivago, watching from a balcony overlooking the street as the carnage unfolds below. And in Zhivago's eyes, in the expression on his face, in his reaction to what he is witnessing, there is more horror because of what Lean has established in your imagination-- and which significantly enhances the impact of it-- than anything the most graphic visual depiction could have produced.  Similarly, when the Czar and his whole family are shot, Lean does not take you there; instead, you learn of it and realize the impact of it through the reaction of Alexander Gromeko (Ralph Richardson), Tonya's father, and it places it into a context that makes it all the more effective.  This is filmmaking at it's best, and an example of what makes Lean's films so memorable.\n\n\tPut a talented actor into the hands of a gifted director, and results of more than some distinction can be expected; and such is the case with Omar Sharif and David Lean.  In 1962, Sharif received a Best Supporting Actor nomination for his work in Lean's `Lawrence of Arabia,' and in `Zhivago,' Lean's next film, Sharif gives a sensitive, affecting performance for which he should have received a Best Actor nomination, but inexplicably, did not (It was Lee Marvin's year for `Cat Ballou').  Still, as Yuri Zhivago, he has never been better.  Sharif successfully manages to convey his deepest, internalized emotions, expressing them through the genuine compassion with which he imbues his character.  Lean allows his star the time he needs to share with his audience his appreciation of the beauty he perceives in the world around him, and it's in those pensive moments that we, in turn, perceive the inner beauty and poetic nature of the man.  You have but to look into Zhivago's eyes to know his sense of joy in all living things. It's a wonderful collaboration between actor and director that so vividly and poignantly brings this character to life.\n\n\t1965 was a career year for Julie Christie; she received the Oscar for Best Actress for her work in `Darling,' yet in this film created an even more enduring and memorable character in Lara (aided in no small part by the hauntingly lovely `Lara's Theme,' by Maurice Jarre, which indelibly etched Christie/Lara in the consciousness of `Zhivago's vast, international audience).  Lara's beauty is obvious, yet of a kind that goes much deeper than what you see on the surface; her station in life has made her vulnerable to misuse, but at the same time has endowed her with a strength born of necessity.  And Zhivago sees in her a quality and a resourcefulness that fulfills his romantic notions of perfection, and with a beguiling screen presence and a performance to match, Christie makes those notions credible and believable.  \n\n\tGuinness, Richardson and Courtenay are exceptional in their respective roles-- Lean without question knows how to get the best out of his actors-- and also turning in noteworthy performances are Siobhan McKenna (Anna), Rita Tushingham (The Girl) and Klaus Kinski, who is unforgettable as Kostoyed, manacled and designated for forced labor, yet the `Freest man on this train!'  One of Lean's greatest films.  10/10.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "10"}}, "duration": "PT3H17M", "trailer": {"@type": "VideoObject", "name": "Theatrical Trailer", "embedUrl": "/video/imdb/vi144226841", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BYjg4MzMwMDEtZDJhNC00Nzc0LWI0YjgtYzNlNzcyNThjYTQ2XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BYjg4MzMwMDEtZDJhNC00Nzc0LWI0YjgtYzNlNzcyNThjYTQ2XkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg", "uploadDate": "2018-10-15T21:25:50Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0001725/?ref_=tt_cl_t1", "name": "Omar Sharif"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0001725?ref_=tt_cl_t1", "name": "Yuri Andreyevich Zhivago"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001036/?ref_=tt_cl_t3", "name": "Geraldine Chaplin"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0001036?ref_=tt_cl_t3", "name": "Tonya Gromeko"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000027/?ref_=tt_cl_t5", "name": "Alec Guinness"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0000027?ref_=tt_cl_t5", "name": "Yevgraf"}]}, {"actor": {"@type": "Person", "url": "/name/nm0571430/?ref_=tt_cl_t7", "name": "Siobhan McKenna"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0571430?ref_=tt_cl_t7", "name": "Anna"}]}, {"actor": {"@type": "Person", "url": "/name/nm0878240/?ref_=tt_cl_t9", "name": "Rita Tushingham"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0878240?ref_=tt_cl_t9", "name": "The Girl"}]}, {"actor": {"@type": "Person", "url": "/name/nm0788779/?ref_=tt_cl_t11", "name": "Tarek Sharif"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0788779?ref_=tt_cl_t11", "name": "Yuri at 8 Years Old"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001428/?ref_=tt_cl_t13", "name": "Klaus Kinski"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0001428?ref_=tt_cl_t13", "name": "Kostoyed"}]}, {"actor": {"@type": "Person", "url": "/name/nm0932529/?ref_=tt_cl_t15", "name": "Noel Willman"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0932529?ref_=tt_cl_t15", "name": "Razin"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001046/?ref_=tt_cl_t2", "name": "Julie Christie"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0001046?ref_=tt_cl_t2", "name": "Lara"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001768/?ref_=tt_cl_t4", "name": "Rod Steiger"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0001768?ref_=tt_cl_t4", "name": "Victor Komarovsky"}]}, {"actor": {"@type": "Person", "url": "/name/nm0183822/?ref_=tt_cl_t6", "name": "Tom Courtenay"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0183822?ref_=tt_cl_t6", "name": "Pasha Antipov"}]}, {"actor": {"@type": "Person", "url": "/name/nm0724732/?ref_=tt_cl_t8", "name": "Ralph Richardson"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0724732?ref_=tt_cl_t8", "name": "Alexander"}]}, {"actor": {"@type": "Person", "url": "/name/nm0734276/?ref_=tt_cl_t10", "name": "Jeffrey Rockland"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0734276?ref_=tt_cl_t10", "name": "Sasha"}]}, {"actor": {"@type": "Person", "url": "/name/nm0443001/?ref_=tt_cl_t12", "name": "Bernard Kay"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0443001?ref_=tt_cl_t12", "name": "The Bolshevik"}]}, {"actor": {"@type": "Person", "url": "/name/nm0862677/?ref_=tt_cl_t14", "name": "Gérard Tichy"}, "character_and_episodes": [{"url": "/title/tt0059113/characters/nm0862677?ref_=tt_cl_t14", "name": "Liberius"}]}]}