{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0107211/", "name": "Indecent Proposal", "image": "https://m.media-amazon.com/images/M/MV5BODk3OWJhMTUtMTU2MC00ZjJmLTk2OGYtN2NiZGMxNmY4NzU3L2ltYWdlXkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Drama", "Romance"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000602/", "name": "Robert Redford"}, {"@type": "Person", "url": "/name/nm0000193/", "name": "Demi Moore"}, {"@type": "Person", "url": "/name/nm0000437/", "name": "Woody Harrelson"}, {"@type": "Person", "url": "/name/nm0001025/", "name": "Seymour Cassel"}], "director": {"@type": "Person", "url": "/name/nm0001490/", "name": "Adrian Lyne"}, "creator": [{"@type": "Person", "url": "/name/nm0257209/", "name": "Jack Engelhard"}, {"@type": "Person", "url": "/name/nm0427468/", "name": "Amy Holden Jones"}, {"@type": "Organization", "url": "/company/co0023400/"}], "description": "Indecent Proposal is a movie starring Robert Redford, Demi Moore, and Woody Harrelson. A billionaire offers one million dollars to a young married couple for one night with the wife.", "datePublished": "1993-04-07", "keywords": "paying for sex,female nudity,cunnilingus,worst picture razzie winner,husband watches wife have sex", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 64555, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0107211/"}, "author": {"@type": "Person", "name": "ElMaruecan82"}, "dateCreated": "2013-08-18", "inLanguage": "English", "name": "Pure subversive brilliance ...", "reviewBody": "What would you do if a billionaire were consenting to pay you one million dollars (or more) for one night with your wife? This is the titular \"Indecent Proposal\", on which millions of viewers, men and women, have been debating for years, placing themselves in the same tricky situation than David (Woody Harrelson) and Diana (Demi Moore), the ill-fated couple who met the devilishly sexy John Gage (Robert Redford) in Las Vegas. \n\nI remember when I was younger; there was a guy in my neighborhood who told me that in every woman, there was a potential prostitute. To confront him to his own contradictions, I carefully asked him whether that statement also applied to his family. The cynical macho nodded but felt the need to reformulate his thought, he meant that there was no woman in the world who wouldn't sleep with a man if she needed something, that's \"potential prostitution\" and I must confess I was almost convinced. And \"Indecent Proposal\" is all the more interesting because it confronts this option not to a woman, but a couple. The husband is part of the game and that's the strike of genius some distracted critics failed to grasp. \n\nThink about it: did Jack Engelheard, the author of the original novel of the same name, take for granted that a single woman wouldn't have thought twice before accepting the deal? I bet he did and I happen to think the same. Refusing wouldn't be honorable but stupid, and I'm sure many women would agree with me. We're speaking of one million dollars for a sumptuous night, and not with the ugliest man in the world. I bet when today's women visualize the myth of the Charming Prince, they rather picture Robert Redford (or Brad Pitt) as a billionaire than the nameless Princes of Disney classics. We'd all need money to achieve our dreams and selling one's soul for one night with one handsome rich guy and one million dollars isn't too high a price.\n\nBut the film is cleverly provocative because it already admits the venal nature of women, which provoked the anger of feminists. But I'd love to see them in Diana's heels. The question isn't whether they would have accepted the night for one million, but how about two or ten, how high could John Gage raise the stakes before they'd say yes? That was the point and we got it, money can buy a body, but how about love? It all comes to David. And that's the subtlety the angry mob of feminists missed just like the intellectually eminent critics: the film also highlights the very hypocrisy of men who brand any woman who sleeps with other men as 'broad' or 'whore', by confronting them to the same situation. And I would have loved to ask the question to my macho friend, what if he was in David's place? Wouldn't there be, after all, in every husband or boyfriend, a \"potential pimp\"?\n\nTo answer that, watching the film isn't even necessary, it's all part of cinematic pop-culture, and we all have an opinion on the subject. In fact, if Adrian Lyne's film had one merit, it was to feature one of the most memorable premises of Cinema's history and handle it with a believable mix of realism and romanticism. It is crucial within the context of the film, because the theme is so sleazy it had to be washed up by a poignant love story. And on that level, the chemistry between Harrelson and Moore worked and built our empathy toward this couple of sweethearts, watching the ashes of their fantasy dreams gone with the wind of the 90's crisis. In many other films, that the husband is an architect and the wife a real estate agent would only be details, but they're pivotal factd in \"Indecent Proposal\".\n\nIndeed, after the bursting of the US housing bubble, there was no offer for Diana and no demand for David. Inevitably, their descent into poverty guide their hopes toward Las Vegas, an interesting setting where two worlds coexist: people who need money and can't afford losing, and those who've got enough to lose one million a night without even caring. The film even succeeds to make a brilliant social commentary, behind the appearance of a cheap soft-porn flick; it subtly denounces the pervert aspects of liberalism, where free trade is synonym of salvation at the expenses of principles, totally worthless when money is at stakes. And the world sunk into liberal lows so eagerly it ended up giving a price to anything, and people have been so effectively brainwashed by greed and lust they would look now, at the half-full glass. Isn't there one word to say 'crisis' and 'opportunity' in Chinese? \n\nI live in a country where many beautiful girls, students or salaried, go out with mature men, because they buy them things they can't afford. Basically, they use their charm as an asset to overcome material problems. It's certainly what lured my macho friend into his certitude. But when you take the plot to a larger scope, you realize it's less the selling-your- body dilemma than the eternal selling-the-soul-to-the-devil story, doing something morally wrong for a pay-off. Movies are made to provide some interesting 'what if' situations? What if we lived the same day again and again? What if we hadn't existed? \"Indecent Proposal\" is the ultimate 'what if' asker because this time, we can respond to the plot and relate to the protagonists, even more because we live in a similar economic context, and the world is crazy enough to feature such characters as John Gage. And Redford finds the perfect tone for his character: subtly obnoxious but always charming, one hell of a tempter!\n\nAnd I guess part of the fascination doesn't come from our relief not to be in David and Diana's shoes but from our regret. And that, my friends, is pure subversive brilliance!", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H57M", "trailer": {"@type": "VideoObject", "name": "Official VHS Trailer", "embedUrl": "/video/imdb/vi2471804441", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BZDI4ZWIwYTctN2I4MS00NWFmLTk0YWQtNWY0ZGQ5NWQ3Mjc4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BZDI4ZWIwYTctN2I4MS00NWFmLTk0YWQtNWY0ZGQ5NWQ3Mjc4XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "uploadDate": "2020-08-11T16:30:31Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000602/?ref_=tt_cl_t1", "name": "Robert Redford"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0000602?ref_=tt_cl_t1", "name": "John"}, {"url": "/title/tt0107211/characters/nm0000602?ref_=tt_cl_t1", "name": "billionaire"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000437/?ref_=tt_cl_t3", "name": "Woody Harrelson"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0000437?ref_=tt_cl_t3", "name": "David Murphy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001624/?ref_=tt_cl_t5", "name": "Oliver Platt"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0001624?ref_=tt_cl_t5", "name": "Jeremy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0853067/?ref_=tt_cl_t7", "name": "Rip Taylor"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0853067?ref_=tt_cl_t7", "name": "Mr. Langford"}]}, {"actor": {"@type": "Person", "url": "/name/nm0112063/?ref_=tt_cl_t9", "name": "Joel Brooks"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0112063?ref_=tt_cl_t9", "name": "Realtor"}]}, {"actor": {"@type": "Person", "url": "/name/nm0957955/?ref_=tt_cl_t11", "name": "Danny Zorn"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0957955?ref_=tt_cl_t11", "name": "Screenwriter"}]}, {"actor": {"@type": "Person", "url": "/name/nm0392496/?ref_=tt_cl_t13", "name": "Pamela Holt"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0392496?ref_=tt_cl_t13", "name": "David's Girlfriend"}]}, {"actor": {"@type": "Person", "url": "/name/nm0182582/?ref_=tt_cl_t15", "name": "Mariclare Costello"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0182582?ref_=tt_cl_t15", "name": "David's Mother"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000193/?ref_=tt_cl_t2", "name": "Demi Moore"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0000193?ref_=tt_cl_t2", "name": "Diana Murphy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001025/?ref_=tt_cl_t4", "name": "Seymour Cassel"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0001025?ref_=tt_cl_t4", "name": "Mr. Shackleford"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000671/?ref_=tt_cl_t6", "name": "Billy Bob Thornton"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0000671?ref_=tt_cl_t6", "name": "Day Tripper"}]}, {"actor": {"@type": "Person", "url": "/name/nm0175262/?ref_=tt_cl_t8", "name": "Billy Connolly"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0175262?ref_=tt_cl_t8", "name": "Auction M.C."}]}, {"actor": {"@type": "Person", "url": "/name/nm0258527/?ref_=tt_cl_t10", "name": "Pierre Epstein"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0258527?ref_=tt_cl_t10", "name": "Van Buren"}]}, {"actor": {"@type": "Person", "url": "/name/nm0922182/?ref_=tt_cl_t12", "name": "Kevin West"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0922182?ref_=tt_cl_t12", "name": "Screenwriter"}]}, {"actor": {"@type": "Person", "url": "/name/nm0059743/?ref_=tt_cl_t14", "name": "Tommy Bush"}, "character_and_episodes": [{"url": "/title/tt0107211/characters/nm0059743?ref_=tt_cl_t14", "name": "David's Father"}]}]}