{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0364828/", "name": "Las Vegas", "image": "https://m.media-amazon.com/images/M/MV5BMTk2Mjc0NTM2N15BMl5BanBnXkFtZTcwNTI5OTU3MQ@@._V1_.jpg", "genre": ["Crime", "Drama"], "contentRating": "TV-14", "actor": [{"@type": "Person", "url": "/name/nm0241049/", "name": "Josh Duhamel"}, {"@type": "Person", "url": "/name/nm0001001/", "name": "James Caan"}, {"@type": "Person", "url": "/name/nm0504571/", "name": "James Lesure"}, {"@type": "Person", "url": "/name/nm0000522/", "name": "Vanessa Marcil"}], "creator": [{"@type": "Person", "url": "/name/nm0860155/", "name": "Gary Scott Thompson"}, {"@type": "Organization", "url": "/company/co0022762/"}, {"@type": "Organization", "url": "/company/co0129175/"}, {"@type": "Organization", "url": "/company/co0003158/"}, {"@type": "Organization", "url": "/company/co0120996/"}, {"@type": "Organization", "url": "/company/co0205804/"}, {"@type": "Organization", "url": "/company/co0328089/"}], "description": "Las Vegas is a TV series starring Josh Duhamel, James Caan, and James Lesure. Welcome to the Montecito Resort and Casino in Las Vegas, where you can do anything you want, but Ed Deline and his crack surveillance team will be...", "datePublished": "2003-09-22", "keywords": "surveillance camera,casino security,former marine,pit boss,limousine", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 26066, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0364828/"}, "author": {"@type": "Person", "name": "liquidcelluloid-1"}, "dateCreated": "2005-01-03", "inLanguage": "English", "name": "A solid, mindless guilty pleasure set apart by it's fast pace and a giddy shamelessness", "reviewBody": "Network: NBC; Genre: Guilty Pleasure/Drama; Content Rating: TV-14 (for violence and some sexual content); Classification: Contemporary (Star range: 1 - 4);\n\nSeason Reviewed: Seasons 3+\n\nWhen dividing genres into sub-genres you come up with all sorts of interesting combinations of show gimmicks. We have shows differentiated by a movie star actor in the lead role, the time period they are set in and now, with \"Las Vegas\", the city in which it is set. You could call it a locational show. It later continues with the short-lived \"Hawaii\" and the misbegotten \"LAX\". Created by Gary Scott Thompson, \"Las Vegas\" takes us on a cathartic trip to that exotic city in the sand. \n\nDespite the promos touting the star of the show is being the city itself, \"Vegas\" is set almost entirely in the walls and grounds of the Montecito casino centering around the head of security (James Caan), security agents (Josh Duhamel and James Lesher) and the event coordinators dealing with wacky guests and packed conventions. The team is often found using some microscopic gadgets and wild \"CSI\" techniques to spot cheaters, chasing down and/or beating up thugs, stripping off their clothes at the drop of a hat or lounging by the pool. \n\nIf you want to think while watching TV you will probably be repelled by the tedium before the halfway mark. \"Las Vegas\" isn't particularly dramatic, or exciting or humorous. It just is. It runs on the \"Baywatch\" engine, actually. It is a light and sound show. Anyone could do it. It's fluid digital effects are a notch cheaper than the state-of-the-art \"CSI\". They recall Thompson's equally vacuous film \"The Fast and the Furious\". \n\nYet, the show presents itself without a sense of self-importance. It has the giddy shamelessness of a pubescent teenager that hasn't yet discovered premium cable. Ironically, that is what sets it apart. Unlike the dull-as-dirt lifeguard exploits of that former series, \"Vegas\" is a lot less conversation and a lot more action. So to speak. The stories are absurd, self-contained and gimmicky. \"Boston Public\" absurd. While it doesn't evoke an emotion it is light-weight enough, goofy enough and (as cliché as it may sound) sexy enough to work as a solid guilty pleasure. It is the perfect show for those that want something to sit and let their eyes glaze over at after a long day at work. The Monday night time-slot suits it to a T. \n\nThe show still has those network mandated restraints that pull us in but quickly leave us unsatisfied. Watching it you'll just have to get used to the fact that this is another one of those shows where two people in the throws of passion are always going to be interrupted by someone walking in on them or one of them having a substantive revelation about the plot. If the stories where more compelling I wouldn't mind, but as it is that pesky plot is always getting in the way. To often, the show lazily brings in an obvious musical guest star to take over the closing duties with a concert (such as Mark McGrath) and do lots of self-referential mugging for the camera. While sometimes an episode jump-start, this autopilot scriptwriting dangerously recalls the high camp way the \"Full House\" gang always used to wander into a Beach Boys concert. \n\nI'd be lying if I said that the sight of Nikki Cox in this show doesn't make my heart skip a beat. For the first time she is not bending over backwards paining to be funny and the buxom young actress (able to make even the worst shows sustainable) actually looks comfortable in the role. I also like Vanessa Marcil's cold Sam. Babe-magnet Josh Duhamel fills the leading man role well; as does likable Lesher. Their buddy chemistry is the most fluid and authentic thing in the show. The fun thing about the \"Las Vegas\" world is that they transcend the show and can easily be plugged in anywhere. It seems appropriate to do some cross promotion and stick the characters in a football promo. They've even done the now rare network (syndication unfriendly) cross-over episode (with NBC's inexplicable hit \"Crossing Jordan\"). \n\nBeautiful people in scantly clad outfits, silly plots and a decent amount more character development than you'd expect. You may feel dirty the next morning, but \"Las Vegas\" is an appropriately shameless guilty pleasure without any false conceptions about itself. Fast-paced and well pitched for the slack-jawed Monday (or Friday) night masses. I wish it was more extreme - more absurd, more risqué and much more fun - but as it stands it's not a bad thing. \n\n* * ½ / 4"}, "trailer": {"@type": "VideoObject", "name": "Las Vegas: Season One - Uncut and Uncensored", "embedUrl": "/video/imdb/vi2593456409", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDBmMDNiNmYtYTg2OC00YTVlLWE4NWUtODA1YWZmMjgyNDBhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDBmMDNiNmYtYTg2OC00YTVlLWE4NWUtODA1YWZmMjgyNDBhXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Home Video Trailer from Universal Studios Home Entertainment", "uploadDate": "2008-04-11T14:58:07Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0241049/?ref_=tt_cl_t1", "name": "Josh Duhamel"}, "character_and_episodes": [{"url": "/title/tt0364828/characters/nm0241049?ref_=tt_cl_t1", "name": "Danny McCoy"}, {"url": "#", "name": "106 episodes, 2003-2008"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000522/?ref_=tt_cl_t3", "name": "Vanessa Marcil"}, "character_and_episodes": [{"url": "/title/tt0364828/characters/nm0000522?ref_=tt_cl_t3", "name": "Sam Marquez"}, {"url": "#", "name": "106 episodes, 2003-2008"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001001/?ref_=tt_cl_t5", "name": "James Caan"}, "character_and_episodes": [{"url": "/title/tt0364828/characters/nm0001001?ref_=tt_cl_t5", "name": "Ed Deline"}, {"url": "#", "name": "88 episodes, 2003-2007"}]}, {"actor": {"@type": "Person", "url": "/name/nm0519366/?ref_=tt_cl_t7", "name": "Mitch Longley"}, "character_and_episodes": [{"url": "/title/tt0364828/characters/nm0519366?ref_=tt_cl_t7", "name": "Mitch Sassen"}, {"url": "#", "name": "63 episodes, 2003-2008"}]}, {"actor": {"@type": "Person", "url": "/name/nm0504571/?ref_=tt_cl_t2", "name": "James Lesure"}, "character_and_episodes": [{"url": "/title/tt0364828/characters/nm0504571?ref_=tt_cl_t2", "name": "Mike Cannon"}, {"url": "#", "name": "106 episodes, 2003-2008"}]}, {"actor": {"@type": "Person", "url": "/name/nm0801356/?ref_=tt_cl_t4", "name": "Molly Sims"}, "character_and_episodes": [{"url": "/title/tt0364828/characters/nm0801356?ref_=tt_cl_t4", "name": "Delinda Deline"}, {"url": "#", "name": "106 episodes, 2003-2008"}]}, {"actor": {"@type": "Person", "url": "/name/nm0185178/?ref_=tt_cl_t6", "name": "Nikki Cox"}, "character_and_episodes": [{"url": "/title/tt0364828/characters/nm0185178?ref_=tt_cl_t6", "name": "Mary Connell"}, {"url": "#", "name": "87 episodes, 2003-2007"}]}, {"actor": {"@type": "Person", "url": "/name/nm0859720/?ref_=tt_cl_t8", "name": "Marsha Thomason"}, "character_and_episodes": [{"url": "/title/tt0364828/characters/nm0859720?ref_=tt_cl_t8", "name": "Nessa Holt"}, {"url": "#", "name": "47 episodes, 2003-2005"}]}]}