{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0920489/", "name": "Il commissario Montalbano", "image": "https://m.media-amazon.com/images/M/MV5BMmRjYTVkZjgtZmIwOC00ZDljLWE1MmEtMTllOTRmN2NjMzhkXkEyXkFqcGdeQXVyMTQ3Njg3MQ@@._V1_.jpg", "genre": ["Crime", "Drama", "Mystery"], "contentRating": "TV-14", "actor": [{"@type": "Person", "url": "/name/nm0956956/", "name": "Luca Zingaretti"}, {"@type": "Person", "url": "/name/nm0563686/", "name": "Peppino Mazzotta"}, {"@type": "Person", "url": "/name/nm0751574/", "name": "Angelo Russo"}, {"@type": "Person", "url": "/name/nm0090545/", "name": "Cesare Bocci"}], "description": "Il commissario Montalbano is a TV series starring Luca Zingaretti, Peppino Mazzotta, and Angelo Russo. Detective Montalbano solves crimes in Sicily.", "datePublished": "1999-05-06", "creator": [{"@type": "Organization", "url": "/company/co0108293/"}, {"@type": "Organization", "url": "/company/co0068775/"}], "keywords": "detective", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 3038, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0920489/"}, "author": {"@type": "Person", "name": "MetroVavin"}, "dateCreated": "2019-04-29", "inLanguage": "English", "name": "a thinking and feeling show about realistic people, magnificently done", "reviewBody": "I am trying to understand why I like this series so much, and look forward to each new episode. There is so much quality in every aspect of these films it's hard to say what specifically is so attractive about them. Although the characters and the texture is pretty much the same across the series, each film has its own significant theme that keeps it interesting. It's more a thinking and feeling show about realistic people, magnificently done, than a show about physical violence.\n\nWe follow patient detective work slowly unraveling an intriguing mystery with unforeseeable twists ad turns, never as is often the case with detective series, unrealistically improbable. The stories present intriguing puzzles, always neatly and plausibly solved at the end (unlike many TV mysteries).\n\nMany of the shows revolve around love stories, or multiple love stories. Romantic love is often the redeeming value in the lives of these people.\n\nMontalbano is a dedicated, conscientious detective who is above all kind-hearted and compassionate, often even with people who comitted the crimes. He does not hate or revile them, he understands them, which is exactly why is he is good at his job. He is not your typical hard-boiled, depressed detective. He enjoys life, and he loves people. He has a stable long distance relationship with a wonderful woman. He doesn't have any mysterious powers of observation like Holmes, or an amazing power of logical deduction like Poirot. He relies on the exhaustive collection of facts and his acute insight into human nature to unravel the crimes. Much of the time we are watching him interview witnesses; we learn the background facts when his trusty assistants come to his office to quickly brief him after days tedious research we never see. I suspect there is more footage of him ecstatically eating traditional Sicilian dishes, for he is a serious and picky food connoisseur, as of him looking for clues at the scene of the crime. He has a small but elegant home right on the beach. On his beach he takes a daily morning swim before savoring an espresso on his patio. In the evening, when she is in town, he makes love to his beautiful partner. After solving a case, having witnessed the depths of human suffering and injustice, he heals himself with long walks by the ocean.\n\nOne reason to watch movies is to see exotic places. The films are loaded with gorgeous cinematography of gorgeous Sicilian scenery and cityscapes, as well as many gorgeous actors. These shows have the production values of fine cinema more than of TV shows or made-for-TV movies.\n\nThe show is also hilarious at moments. The comedy is character based, the brilliant portrayals of the foibles of the various main characters depend equally on the writing and the acting. The characters are unforgettable like the cuisine, complex, spicy and rich. The actors portray them down to the bones.\n\nAnother big plus is that the show is a cross-section of Italian and Sicilian in particular, culture and society. You can see into the social issues, and the peoples lives, much more than you can by merely being a tourist. For example, some shows deal with the mafia, some with immigration, some with violence against women.\n\nI read a review that complained of the lack of action and violence. It's true, this is a detective series with the minimum of violence to move the story forward. The crimes of violence, and there are usually only one or two per episode, are portrayed in a way to capture the horror without any grind-house indulgence in sadism. I recall only one big shootout in all 34 episodes (through 2018). If you want violence and action, this is not the series for you. The stories are a chiaroscuro in which the acts of hatred and greed, that springboard the mystery plot, serve to bring forward contrasting love and compassion.\n\nIt also complained of overacting. If you have ever seen how people can react to the sudden and unexpected death of a parent, spouse or child, you know that this cannot be overacted. The performances are true. In many cases the sentiment is distilled, like wine into cognac, as is appropriate to portray the depths of feeling in a few moments on screen. People routinely bare their hearts to Montalbano, and so to us. This is a cross-section of human psychology, and a cross section requires cutting through the surface of reality to uncover the truth underneath.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0956956/?ref_=tt_cl_t1", "name": "Luca Zingaretti"}, "character_and_episodes": [{"url": "/title/tt0920489/characters/nm0956956?ref_=tt_cl_t1", "name": "Commissario Salvo Montalbano"}, {"url": "#", "name": "37 episodes, 1999-2021"}]}, {"actor": {"@type": "Person", "url": "/name/nm0751574/?ref_=tt_cl_t3", "name": "Angelo Russo"}, "character_and_episodes": [{"url": "/title/tt0920489/characters/nm0751574?ref_=tt_cl_t3", "name": "Agente Catarella"}, {"url": "#", "name": "37 episodes, 1999-2021"}]}, {"actor": {"@type": "Person", "url": "/name/nm0516268/?ref_=tt_cl_t5", "name": "Davide Lo Verde"}, "character_and_episodes": [{"url": "/title/tt0920489/characters/nm0516268?ref_=tt_cl_t5", "name": "Agente Galluzzo"}, {"url": "#", "name": "31 episodes, 1999-2020"}]}, {"actor": {"@type": "Person", "url": "/name/nm0674503/?ref_=tt_cl_t7", "name": "Marcello Perracchio"}, "character_and_episodes": [{"url": "/title/tt0920489/characters/nm0674503?ref_=tt_cl_t7", "name": "Dottor Pasquano"}, {"url": "#", "name": "28 episodes, 1999-2017"}]}, {"actor": {"@type": "Person", "url": "/name/nm2447625/?ref_=tt_cl_t9", "name": "Rosario Spata"}, "character_and_episodes": [{"url": "#", "name": "19 episodes, 2005-2020"}]}, {"actor": {"@type": "Person", "url": "/name/nm4370258/?ref_=tt_cl_t11", "name": "Aldo Messineo"}, "character_and_episodes": [{"url": "/title/tt0920489/characters/nm4370258?ref_=tt_cl_t11", "name": "Enzo"}, {"url": "#", "name": "15 episodes, 2011-2021"}]}, {"actor": {"@type": "Person", "url": "/name/nm0563686/?ref_=tt_cl_t2", "name": "Peppino Mazzotta"}, "character_and_episodes": [{"url": "/title/tt0920489/characters/nm0563686?ref_=tt_cl_t2", "name": "Ispettore Giuseppe Fazio"}, {"url": "#", "name": "37 episodes, 1999-2021"}]}, {"actor": {"@type": "Person", "url": "/name/nm0090545/?ref_=tt_cl_t4", "name": "Cesare Bocci"}, "character_and_episodes": [{"url": "/title/tt0920489/characters/nm0090545?ref_=tt_cl_t4", "name": "Mimì Augello"}, {"url": "#", "name": "36 episodes, 1999-2021"}]}, {"actor": {"@type": "Person", "url": "/name/nm0633507/?ref_=tt_cl_t6", "name": "Roberto Nobile"}, "character_and_episodes": [{"url": "/title/tt0920489/characters/nm0633507?ref_=tt_cl_t6", "name": "Nicolò Zito"}, {"url": "#", "name": "29 episodes, 1999-2019"}]}, {"actor": {"@type": "Person", "url": "/name/nm2498379/?ref_=tt_cl_t8", "name": "Luigi Caruso"}, "character_and_episodes": [{"url": "/title/tt0920489/characters/nm2498379?ref_=tt_cl_t8", "name": "Caruso"}, {"url": "#", "name": "22 episodes, 2005-2020"}]}, {"actor": {"@type": "Person", "url": "/name/nm0345331/?ref_=tt_cl_t10", "name": "Giovanni Guardiano"}, "character_and_episodes": [{"url": "/title/tt0920489/characters/nm0345331?ref_=tt_cl_t10", "name": "Jacomuzzi"}, {"url": "#", "name": "15 episodes, 1999-2020"}]}]}