{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0943326/", "name": "Naked Fear", "image": "https://m.media-amazon.com/images/M/MV5BMTM2MzYzMjk4Nl5BMl5BanBnXkFtZTcwMTA4MjE5Mw@@._V1_.jpg", "genre": ["Horror", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm2630818/", "name": "Sonja Runar"}, {"@type": "Person", "url": "/name/nm0241789/", "name": "Ronald Dunas"}, {"@type": "Person", "url": "/name/nm1377287/", "name": "Arron Shiver"}, {"@type": "Person", "url": "/name/nm0307267/", "name": "J.D. Garfield"}], "director": {"@type": "Person", "url": "/name/nm0248054/", "name": "Thom Eberhardt"}, "creator": [{"@type": "Person", "url": "/name/nm2524496/", "name": "Christine Vasquez"}, {"@type": "Organization", "url": "/company/co0198066/"}, {"@type": "Organization", "url": "/company/co0198040/"}], "description": "Naked Fear is a movie starring Sonja Runar, Ronald Dunas, and Arron Shiver. Diana arrives in a town to start a new job. She's threatened into working as an exotic dancer. She's later kidnapped and let loose naked in the wilderness...", "datePublished": "2007-04-01", "keywords": "breasts,stripper,serial killer,small town,strip club", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 2314, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "5.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0943326/"}, "author": {"@type": "Person", "name": "bbhlthph"}, "dateCreated": "2010-03-22", "inLanguage": "English", "name": "Not sleaze but true horror.", "reviewBody": "I seldom watch horror movies - natural disasters such as volcanoes, tisuni, hurricanes or earthquakes, together with violent crimes, serial killers and terrorist suicide bombers, provide enough real horror to make any fictional additions redundant. This leaves me no time for films about aliens, imaginary new diseases, and monsters from the deep or the swamp. Once I would have included many films featuring man's inhumanity to man in this no-no category, and some friends felt I was squeamish in my movie selections. This changed when Cecil DeMille's \"The Sign of the Cross\" was again released after many years on the forbidden list. Although the scenes from the Roman Arena may be tame by the standards of modern horror films with their digital sequences of human bodies exploding into pieces, this film involved the viewer in the lives of the characters in a way that only a few Directors still can today and I reacted with abhorrence. Later I realized DeMille was reminding us how little human nature had changed over the past millennium. Historically speaking most people today live in a very stable society and only by remaining continually cognisant of the depths to which the human ego can drive our behaviour can we hope for this to continue. Roman civilization was a long lasting stable society in which citizens lived in relative security under the rule of law. Romans came to appreciate that in order to maintain this it was necessary for every citizen to be aware of the sheer horror of the alternative, and this need was met by gradual evolution of public entertainment in the Arena from poetry readings to barbaric exhibitions of violence. For us today horror films in movie theatres serve the same purpose as the gladiatorial contests of the Roman Arena.\n\nSo much for psychology, discussed here only to help differentiate between horror and sleaze in our entertainment. If you enjoy good sleaze it is irrelevant and unhelpful - this was written for the many reviewers who have condemned Naked Fear for being downright sleazy, which it is not. It is the story of a girl who is raped by a madman and then set loose naked in a forest knowing that she has a 15min head start after which he hunts her down for \"sport\", and shoots her before she can tell the police. Films about people being hunted in this way go back a very long time but \"The Most Dangerous Game\", filmed concurrently with the original King Kong over 70 years ago, is still far the best (see my review in this database). I well remember the sense of shock and horror I felt when I first saw it. It had very well controlled changes in pace, well rounded characters - not just cardboard cutouts - and many carefully planned details, even down to the knocker on the door of the villain's home. By comparison, the many remakes have all been relatively crude. Of them, Naked Fear, released in 2007, is probably the best. It is based on the story of Robert Hansen, an Alaskan who raped and hunted 15 girl strippers in this way before he was caught. There are always a few men who use the services of prostitutes, but still feel they are so disgusting that the girls should be killed. Making us aware of how far a hypocritical attitude towards violence to prostitutes has permeated into our society was one of the objectives of this film, and there is no reason for calling it a sleazy remake of TMDG just because the victim was a girl who was stripped before she was hunted. This not only provides a link to real events, greatly increasing its sense of reality, but also adds to the horror viewers feel when they see the totally unprotected victim being released into a forest replete with sharp twigs, thorny shrubs, and dangerous wildlife. I doubt if any viewer can watch it without sensing how impossible it would be to flee effectively under such a handicap. No doubt Danielle de Luca was provided with some sort of stick on soles for her feet during the filming, but she was still very brave to accept such a role and I greatly admire her for doing so.\n\nAlthough a few badly lit night sequences leave the viewer guessing, the quality of this film comes closer to that of TMDG than most (if not all) of the other remakes released over the years, with its powerful final sequence effectively showing the deranging impact such encounters have on any victims who survive. The introductory sequences are long enough to give depth to the characters, and the actual hunt sequences are not overextended lasting about 20min with Diana clothed again and, perhaps more important, something round her feet for the last five of them. But at 108min overall this film remains too long, and does not maintain the tension achieved by TMDG which had the tautness of a 63min film. Its ending was overlong, overdark and overdrawn - the main climax was the scene on the rocks, the remainder was probably designed to fend off sexploitation charges. Overall I rate it at a solid six.and recommend it to everyone who enjoys horror films - particularly anyone believing these films require mythical monsters and or supernatural events to create real horror.\n\nOne may hope films dragging such subject matter out from under the curtain of obscurity may make it much less likely that characters such as Robert Picton (believed to have fed the bodies of more than 20 girls he killed to the pigs on his farm) can operate for so long before their atrocities are revealed.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H48M", "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm2630818/?ref_=tt_cl_t1", "name": "Sonja Runar"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm2630818?ref_=tt_cl_t1", "name": "First Victim"}]}, {"actor": {"@type": "Person", "url": "/name/nm1377287/?ref_=tt_cl_t3", "name": "Arron Shiver"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm1377287?ref_=tt_cl_t3", "name": "Dwight Terry"}]}, {"actor": {"@type": "Person", "url": "/name/nm0715765/?ref_=tt_cl_t5", "name": "Robyn Reede"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm0715765?ref_=tt_cl_t5", "name": "Waitress"}]}, {"actor": {"@type": "Person", "url": "/name/nm2184630/?ref_=tt_cl_t7", "name": "Danielle De Luca"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm2184630?ref_=tt_cl_t7", "name": "Diana Kelper"}]}, {"actor": {"@type": "Person", "url": "/name/nm2518470/?ref_=tt_cl_t9", "name": "Jenny Marlowe"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm2518470?ref_=tt_cl_t9", "name": "Karly Terry"}]}, {"actor": {"@type": "Person", "url": "/name/nm1899989/?ref_=tt_cl_t11", "name": "Lisa Hill"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm1899989?ref_=tt_cl_t11", "name": "Rita"}]}, {"actor": {"@type": "Person", "url": "/name/nm2519189/?ref_=tt_cl_t13", "name": "Ruben Garcia"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm2519189?ref_=tt_cl_t13", "name": "Deputy"}]}, {"actor": {"@type": "Person", "url": "/name/nm4201253/?ref_=tt_cl_t15", "name": "Kate Vasquez-Eberhardt"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm4201253?ref_=tt_cl_t15", "name": "Suzie Self"}]}, {"actor": {"@type": "Person", "url": "/name/nm0241789/?ref_=tt_cl_t2", "name": "Ronald Dunas"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm0241789?ref_=tt_cl_t2", "name": "Bob"}]}, {"actor": {"@type": "Person", "url": "/name/nm0307267/?ref_=tt_cl_t4", "name": "J.D. Garfield"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm0307267?ref_=tt_cl_t4", "name": "Colin Mandel"}]}, {"actor": {"@type": "Person", "url": "/name/nm2516790/?ref_=tt_cl_t6", "name": "Kalila Ceccarelli"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm2516790?ref_=tt_cl_t6", "name": "Bobbie"}]}, {"actor": {"@type": "Person", "url": "/name/nm2514503/?ref_=tt_cl_t8", "name": "Mel MacKaron"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm2514503?ref_=tt_cl_t8", "name": "Fred"}]}, {"actor": {"@type": "Person", "url": "/name/nm2388488/?ref_=tt_cl_t10", "name": "Rhett Lynch"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm2388488?ref_=tt_cl_t10", "name": "Jack"}]}, {"actor": {"@type": "Person", "url": "/name/nm2515740/?ref_=tt_cl_t12", "name": "Lourdez Gonzales"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm2515740?ref_=tt_cl_t12", "name": "Shopkeeper"}]}, {"actor": {"@type": "Person", "url": "/name/nm2641820/?ref_=tt_cl_t14", "name": "Rima Miller"}, "character_and_episodes": [{"url": "/title/tt0943326/characters/nm2641820?ref_=tt_cl_t14", "name": "Suzie's Mom"}]}]}