{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt5825380/", "name": "Wonder Wheel", "image": "https://m.media-amazon.com/images/M/MV5BMTA2NjAyMDIzMzleQTJeQWpwZ15BbWU4MDg1NTEwNjMy._V1_.jpg", "genre": "Drama", "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0005493/", "name": "Justin Timberlake"}, {"@type": "Person", "url": "/name/nm1017334/", "name": "Juno Temple"}, {"@type": "Person", "url": "/name/nm1478447/", "name": "Robert C. Kirk"}, {"@type": "Person", "url": "/name/nm0000701/", "name": "Kate Winslet"}], "director": {"@type": "Person", "url": "/name/nm0000095/", "name": "Woody Allen"}, "creator": [{"@type": "Person", "url": "/name/nm0000095/", "name": "Woody Allen"}, {"@type": "Organization", "url": "/company/co0319272/"}, {"@type": "Organization", "url": "/company/co0044777/"}, {"@type": "Organization", "url": "/company/co0000605/"}], "description": "Wonder Wheel is a movie starring Justin Timberlake, Juno Temple, and Robert C. Kirk. On Coney Island in the 1950s, a lifeguard tells the story of a middle-aged carousel operator, his beleaguered wife, and the visitor who turns their...", "datePublished": "2017-12-01", "keywords": "1950s,coney island,betrayal,unfaithful wife,affair", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 25731, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.2"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt5825380/"}, "author": {"@type": "Person", "name": "thesuspenseisterrible"}, "dateCreated": "2017-12-08", "inLanguage": "English", "name": "VERY GOOD FILM - ignore the politically trendy critics", "reviewBody": "Wonder Wheel is NOT Woody Allen's best film, it is a bit underdeveloped and has a major casting flaw, but it IS his best film in many years. I think his best films overall are Crimes and Misdemeanors, Hannah and Her Sisters, and Interiors.\n\nI am not a big fan of Blue Jasmine or Midnight in Paris, but I do think that both are decent films in some ways. Blue Jasmine was close to being great, but for me that film was histrionic in a way that I found uncaring, cold, heartless and even mocking in the treatment of Cate Blanchett's character Jasmine. Blanchett was wonderful in the role, but the audience was told to laugh AT her and not with her - and that I found to be a serious flaw in that film. To borrow from that film's obvious inspiration, A STREETCAR NAMED DESIRE - \"deliberate cruelty is not forgivable!\" - and I think Allen was cruel to his flawed protagonist whether he intended it or not.\n\nIn Wonder Wheel, Allen borrows obviously from O'Neil and Tennessee Williams, but puts his own dramatic twists to it. This film has humorous elements, but it is absolutely a drama and in my opinion his best drama in over 20 years.\n\nThe film starts off a bit clunky for the first few minutes, but if you give it your attention and get past the awkward Justin Timberlake intro, you will soon be engrossed in the characters, the set-up, and ultimately rewarded with a very honest exploration of DEEP PERSONAL DISAPPOINTMENT, jealousy, self-delusion and evil deception. Sound fun? Amazingly, the tragic lead character is actually very fun to watch, but you do feel sympathy for her despite the fact that she is her own worst enemy and in many ways the enemies of others, too. The character development of Ginny (Kate Winslet) is the best thing about the film. She is one of Woody Allen's most interesting creations in his entire career. She is absolutely a tragic character - NOT the hot mess rip off of Blue Jasmine that many critics are claiming! Ginny is a much richer, more sophisticated character, and Kate Winslet plays her with agonizing honesty. This is one of the top performances in Winslet's entire career, which says a lot. Belushi and Juno Temple are very good, too.\n\nThe film's biggest flaw is Justin Timberlake. He's not a bad actor, but he is very miscast here. He lacks the charisma for this particular character, and it doesn't help that his character is presented to the audience with a distracting storytelling device - talking directly to the audience as narrator. This movie would have been much better without that, and I wish Allen would have either made the lifeguard more humorous, or taken a sharper turn and made him more cunning. He was neither - too safely written AND portrayed, and it is the film's most obvious and main flaw, sadly.\n\nHowever, Kate Winslet is utterly captivating and you cannot take your eyes off her. There are many wonderful moments where she reveals Ginny in such sublime ways, in such subtle ways, that the louder moments have greater impact because really see and feel all sides to this tragic, very sad woman. My favorite scene in the film involved Winslet and Temple in a bedroom, just the two of them. The scene was completely breathtaking - and one of Allen's most superb moments in his career. Winslet takes this scene to a level of brilliance, and I don't think I will ever forget how it made me feel. It was shockingly naked and I felt like I was watching an emotional porno with Ginny baring all to the audience while at the same time concealing all and deceiving the character sitting next to her. An amazing achievement in writing and acting there, highlighted by brilliant cinematography.\n\nVittorio Storaro deserves tremendous credit for his extraordinary cinematography, particularly in the scene mentioned above. Together, he and Winslet have enriched Allen's latest film to a much higher glory that it would have otherwise achieved. The script is underdeveloped in areas, particularly pertaining to the lifeguard Mickey (Timberlake) and in a few other areas as well. That being said, this is otherwise a very good film, and in some moments it is a brilliant film. \n\nThe current wave of sexual politics sweeping over Hollywood at the moment has resulted in Allen being swept up, yet again, in sexual controversy. Based on facts made public long ago, Allen does not belong in that category, in my opinion. I believe him and I do not believe Dylan Farrow or Mia Farrow. I believe Dylan was coerced as a child by her vengeful mother, and as an adult continues to believe the lie that was fed to her. I believe the results of Woody Allen's voluntary polygraph test, I believe the findings of the court that found no evidence of wrong doing on his part, and I believe the timing of Mia Farrow's claim against him make it almost impossible to believe her story. I think her motive to destroy his life and career is obvious. \n\nI also think that in a few years time, after Allen is gone, the slew of critics who have trashed this film so unfairly, with such mob-driven, cowardly political blinders on, will look back with embarrassment when they realize it is a very personal and sophisticated drama and will probably one day be seen as Allen's best late-career film.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H41M", "trailer": {"@type": "VideoObject", "name": "Trailer", "embedUrl": "/video/imdb/vi3243358489", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMzkxMWE5MjEtODdlYS00NzE2LWJhMjEtMmFkZjdkYjdkNDYyXkEyXkFqcGdeQXVyMjM4OTI2MTU@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMzkxMWE5MjEtODdlYS00NzE2LWJhMjEtMmFkZjdkYjdkNDYyXkEyXkFqcGdeQXVyMjM4OTI2MTU@._V1_.jpg", "description": "On Coney Island in the 1950s, a lifeguard tells the story of a middle-aged carousel operator and his beleaguered wife.", "uploadDate": "2017-10-11T23:00:47Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0005493/?ref_=tt_cl_t1", "name": "Justin Timberlake"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm0005493?ref_=tt_cl_t1", "name": "Mickey"}]}, {"actor": {"@type": "Person", "url": "/name/nm1478447/?ref_=tt_cl_t3", "name": "Robert C. Kirk"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm1478447?ref_=tt_cl_t3", "name": "Boardwalk Vendor"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000902/?ref_=tt_cl_t5", "name": "Jim Belushi"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm0000902?ref_=tt_cl_t5", "name": "Humpty"}]}, {"actor": {"@type": "Person", "url": "/name/nm0634121/?ref_=tt_cl_t7", "name": "Tommy Nohilly"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm0634121?ref_=tt_cl_t7", "name": "Humpty's Friend"}]}, {"actor": {"@type": "Person", "url": "/name/nm0771993/?ref_=tt_cl_t9", "name": "Steve Schirripa"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm0771993?ref_=tt_cl_t9", "name": "Nick"}]}, {"actor": {"@type": "Person", "url": "/name/nm0347509/?ref_=tt_cl_t11", "name": "Tom Guiry"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm0347509?ref_=tt_cl_t11", "name": "Flirtatious Man at Ruby's"}]}, {"actor": {"@type": "Person", "url": "/name/nm1417576/?ref_=tt_cl_t13", "name": "Gregory Dann"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm1417576?ref_=tt_cl_t13", "name": "Fishing Buddy"}]}, {"actor": {"@type": "Person", "url": "/name/nm5268612/?ref_=tt_cl_t15", "name": "Michael Zegarski"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm5268612?ref_=tt_cl_t15", "name": "Fishing Buddy"}]}, {"actor": {"@type": "Person", "url": "/name/nm1017334/?ref_=tt_cl_t2", "name": "Juno Temple"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm1017334?ref_=tt_cl_t2", "name": "Carolina"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000701/?ref_=tt_cl_t4", "name": "Kate Winslet"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm0000701?ref_=tt_cl_t4", "name": "Ginny"}]}, {"actor": {"@type": "Person", "url": "/name/nm5375420/?ref_=tt_cl_t6", "name": "Jack Gore"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm5375420?ref_=tt_cl_t6", "name": "Richie"}]}, {"actor": {"@type": "Person", "url": "/name/nm0802831/?ref_=tt_cl_t8", "name": "Tony Sirico"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm0802831?ref_=tt_cl_t8", "name": "Angelo"}]}, {"actor": {"@type": "Person", "url": "/name/nm0235390/?ref_=tt_cl_t10", "name": "John Doumanian"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm0235390?ref_=tt_cl_t10", "name": "Ruby's Bartender"}]}, {"actor": {"@type": "Person", "url": "/name/nm0143295/?ref_=tt_cl_t12", "name": "Max Casella"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm0143295?ref_=tt_cl_t12", "name": "Fishing Buddy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0805653/?ref_=tt_cl_t14", "name": "Bobby Slayton"}, "character_and_episodes": [{"url": "/title/tt5825380/characters/nm0805653?ref_=tt_cl_t14", "name": "Fishing Buddy"}]}]}