{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0078607/", "name": "The Dukes of Hazzard", "image": "https://m.media-amazon.com/images/M/MV5BNDM3ZDQxMzctOWVhZC00ODk4LWJmOWQtMmE0YzFiYzdlNGI0XkEyXkFqcGdeQXVyMTYzMDM0NTU@._V1_.jpg", "genre": ["Action", "Comedy"], "contentRating": "PG", "actor": [{"@type": "Person", "url": "/name/nm0941374/", "name": "Tom Wopat"}, {"@type": "Person", "url": "/name/nm0773884/", "name": "John Schneider"}, {"@type": "Person", "url": "/name/nm0000280/", "name": "Catherine Bach"}, {"@type": "Person", "url": "/name/nm0701500/", "name": "Denver Pyle"}], "creator": [{"@type": "Person", "url": "/name/nm0907296/", "name": "Gy Waldron"}, {"@type": "Organization", "url": "/company/co0036958/"}, {"@type": "Organization", "url": "/company/co0089863/"}, {"@type": "Organization", "url": "/company/co0005035/"}], "description": "The Dukes of Hazzard is a TV series starring Tom Wopat, John Schneider, and Catherine Bach. The adventures of the fast-drivin', rubber-burnin' Duke boys of Hazzard County.", "datePublished": "1979-01-26", "keywords": "confederate flag,suntan pantyhose,hazzard county,georgia usa,1969 dodge charger", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 11604, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0078607/"}, "author": {"@type": "Person", "name": "jrm23july@aol.com"}, "dateCreated": "2006-02-24", "inLanguage": "English", "name": "The Dukes of Hazzard: Classic Slapstick, Satire, and Stupidity", "reviewBody": "\"The Dukes of Hazzard\" is- I reckon- one of TV's classics from the 1980's. This is a show with great stunts and stunt people pre-CGI special effects and some well-drawn out characters.\n\nThe problem with this show, is not that it is poorly written. Some of the plots are actually very good, and \"The Dukes\" is a better show than some of the other idiot sitcoms of TV's post Golden era, namely \"Batman\", \"Gilligan's Island\", and of course \"Sabrina the Teenage Witch\" of today.\n\nAdventure shows like \"Charlie's Angels\", \"Wonder Woman\", and \"Smallville\" of today have camp elements. But The Dukes of Hazzard is not just from time to time intentionally goofy, it is almost always intentionally stupid. The stupidity of the show smothers some tender moments between Uncle Jesse Duke (Denver Pyle), and his family, niece Daisy (Catherine Bach), and nephews Bo and Luke played by John Schneider and Tom Wopat.\n\nOccasionally there is some serious drama like when Uncle Jesse is almost in tears when he's about to lose his farm to the thoroughly underhanded Boss Hogg, or lose his boys to a bounty hunter who wants to put them away for life, or Bo and Luke trying to protect a beautiful young witness from the clenches of a rogue U.S. senator. But if these tender moments give the show any credibility as a real drama, it is abruptly smothered by lots of slapstick, stupidity, redneck humor, the dimwitted Sheriff Roscoe P. Cotraine (James Best) and the antics of the totally corrupt, bloated Boss Hogg.\n\nLong time character actor Sorrell Booke, unknown to most, but carrying credits from \"All in the Family\" among others plays the conniving, scheming, bloated, and thoroughly corrupt lawman of Hazzard County in the \"Dukes of Hazzard\". \"The Dukes\" was this actor's claim to fame, and Booke WAS \"The Dukes of Hazzard.\" After Booke's untimely death in 1994, the cast members got together for three reunion specials on CBS. It was clear the Booke's presence was sorely missed. These reunion shows were lamer than the General Lee at The Battle of Gettysburg and Custer's hope of defeating the Union army. Booke's absence proved that he was the center and most irreplaceable piece to this classic 1980's comedy/adventure.\n\nSome people down South like the \"Dukes\" for its fast cars chasing and colliding for half of every episode, or the hot chicks like Daisy Duke, or are intrigued by the luscious women that sometimes draw Bo and Luke into a trap. But none of that matters if you don't have an enormous presence like Booke's Boss Hogg in the middle to stir up trouble in ol' Hazzard County.\n\nBogg Hogg is not a demon, but he is a devil. he is cunning, conniving, shrewd, and very avaricious. He has this wrongful vendetta against Jesse Duke and is always scheming with yankees and no-gooders to rob Jesse of his farm and land. Yet Boss Hogg is not seen as a mean character, but as a buffoon. He has a monopoly over Hazzard County, and still has this obsession with foreclosing on the Duke farm, and getting Jesse Duke's two nephews \"thrown permanently in the clink\".\n\nSheriff Roscoe's \"little fat buddy\" also eats, and he eats, and he eats, and he eats, and he takes a cigar break, then he eats. He must consume about 20,000 calories per day. He takes pizza breaks, pigs knuckles breaks, eats ham hocks, and a family size portion of fried chicken in one sitting. A snack for him is a dozen kielbasa sausages with sauerkraut, or a sixteen scoop ice cream sundae with whipped cream, caramel, chocolate, strawberry, and butterscotch topping.\n\nAnd the dimwitted Sheriff Roscoe P. Cotraine, Doesn't Boss Hogg ever let this man eat? Maybe Roscoe can't properly carry out his duties as Sheriff because he's famished. For example Boss Hogg says \"Roscoe. Don't ever disturb me when I'm trying to use these here chopsticks, to enjoy me this here Chinese lunch ( a complete course with six egg rolls).\"\n\nJames Best as Sheriff Roscoe is the king of slapstick comedy, and his deputies are the princes. Roscoe is the perfect foil figure to the Duke boys, and could never catch them to help silence them during Boss Hogg's nefarious schemes. He'll trip and fall on his own shadow, or hit himself in the back of the neck with a shovel. The Dukes always overcome the blustering and deviancy of Boss Hogg to save him and Sheriff Cotraine from the clenches of the real dangerous criminals. Yet Hogg continues to play every trick in the book to swindle old Jesse Duke out is farm and send his two boys \"to the pokey\". When will he ever learn common decency?\n\n\"The Dukes of Hazzard\" is a show that thrives on intentional stupidity. This show is actually dumber than \"The Beverly Hillbillies\", a 1960's CBS classic with a lot of the same redneck silliness as the more modern \"Dukes\". I mean how many times can you go the right way down a one way street and encounter head on traffic? Unlike \"The Beverly Hillbillies\", \"The Dukes\" had charisma, character depth, charm and lots of color, and was very cartoonish. I mean how many people in rural Georgia have a sparkling red & orange car with an eight cylinder engine, and four wheel drive that can easily outrun a Sheriff or jump a river? Them Duke boys' car can do it."}, "trailer": {"@type": "VideoObject", "name": "Dukes of Hazzard: Seasons 1-7", "embedUrl": "/video/imdb/vi2040791321", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMDQxYTcyZjktYTNkMy00NzBkLThjYWItZDIwZWJkMjg3YzM1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMDQxYTcyZjktYTNkMy00NzBkLThjYWItZDIwZWJkMjg3YzM1XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Trailer for Dukes of Hazzard: Seasons 1-7", "uploadDate": "2008-04-11T13:58:16Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000280/?ref_=tt_cl_t1", "name": "Catherine Bach"}, "character_and_episodes": [{"url": "/title/tt0078607/characters/nm0000280?ref_=tt_cl_t1", "name": "Daisy Duke"}, {"url": "#", "name": "146 episodes, 1979-1985"}]}, {"actor": {"@type": "Person", "url": "/name/nm0095368/?ref_=tt_cl_t3", "name": "Sorrell Booke"}, "character_and_episodes": [{"url": "/title/tt0078607/characters/nm0095368?ref_=tt_cl_t3", "name": "Boss Hogg"}, {"url": "#", "name": "146 episodes, 1979-1985"}]}, {"actor": {"@type": "Person", "url": "/name/nm0427549/?ref_=tt_cl_t5", "name": "Ben Jones"}, "character_and_episodes": [{"url": "/title/tt0078607/characters/nm0427549?ref_=tt_cl_t5", "name": "Cooter"}, {"url": "#", "name": "142 episodes, 1979-1985"}]}, {"actor": {"@type": "Person", "url": "/name/nm0941374/?ref_=tt_cl_t7", "name": "Tom Wopat"}, "character_and_episodes": [{"url": "/title/tt0078607/characters/nm0941374?ref_=tt_cl_t7", "name": "Luke Duke"}, {"url": "#", "name": "128 episodes, 1979-1985"}]}, {"actor": {"@type": "Person", "url": "/name/nm0795449/?ref_=tt_cl_t9", "name": "Sonny Shroyer"}, "character_and_episodes": [{"url": "/title/tt0078607/characters/nm0795449?ref_=tt_cl_t9", "name": "Enos"}, {"url": "#", "name": "98 episodes, 1979-1985"}]}, {"actor": {"@type": "Person", "url": "/name/nm0701500/?ref_=tt_cl_t2", "name": "Denver Pyle"}, "character_and_episodes": [{"url": "/title/tt0078607/characters/nm0701500?ref_=tt_cl_t2", "name": "Uncle Jesse"}, {"url": "#", "name": "146 episodes, 1979-1985"}]}, {"actor": {"@type": "Person", "url": "/name/nm0421261/?ref_=tt_cl_t4", "name": "Waylon Jennings"}, "character_and_episodes": [{"url": "/title/tt0078607/characters/nm0421261?ref_=tt_cl_t4", "name": "The Balladeer"}, {"url": "#", "name": "144 episodes, 1979-1985"}]}, {"actor": {"@type": "Person", "url": "/name/nm0078940/?ref_=tt_cl_t6", "name": "James Best"}, "character_and_episodes": [{"url": "/title/tt0078607/characters/nm0078940?ref_=tt_cl_t6", "name": "Sheriff Rosco Coltrane"}, {"url": "#", "name": "141 episodes, 1979-1985"}]}, {"actor": {"@type": "Person", "url": "/name/nm0773884/?ref_=tt_cl_t8", "name": "John Schneider"}, "character_and_episodes": [{"url": "/title/tt0078607/characters/nm0773884?ref_=tt_cl_t8", "name": "Bo Duke"}, {"url": "#", "name": "128 episodes, 1979-1985"}]}, {"actor": {"@type": "Person", "url": "/name/nm0403647/?ref_=tt_cl_t10", "name": "Rick Hurst"}, "character_and_episodes": [{"url": "/title/tt0078607/characters/nm0403647?ref_=tt_cl_t10", "name": "Cletus"}, {"url": "#", "name": "55 episodes, 1979-1982"}]}]}