{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0101205/", "name": "Step by Step", "image": "https://m.media-amazon.com/images/M/MV5BNmI3N2Q5MWQtNTg0OS00NjVlLThjZWEtOGRkZDdjOGM4NWU4XkEyXkFqcGdeQXVyMjExMjk0ODk@._V1_.jpg", "genre": ["Comedy", "Family", "Romance"], "contentRating": "TV-G", "actor": [{"@type": "Person", "url": "/name/nm0001155/", "name": "Patrick Duffy"}, {"@type": "Person", "url": "/name/nm0001755/", "name": "Suzanne Somers"}, {"@type": "Person", "url": "/name/nm0130085/", "name": "Brandon Call"}, {"@type": "Person", "url": "/name/nm0443824/", "name": "Staci Keanan"}], "creator": [{"@type": "Person", "url": "/name/nm0081065/", "name": "William Bickley"}, {"@type": "Person", "url": "/name/nm0102122/", "name": "Robert L. Boyett"}, {"@type": "Person", "url": "/name/nm0589429/", "name": "Thomas L. Miller"}, {"@type": "Person", "url": "/name/nm0912968/", "name": "Michael Warren"}, {"@type": "Organization", "url": "/company/co0067313/"}, {"@type": "Organization", "url": "/company/co0094448/"}, {"@type": "Organization", "url": "/company/co0029891/"}, {"@type": "Organization", "url": "/company/co0005035/"}], "description": "Step by Step is a TV series starring Patrick Duffy, Suzanne Somers, and Brandon Call. Two families become one, step by step.", "datePublished": "1991-09-20", "keywords": "boy,mother daughter relationship,mother son relationship,father daughter relationship,father son relationship", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 12811, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0101205/"}, "author": {"@type": "Person", "name": "velvets203"}, "dateCreated": "2004-12-17", "inLanguage": "English", "name": "Remember those Friday Nights???.....", "reviewBody": "Step By Step was a typical, TGIF, ABC sitcom of the era. Stereotypical characters run rampant on the show, but let us remember the REAL reason it lasted seven years. The show's creators knew that they had TV gold when they enlisted TV veterans Duffy (Dallas) and Sommers (Three's Company) to play the role of Mom and Dad. Now, parents of young preteens and teens could watch the show with their kids and have \"adult\" eye candy to gaze upon. One cannot discount both of their abilities as all-time television sex symbols. Nor the casting of Staci Keanan, the cute as a button girl from \"My Two Dads\". These three vets allowed for the creators to not worry about finding good writers or creative ideas, but ride the wave of the familiar faces. As for the characters, with so many kids, all stereotypes are fully represented. The \"best\" (or worst) has to go to Cody (Sasha Mitchell). He alone dropped the comedic IQ of this show from average to pathetic. His \"dude\", \"whoah\" and \"wow\" is more than 50% of his total dialouge. Although an idiot is found on nearly every sitcom post 1980, Cody may take the cake for the worst written. Besides not being a real child of the family (he's a cousin) and living in a van in the garage, Cody doesn't do much but walk in and marvel at something he finds interesting, say one of the three words, nod his head crazy, and move on. The writing/acting makes \"Bill and Ted\" (who had to help inspire the role) look like Mensa members. Keanan acts well for her part as the intelligent anti-male, with Angela Watson portraying the hot ditz with adequate flair and substance. Christine Lakin also acts well as the tomboy (AL), then Hottie in a tomboy's body in the later years. The women overcame bad writing with being gorgeous and actually acting the part they were given, knowing the roles they needed to fill. However, the guys in the show really didn't hold up to the bargain. Castille IS the biggest wimp in TV history as Mark, and Brendan (Josh Byrne) came across as nearly retarded in trying to get out his lines. Only JT (Brandon Call), the smart-witted, no common sense son actually gets what he is trying to convey as the \"this is the way it was, and will be\" attitude towards the family, as well as being a perfect beta-male in the house. I always wondered why NONE of the guys was an \"IT\" guy, like Karen the model, cheerleader-esquire character. All the guys seemed to be wimps, losers, and dorks who just could not get what they wanted. Had JT been the ladies man, Big man on campus guy, I feel the show would have added a nice dimension. Anyways, the characters in the show all live up to their strict gender roles, with Mom being a hairdresser, dad the construction man, etc. etc. Other characters came and went: JT had a perverted friend Rich (James Marsden) that Dana actually dated later, which will blow your mind if you see an early episode with Rich featured. Sommers had a sister helping cut hair, she left after season 1, Sommers decided to have MORE kids (original storyline) and at the end, Perfect Strangers alum Bronson Pinochet came in to string along another 52 weeks of paychecks for the show. I must also add that this is the one show with school-aged kids who, to my knowledge, were rarely shown actually IN school. (They did have the occasional school function, but the show was not normally set around an AT school problem) I do not doubt they went, but the show was so much more about the house, family, and their interactions. Even the Brady Bunch had some school scenes, but not on SBS. I think the viewer would have had a better understanding of characters had we see them interact with ANYONE besides their stereotypical family.\n\nRe-watching this show may give you a different perspective, as previously stated this show was over-sexed and strangely written. (and I didn't notice at age 12, but age 22). The sexual overtones of this show, after watching again, is shocking. Duffy and Sommers reprise their sexual appetite from their former shows, always wanting to get the kids asleep for some fun under the covers. No show in history had more kids walking in as their parents were \"asleep\" than Step By Step. Some episodes had 5-10 minute scenes of Duffy \"begging for sex\" as Sommers contemplated one of their many kids' current problems. Their acting seemed so easy to them, I think they just acted as themselves the entire show. Other issues include a cousin, Cody, being in love with Dana (Keanan) and parents always wanting to sneak off for alone time, proving this show would not be thought of in the \"family show mold\" of 2004. I am shocked to see it on ABC Family, because the show rarely had the -aww, shucks- moments practically trademarked by ABC's TGIF. Where as Boy Meets World, Hangin' with Mr. Cooper, and Family Matters seemed to always have a moral, lesson, or rule to be found, followed, and understood, Step By Step seemed to throw away any diverse message and just stuck with \"love your family, it is the only one you have\". That is a fine mantra to live by, but hardly revealing. Overall, a show with a permanent place in history considering its stars and placement as a 90's TGIF staple, and worth seeing on re-runs, just to see what television was putting in young minds from 1991-1998. 6-7 stars out of 10."}, "trailer": {"@type": "VideoObject", "name": "Hub Network Promo Trailer", "embedUrl": "/video/imdb/vi3433742617", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNDg0Yjk4NmMtMTM4Mi00NmE3LWI3MzItZTgwZTIzNWJjMTFiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNDg0Yjk4NmMtMTM4Mi00NmE3LWI3MzItZTgwZTIzNWJjMTFiXkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "Two families become one, step by step.", "uploadDate": "2020-09-22T10:50:45Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0001155/?ref_=tt_cl_t1", "name": "Patrick Duffy"}, "character_and_episodes": [{"url": "/title/tt0101205/characters/nm0001155?ref_=tt_cl_t1", "name": "Frank Lambert"}, {"url": "#", "name": "160 episodes, 1991-1998"}]}, {"actor": {"@type": "Person", "url": "/name/nm0443824/?ref_=tt_cl_t3", "name": "Staci Keanan"}, "character_and_episodes": [{"url": "/title/tt0101205/characters/nm0443824?ref_=tt_cl_t3", "name": "Dana Foster"}, {"url": "#", "name": "160 episodes, 1991-1998"}]}, {"actor": {"@type": "Person", "url": "/name/nm0914500/?ref_=tt_cl_t5", "name": "Angela Watson"}, "character_and_episodes": [{"url": "/title/tt0101205/characters/nm0914500?ref_=tt_cl_t5", "name": "Karen Foster"}, {"url": "#", "name": "160 episodes, 1991-1998"}]}, {"actor": {"@type": "Person", "url": "/name/nm0144938/?ref_=tt_cl_t7", "name": "Christopher Castile"}, "character_and_episodes": [{"url": "/title/tt0101205/characters/nm0144938?ref_=tt_cl_t7", "name": "Mark Foster"}, {"url": "#", "name": "160 episodes, 1991-1998"}]}, {"actor": {"@type": "Person", "url": "/name/nm0593711/?ref_=tt_cl_t9", "name": "Sasha Mitchell"}, "character_and_episodes": [{"url": "/title/tt0101205/characters/nm0593711?ref_=tt_cl_t9", "name": "Cody Lambert"}, {"url": "#", "name": "114 episodes, 1991-1998"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001755/?ref_=tt_cl_t2", "name": "Suzanne Somers"}, "character_and_episodes": [{"url": "/title/tt0101205/characters/nm0001755?ref_=tt_cl_t2", "name": "Carol Foster Lambert"}, {"url": "#", "name": "160 episodes, 1991-1998"}]}, {"actor": {"@type": "Person", "url": "/name/nm0130085/?ref_=tt_cl_t4", "name": "Brandon Call"}, "character_and_episodes": [{"url": "/title/tt0101205/characters/nm0130085?ref_=tt_cl_t4", "name": "John Thomas 'J.T.' Lambert"}, {"url": "#", "name": "160 episodes, 1991-1998"}]}, {"actor": {"@type": "Person", "url": "/name/nm0003115/?ref_=tt_cl_t6", "name": "Christine Lakin"}, "character_and_episodes": [{"url": "/title/tt0101205/characters/nm0003115?ref_=tt_cl_t6", "name": "Alicia 'Al' Lambert"}, {"url": "#", "name": "160 episodes, 1991-1998"}]}, {"actor": {"@type": "Person", "url": "/name/nm0126213/?ref_=tt_cl_t8", "name": "Josh Byrne"}, "character_and_episodes": [{"url": "/title/tt0101205/characters/nm0126213?ref_=tt_cl_t8", "name": "Brendan Lambert"}, {"url": "#", "name": "132 episodes, 1991-1997"}]}]}