{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0276751/", "name": "About a Boy", "image": "https://m.media-amazon.com/images/M/MV5BMTQ2Mzg4MDAzNV5BMl5BanBnXkFtZTgwMjcxNTYxMTE@._V1_.jpg", "genre": ["Comedy", "Drama", "Romance"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0000424/", "name": "Hugh Grant"}, {"@type": "Person", "url": "/name/nm0396558/", "name": "Nicholas Hoult"}, {"@type": "Person", "url": "/name/nm0001057/", "name": "Toni Collette"}, {"@type": "Person", "url": "/name/nm0806527/", "name": "Sharon Small"}], "director": [{"@type": "Person", "url": "/name/nm0919363/", "name": "Chris Weitz"}, {"@type": "Person", "url": "/name/nm0919369/", "name": "Paul Weitz"}], "creator": [{"@type": "Person", "url": "/name/nm0394984/", "name": "Nick Hornby"}, {"@type": "Person", "url": "/name/nm0373282/", "name": "Peter Hedges"}, {"@type": "Person", "url": "/name/nm0919363/", "name": "Chris Weitz"}, {"@type": "Person", "url": "/name/nm0919369/", "name": "Paul Weitz"}, {"@type": "Organization", "url": "/company/co0005073/"}, {"@type": "Organization", "url": "/company/co0047476/"}, {"@type": "Organization", "url": "/company/co0063961/"}, {"@type": "Organization", "url": "/company/co0057311/"}, {"@type": "Organization", "url": "/company/co0020336/"}], "description": "About a Boy is a movie starring Hugh Grant, Nicholas Hoult, and Toni Collette. A cynical, immature young man is taught how to act like a grown-up by a little boy.", "datePublished": "2002-04-26", "keywords": "single mother,bullying,dating,selfishness,supermarket", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 173707, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0276751/"}, "author": {"@type": "Person", "name": "jhclues"}, "dateCreated": "2002-06-06", "inLanguage": "English", "name": "Effective, Satisfying Film", "reviewBody": "Being afforded a life of independent means can be a blessing in some regards, perhaps, but it can also be the definitive test of one's character. If one chooses to use such a situation toward altruistic ends, or at the very least a venture that can provide some personal fulfillment, it says something about who that person is.  On the other hand, if one squanders the opportunity on a totally self-absorbed, shallow existence, it says even more.  And while taking the latter path may provide some interesting moments, it's a cosmetically created, external bubble that serves no other purpose than covering up an empty life, and sooner or later-- to anyone with even a modicum of intelligence-- that bubble is bound to burst; and when it finally happens, when the wake-up call comes, how one responds to it is the ultimate test of character, which is what happens to a such a man in `About A Boy,' directed by Chris Weitz and Paul Weitz, and starring Hugh Grant.\n\nAs far as Will Freeman (Grant) is concerned, he has the perfect life; he lives comfortably, if not extravagantly, on the income provided by a certain kind of inheritance.  On the surface, at least, he's happy.  Admittedly, however, he's the very epitome of `shallow,' who makes a conscious and concerted effort at avoiding any commitment in relationships, or even attempting to accomplish or achieve anything at all.  He merely takes from life, gives absolutely nothing back and has always been content with it. But of late, his relationships have become a bit `sticky.'  Women are becoming too demanding, the break-ups too messy.  He needs a new conquest, a relationship in which he can flex his shallowness anew, with a woman who will give him everything and demand nothing in return. \n\n Fortuitous circumstances provide him with just what he's looking for; fortuitous, however, in a way he doesn't realize, as it leads to a relationship through which he encounters a young boy, Marcus (Nicholas Hoult).  And it's a meeting that is destined to have an enormous impact on his life, as Marcus becomes the catalyst that changes Will's entire perspective.  For the first time, Will begins to question who he is, and what he's doing-- or not doing-- with his life.\n\nTelling this story (adapted for the screen by Peter Hedges and the Weitz brothers, from the novel by Nick Hornby) presented a challenge to the filmmakers, in that it's nothing really new; the history of the cinema is filled with stories of individual epiphanies, many along the same lines as this one (recently, `The Kid,' with Bruce Willis, for example).  So a fresh approach and presentation, including the kind of performances they could extract from their actors, was essential for this film to attain any distinction whatsoever.  Which it does, and splendidly.  And, moreover, they succeed on all fronts.  The screenplay is intelligent, and the characters-- especially Will and Marcus' mom, Fiona (Toni Collette)-- are convincingly well developed.  With Will, there is no sudden leap into who he becomes by the end of the film; it comes though a gradual recognition and realization of who he is, after first establishing a starting point from which the character can grow.  The same is true of Fiona.  There's detours and set-backs which-- as in real life-- prevent a direct journey from point A to point B, and create the proverbial sticky wicket along the way.  Weitz and Weitz set a good pace, and most importantly, manage to give their film some real heart without lapsing into any melodramatic, maudlin sentimentality. Rather, the sentiments and situations they express are real and believable, and presented in such a way as to afford the audience any number of elements to which they can genuinely relate.\n\nAs Will, Hugh Grant gives arguably his best performance ever.  In some respects, Will is similar to other characters Grant has created (most notably Daniel in `Bridget Jones's Diary'), but there's a depth to Will he's never previously managed to achieve, and without question this is his most three-dimensional, fully developed character yet.  Grant has a natural charm and a charismatic screen presence, but his presentation is often tinged with a bit of pretentiousness that is entirely absent here.  He does an especially nice job of effecting Will's transition in very real and credible terms, and by the end, it's obvious that this is a side of Grant we have not seen before; with this role, he has effectively expanded his range as an actor.  In the final analysis, it's a performance with real substance, and it makes Will a truly memorable character.\n\nThe young Hoult brings Marcus convincingly to life, as well, with an extremely natural performance, in which he commendably manages to avoid the trappings of stereotype into which this character could easily have fallen. Some credit must go to his directors, of course, but it's Hoult who makes it especially believable in the way he responds, for instance, to certain given situations that typically seem to evoke a particular reaction when being depicted on screen (his rather introspective response to the taunts of his school mates, for example; quite different than what is usually portrayed in film).  And in their scenes together, Grant and Hoult strike a chord of reality that finally assures the overall success of this film.\n\nThe supporting cast includes Rachel Weisz (Rachel), Isabel Brook (Angie), Sharon Small (Christine), Victoria Smurfit (Suzie) and Nat Gastiain Tena (Ellie).  Entertaining, as well as insightful, `About A Boy' gives a truly fresh perspective to an element of the human condition that has been explored before, but rarely as effectively.  The Weitz Brothers make the subject of their film accessible to a wide audience, and in a way that is engaging and satisfying.  This film is going to be a pleasant surprise to many who see it, in that it delivers a whole lot more than most would expect.  And that's the magic of the movies.  9/10.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT1H41M", "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000424/?ref_=tt_cl_t1", "name": "Hugh Grant"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm0000424?ref_=tt_cl_t1", "name": "Will Freeman"}]}, {"actor": {"@type": "Person", "url": "/name/nm0806527/?ref_=tt_cl_t3", "name": "Sharon Small"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm0806527?ref_=tt_cl_t3", "name": "Christine"}]}, {"actor": {"@type": "Person", "url": "/name/nm1168865/?ref_=tt_cl_t5", "name": "Jordan Cook"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm1168865?ref_=tt_cl_t5", "name": "Imogen"}]}, {"actor": {"@type": "Person", "url": "/name/nm1167781/?ref_=tt_cl_t7", "name": "Ryan Speechley"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm1167781?ref_=tt_cl_t7", "name": "Barney"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001057/?ref_=tt_cl_t9", "name": "Toni Collette"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm0001057?ref_=tt_cl_t9", "name": "Fiona Brewer"}]}, {"actor": {"@type": "Person", "url": "/name/nm1169839/?ref_=tt_cl_t11", "name": "Laura Kennington"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm1169839?ref_=tt_cl_t11", "name": "Ellie's Friend"}]}, {"actor": {"@type": "Person", "url": "/name/nm0574014/?ref_=tt_cl_t13", "name": "Peter McNicholl"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm0574014?ref_=tt_cl_t13", "name": "Ellie's Friend"}]}, {"actor": {"@type": "Person", "url": "/name/nm0725900/?ref_=tt_cl_t15", "name": "Ben Ridgeway"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm0725900?ref_=tt_cl_t15", "name": "Lee"}]}, {"actor": {"@type": "Person", "url": "/name/nm0396558/?ref_=tt_cl_t2", "name": "Nicholas Hoult"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm0396558?ref_=tt_cl_t2", "name": "Marcus Brewer"}]}, {"actor": {"@type": "Person", "url": "/name/nm1168866/?ref_=tt_cl_t4", "name": "Madison Cook"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm1168866?ref_=tt_cl_t4", "name": "Imogen"}]}, {"actor": {"@type": "Person", "url": "/name/nm0404462/?ref_=tt_cl_t6", "name": "Nicholas Hutchison"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm0404462?ref_=tt_cl_t6", "name": "John"}]}, {"actor": {"@type": "Person", "url": "/name/nm1167780/?ref_=tt_cl_t8", "name": "Joseph Speechley"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm1167780?ref_=tt_cl_t8", "name": "Barney"}]}, {"actor": {"@type": "Person", "url": "/name/nm1164730/?ref_=tt_cl_t10", "name": "Natalia Tena"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm1164730?ref_=tt_cl_t10", "name": "Ellie"}]}, {"actor": {"@type": "Person", "url": "/name/nm1167923/?ref_=tt_cl_t12", "name": "Tanika Swaby"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm1167923?ref_=tt_cl_t12", "name": "Ellie's Friend"}]}, {"actor": {"@type": "Person", "url": "/name/nm0916854/?ref_=tt_cl_t14", "name": "Chris Webster"}, "character_and_episodes": [{"url": "/title/tt0276751/characters/nm0916854?ref_=tt_cl_t14", "name": "Ellie's Friend"}]}]}