{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1385826/", "name": "The Adjustment Bureau", "image": "https://m.media-amazon.com/images/M/MV5BMzc0ZDcwZTYtOWUzZi00NDE4LWI4NjgtMWVjZTUyYTA2ZTNhXkEyXkFqcGdeQXVyNTIzOTk5ODM@._V1_.jpg", "genre": ["Romance", "Sci-Fi", "Thriller"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0000354/", "name": "Matt Damon"}, {"@type": "Person", "url": "/name/nm1289434/", "name": "Emily Blunt"}, {"@type": "Person", "url": "/name/nm2564974/", "name": "Lisa Thoreson"}, {"@type": "Person", "url": "/name/nm1505460/", "name": "Florence Kastriner"}], "director": {"@type": "Person", "url": "/name/nm1079776/", "name": "George Nolfi"}, "creator": [{"@type": "Person", "url": "/name/nm1079776/", "name": "George Nolfi"}, {"@type": "Person", "url": "/name/nm0001140/", "name": "Philip K. Dick"}, {"@type": "Organization", "url": "/company/co0005073/"}, {"@type": "Organization", "url": "/company/co0194736/"}, {"@type": "Organization", "url": "/company/co0177587/"}, {"@type": "Organization", "url": "/company/co0185913/"}], "description": "The Adjustment Bureau is a movie starring Matt Damon, Emily Blunt, and Lisa Thoreson. The affair between a politician and a contemporary dancer is affected by mysterious forces keeping the lovers apart.", "datePublished": "2011-03-03", "keywords": "fate,teleportation,love at first sight,free will,political superpower", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 245268, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1385826/"}, "author": {"@type": "Person", "name": "TheUnknown837-1"}, "dateCreated": "2011-11-17", "inLanguage": "English", "name": "I am eagerly looking forward to this first-time director's entire career", "reviewBody": "\"The Adjustment Bureau\" is a first-time piece of directing work by a certain George Nolfi, who before had worked in Hollywood pretty much exclusively as a screenwriter. He also composed the script for this picture and that is half of what impressed me so much. Just looking at the way he choreographed his images, and worked so well with his two stars, despite the occasional lapse here and there expected of somebody making their first feature-length motion picture, I must say I am eagerly looking forward to his entire career. For \"The Adjustment Bureau,\" while not any kind of a masterpiece, is one of the most unexpectedly pleasing and wholeheartedly enjoyable movies of the year.\n\nMr. Nolfi's involvement in the third Jason Bourne movie may have had some input in his getting Matt Damon to take the lead as an ambitious but somewhat dubious New York governor candidate. Through some odd and very charming circumstances, Mr. Damon runs into a bold, pretty young ballet dancer played by the always intoxicating Emily Blunt. Affectionate toward each other at first sight, they slowly fall in love and try to reach each other several times over a period lasting years. But the only thing tearing them apart and stopping them is not a jealous ex, not a terrorist plot, but instead a group of mysterious men in 30s-style jackets and fedoras calling themselves the Adjustment Bureau.\n\nThe screenplay was based on a Philip K. Dick story called \"The Adjustment Team\" and although the story is completely warped, the purpose of the titular men remains essentially the same. Their purpose, as a character played by very-good actor John Slattery explains, is to control how time plays out. Time and fate is prewritten in what is called 'The Plan' and they work in groups to make sure that things play out according to 'The Plan,' using whatever methods possible to make sure that the rest of the world falls in accordance to it. And as it turns out, the romance between Mr. Damon and Miss Blunt is something that is prohibited in their strategy and the film evolves into a very passionate and exciting story about two people deciding what is more important: to be with who you love, or to do what is better for the world entire.\n\nWith a plot this extravagant, it is surprising that director Mr. Nolfi did not blunder into an entirely corny yarn. Occasionally, he does falter (some of the scientific lingo gets a little too pseudointellectual for my taste) but as a total, he succeeds in weaving a strong and passionate tale. But that may also return to the surmise that \"The Adjustment Bureau\" is not really a science-fiction tale. Rather, it is a deep romantic thriller that benefits from two sharply-written characters and two very charismatic performances. The movie rides on the romance between Matt Damon and Emily Blunt and you could not ask for better performances. This coming from someone who typically gripes at the 'Love At First Sight' gimmick but became an instant sucker for it here within ten minutes. Mr. Damon, who usually casts himself as tough guys with pasts, takes a chance at playing a softer, more emotional type who does not hurl a fist until the third act and does not instantly become a stuntman. And Miss Blunt does a fabulous job playing a courageous and strong-hearted woman. It's their chemistry and their moments together that really benefit the picture. For right away, I believed in the love brewing between them and it mattered to me whether or not they actually got together at the end. Just looking at these two people together is absolutely charming and even the obligatory love moment between them in bed is performed and shot in such a way that it does not become unnecessarily erotic and doesn't stop the story. Rather, it seems to work, like a piece of a puzzle.\n\nThat is the definition of a good love story. If you were to take it out and transplant it in some totally different movie, it would still work.\n\nThe love story is more interesting than the Adjustment Bureau men themselves and that may be one of the weaknesses of the picture. Despite some great performances from John Slattery, Anthony Mackie, and Terence Stamp, and the fact that we see inside of their operations quite a bit, we don't really come to know much about them. In addition, because this is a first-time directing job, some of the shots are imperfect. A moment where Mr. Damon tries to escape from the Bureau men and trips on a rising floor tile is awkward. The shot seems sped-up too fast and his leg hangs in the air for too long.\n\nMy only real complaint about \"The Adjustment Bureau\" would have to be the much-griped-about ending, which has some religious subtexts that may anger some. Not offended myself, I just felt it, despite that wonderful shot of the two leads - and one of the few times where I liked the shot of the camera whirling 360 degrees around them - was a bit of a cop-out and not entirely satisfying.\n\nBut my few notifications aside, I must happily repeat that this is one marvelously entertaining and emotionally-gripping little movie. And despite the fact that there have been some better-made pictures this year, few of them are liable to last as long in the memory as it. Sometimes it's better when a picture does not aim for masterpiece-status and it's better for the audience going in with an open mind and not assaulted by a big hype campaign. For then a movie like this becomes even more surprising and delightful. Congratulations all around, especially to Mr. Damon and Miss Blunt for their fabulous performances, and to writer-director George Nolfi, who has made a more-than-impressive first step into the most-cherished profession of directing motion pictures.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT1H46M", "trailer": {"@type": "VideoObject", "name": "The Adjustment Bureau -- Super Bowl Spot", "embedUrl": "/video/imdb/vi2215418393", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTY0MTE3ODMyOV5BMl5BanBnXkFtZTgwNDE4MTQyMzE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTY0MTE3ODMyOV5BMl5BanBnXkFtZTgwNDE4MTQyMzE@._V1_.jpg", "description": "The Adjustment Bureau -- Super Bowl Spot", "uploadDate": "2011-02-05T17:20:12Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000354/?ref_=tt_cl_t1", "name": "Matt Damon"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm0000354?ref_=tt_cl_t1", "name": "David Norris"}]}, {"actor": {"@type": "Person", "url": "/name/nm2564974/?ref_=tt_cl_t3", "name": "Lisa Thoreson"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm2564974?ref_=tt_cl_t3", "name": "Suburban Mom"}]}, {"actor": {"@type": "Person", "url": "/name/nm0446672/?ref_=tt_cl_t5", "name": "Michael Kelly"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm0446672?ref_=tt_cl_t5", "name": "Charlie Traynor"}]}, {"actor": {"@type": "Person", "url": "/name/nm1102488/?ref_=tt_cl_t7", "name": "Natalie Carter"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm1102488?ref_=tt_cl_t7", "name": "Suburban Neighbor"}]}, {"actor": {"@type": "Person", "url": "/name/nm0829537/?ref_=tt_cl_t9", "name": "Jon Stewart"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm0829537?ref_=tt_cl_t9", "name": "Jon Stewart"}]}, {"actor": {"@type": "Person", "url": "/name/nm1573061/?ref_=tt_cl_t11", "name": "Darrell Lenormand"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm1573061?ref_=tt_cl_t11", "name": "Upstate Farmer"}]}, {"actor": {"@type": "Person", "url": "/name/nm3701374/?ref_=tt_cl_t13", "name": "Kar"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm3701374?ref_=tt_cl_t13", "name": "Political Consultant"}]}, {"actor": {"@type": "Person", "url": "/name/nm4322219/?ref_=tt_cl_t15", "name": "Susan D. Michaels"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm4322219?ref_=tt_cl_t15", "name": "Reporter"}]}, {"actor": {"@type": "Person", "url": "/name/nm1289434/?ref_=tt_cl_t2", "name": "Emily Blunt"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm1289434?ref_=tt_cl_t2", "name": "Elise Sellas"}]}, {"actor": {"@type": "Person", "url": "/name/nm1505460/?ref_=tt_cl_t4", "name": "Florence Kastriner"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm1505460?ref_=tt_cl_t4", "name": "Suburban Mom"}]}, {"actor": {"@type": "Person", "url": "/name/nm4323197/?ref_=tt_cl_t6", "name": "Phyllis MacBryde"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm4323197?ref_=tt_cl_t6", "name": "Suburban Neighbor"}]}, {"actor": {"@type": "Person", "url": "/name/nm0769086/?ref_=tt_cl_t8", "name": "Chuck Scarborough"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm0769086?ref_=tt_cl_t8", "name": "Chuck Scarborough"}]}, {"actor": {"@type": "Person", "url": "/name/nm4323563/?ref_=tt_cl_t10", "name": "Gregory P. Hitchen"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm4323563?ref_=tt_cl_t10", "name": "U.S. Coast Guard Officer"}]}, {"actor": {"@type": "Person", "url": "/name/nm0089255/?ref_=tt_cl_t12", "name": "Michael Bloomberg"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm0089255?ref_=tt_cl_t12", "name": "Mayor Michael R. Bloomberg"}]}, {"actor": {"@type": "Person", "url": "/name/nm2897269/?ref_=tt_cl_t14", "name": "RJ Konner"}, "character_and_episodes": [{"url": "/title/tt1385826/characters/nm2897269?ref_=tt_cl_t14", "name": "Political Consultant"}]}]}