{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1855199/", "name": "End of Watch", "image": "https://m.media-amazon.com/images/M/MV5BMjMxNjU0ODU5Ml5BMl5BanBnXkFtZTcwNjI4MzAyOA@@._V1_.jpg", "genre": ["Action", "Crime", "Drama", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0350453/", "name": "Jake Gyllenhaal"}, {"@type": "Person", "url": "/name/nm0671567/", "name": "Michael Peña"}, {"@type": "Person", "url": "/name/nm0447695/", "name": "Anna Kendrick"}, {"@type": "Person", "url": "/name/nm1065229/", "name": "America Ferrera"}], "director": {"@type": "Person", "url": "/name/nm0043742/", "name": "David Ayer"}, "creator": [{"@type": "Person", "url": "/name/nm0043742/", "name": "David Ayer"}, {"@type": "Organization", "url": "/company/co0234935/"}, {"@type": "Organization", "url": "/company/co0017712/"}, {"@type": "Organization", "url": "/company/co0365905/"}, {"@type": "Organization", "url": "/company/co0307345/"}, {"@type": "Organization", "url": "/company/co0146364/"}, {"@type": "Organization", "url": "/company/co0339461/"}, {"@type": "Organization", "url": "/company/co0519475/"}], "description": "End of Watch is a movie starring Jake Gyllenhaal, Michael Peña, and Anna Kendrick. Shot documentary-style, this film follows the daily grind of two young police officers in LA who are partners and friends, and what happens when they...", "datePublished": "2012-09-20", "keywords": "video footage,street gang,police,lapd,police officer", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 229453, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.6"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1855199/"}, "author": {"@type": "Person", "name": "nick_white_5"}, "dateCreated": "2012-09-10", "inLanguage": "English", "name": "Likable, believable characters make this a realistically funny, intense and emotionally gripping cop movie.", "reviewBody": "When I actually sit down and think about it, there aren't many good movies about your average, every day police officer. There are a couple notable television series', like \"Hill Street Blues\" and the now dated but oddly fascinating reality series \"Cops\", but on film, these guys don't get a lot of luck. I guess everyone would rather see movies about undercover officers or detectives. Well for anyone like me who's been waiting for it, here it is. End Of Watch, an excellent take on the genre. It may not be perfect, but it's unique and shows the day to day life more effectively than most if any cop movies I've seen, and as such I think it will one day be essential viewing for fans of the genre.\n\nIn the film we meet Brian Taylor, an ex-marine working as a police officer while he works his way through law school. He also just so happens to be taking a class in filmmaking and is filming his experiences to make a documentary for said class, and this is where we get much of our view into the film from. Featured frequently in the film is his partner Mike, often called Z. After stumbling upon a drug-lord at a routine traffic stop, they quickly fall into trouble with the cartel and have to fight their way through it while still trying to figure out where it's all coming from.\n\nThe great thing about this mockumentary/found footage style isn't so much the way it's able to present the action of being a cop realistically (which it does but so do normally shot movies), but it better gives us an understanding of what happens inbetween the action. Being a fly on the wall in the various dull, inappropriate, and often times hilarious conversations the two have when patrolling brings the film a much needed dose of comic relief, but the kind that never feels forced. It's all set up naturally. This really gives a chance for stars Jake Gyllenhaal and Michael Pena to shine as well as they fit so naturally into these characters, often sounding unscripted whether or not they are. They play them as regular guys instead of complex characters which may make them a little less compelling, but all the more fun to watch.\n\nThe film also mixes in a variety of other video sources from the dashboard cams of the police cruisers to security cameras. This really benefits the style as a whole. 99% of the time, using the self-shot, found footage for an entire film can come off as gimmicky and unnecessary, but by using a variety of sources the director is able to keep the realistic tone consistent while downplaying the gimmick idea and instead choosing to use Brian's self shot footage and monologues to the camera only when they prove most effective to the story.\n\nAlong the way the film is also interspersed with subplots of Brian meeting his new girl Janet, played by Anna Kendrick who makes a memorable impression despite her little screen time, as well as Z and his wife having a baby. While I find it hard to really complain about Anna Kendrick (she's just so damn cute! And she looked stunning on stage introducing the film), these subplots, while important for character development, are thrown in a little too randomly throughout and mess with the overall flow of the film. It's not a huge complaint as I've seen it done worse in other movies, but it could've been solved with some tighter editing. But who knows, this was the premiere I saw, studios still often tweak movies before wide-release.\n\nFortunately for writer/director David Ayer, this is really the only complaint I have about the film. The entire movie is fairly well written. I did find the dialogue of a lot of the street thugs to be cliché and racially stereotypical, but the things Brian and Z say are priceless throughout and help you deal with a lot of the more serious scenes, and there are quite a few of them. For as entertaining and light-hearted as it is at times, End Of Watch has many dark, brutally violent, and emotionally impacting scenes that are not for the feint of heart. They do ultimately seem necessary though as the film needs action to keep it going, and to create the realistic document of day to day police life it's trying to create, which does get pretty brutal sometimes despite the mostly mundane times in between. The important thing though is that the film is able to balance all of these moments so well.\n\nDavid Ayer has dedicated what seems to be his whole career to police movies. Most are mediocre to bad (Street Kings), some are genre classics (Training Day), but I think End Of Watch is by far his finest. It easily has the most likable characters, and as such the most emotional involvement for the audience, which thus creates the most tension in the high risk, action scenes. It has the most believable story of any of his movies, or most cop movies for that matter, and lastly it just told in an interesting way. Neither the cop story, found footage action or fly on the wall comedy genres are anything new, but End of Watch takes old ideas and fits them together to make something interesting.\n\nIn conclusion, it's tough to go wrong with End Of Watch if you're a fan of the genre. Even if you're not particularly fond of cop movies, I'd still recommend it. It's a highly entertaining, tension filled ride of a movie. It may not be as deep as some other movies coming out now, but it really brings you into another world well. It's well written, well directed, well acted, and was well enjoyed by the whole crowd. Check it out.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H49M", "trailer": {"@type": "VideoObject", "name": "U.S. Version -- #2", "embedUrl": "/video/imdb/vi3486098713", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTA1MTUwNjU3MDdeQTJeQWpwZ15BbWU3MDQ0NzQxMzg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTA1MTUwNjU3MDdeQTJeQWpwZ15BbWU3MDQ0NzQxMzg@._V1_.jpg", "description": "Two young officers are marked for death when they confiscate money and firearms from the members of a notorious cartel during a routine traffic stop.", "uploadDate": "2012-08-22T13:44:23Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0350453/?ref_=tt_cl_t1", "name": "Jake Gyllenhaal"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm0350453?ref_=tt_cl_t1", "name": "Brian Taylor"}]}, {"actor": {"@type": "Person", "url": "/name/nm2358540/?ref_=tt_cl_t3", "name": "Natalie Martinez"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm2358540?ref_=tt_cl_t3", "name": "Gabby"}]}, {"actor": {"@type": "Person", "url": "/name/nm1092086/?ref_=tt_cl_t5", "name": "David Harbour"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm1092086?ref_=tt_cl_t5", "name": "Van Hauser"}]}, {"actor": {"@type": "Person", "url": "/name/nm1065229/?ref_=tt_cl_t7", "name": "America Ferrera"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm1065229?ref_=tt_cl_t7", "name": "Orozco"}]}, {"actor": {"@type": "Person", "url": "/name/nm2968738/?ref_=tt_cl_t9", "name": "Jaime FitzSimons"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm2968738?ref_=tt_cl_t9", "name": "Captain Reese"}]}, {"actor": {"@type": "Person", "url": "/name/nm1414931/?ref_=tt_cl_t11", "name": "Shondrella Avery"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm1414931?ref_=tt_cl_t11", "name": "Bonita"}]}, {"actor": {"@type": "Person", "url": "/name/nm5243587/?ref_=tt_cl_t13", "name": "Leequwid 'Devil' Wilkens"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm5243587?ref_=tt_cl_t13", "name": "CK"}]}, {"actor": {"@type": "Person", "url": "/name/nm2893365/?ref_=tt_cl_t15", "name": "Zone"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm2893365?ref_=tt_cl_t15", "name": "Too Tall"}]}, {"actor": {"@type": "Person", "url": "/name/nm0671567/?ref_=tt_cl_t2", "name": "Michael Peña"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm0671567?ref_=tt_cl_t2", "name": "Mike Zavala"}]}, {"actor": {"@type": "Person", "url": "/name/nm0447695/?ref_=tt_cl_t4", "name": "Anna Kendrick"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm0447695?ref_=tt_cl_t4", "name": "Janet"}]}, {"actor": {"@type": "Person", "url": "/name/nm0342029/?ref_=tt_cl_t6", "name": "Frank Grillo"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm0342029?ref_=tt_cl_t6", "name": "Sarge"}]}, {"actor": {"@type": "Person", "url": "/name/nm0805944/?ref_=tt_cl_t8", "name": "Cle Sloan"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm0805944?ref_=tt_cl_t8", "name": "Mr. Tre"}]}, {"actor": {"@type": "Person", "url": "/name/nm3158974/?ref_=tt_cl_t10", "name": "Cody Horn"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm3158974?ref_=tt_cl_t10", "name": "Davis"}]}, {"actor": {"@type": "Person", "url": "/name/nm0492756/?ref_=tt_cl_t12", "name": "Everton Lawrence"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm0492756?ref_=tt_cl_t12", "name": "Man Friend"}]}, {"actor": {"@type": "Person", "url": "/name/nm5242683/?ref_=tt_cl_t14", "name": "James 'Pistol' McNeal"}, "character_and_episodes": [{"url": "/title/tt1855199/characters/nm5242683?ref_=tt_cl_t14", "name": "DJ"}]}]}