{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt2639336/", "name": "Greta", "image": "https://m.media-amazon.com/images/M/MV5BOTg0OTVjYjUtOWUzYS00YjJjLWI3NWItMmVjNTBlMTE2ODJlXkEyXkFqcGdeQXVyMjM4NTM5NDY@._V1_.jpg", "genre": ["Drama", "Mystery", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0001376/", "name": "Isabelle Huppert"}, {"@type": "Person", "url": "/name/nm1631269/", "name": "Chloë Grace Moretz"}, {"@type": "Person", "url": "/name/nm2140860/", "name": "Maika Monroe"}, {"@type": "Person", "url": "/name/nm0675110/", "name": "Jane Perry"}], "director": {"@type": "Person", "url": "/name/nm0001403/", "name": "Neil Jordan"}, "creator": [{"@type": "Person", "url": "/name/nm1242522/", "name": "Ray Wright"}, {"@type": "Person", "url": "/name/nm1242522/", "name": "Ray Wright"}, {"@type": "Person", "url": "/name/nm0001403/", "name": "Neil Jordan"}, {"@type": "Organization", "url": "/company/co0015447/"}, {"@type": "Organization", "url": "/company/co0093776/"}, {"@type": "Organization", "url": "/company/co0298154/"}], "description": "Greta is a movie starring Isabelle Huppert, Chloë Grace Moretz, and Maika Monroe. A young woman befriends a lonely widow who's harboring a dark and deadly agenda toward her.", "datePublished": "2019-02-28", "keywords": "kidnapping,tied to a bed,female protagonist,psychopath,stalker", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 26554, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.0"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt2639336/"}, "author": {"@type": "Person", "name": "Bertaut"}, "dateCreated": "2019-05-04", "inLanguage": "English", "name": "Insubstantial and forgettable, but Huppert makes it moderately entertaining", "reviewBody": "Written by Ray Wright and Neil Jordan, and directed by Jordan, Greta is a schlocky B-movie through-and-through, with a completely ridiculous plot and over-the-top final act, all infused with a ludicrous generic campiness. It's one of those films that's so utterly horrendous in almost every way, it's actually kind of enjoyable. Kind of. Very much in the tradition of stalker-thrillers such as Body Double (1984), Fatal Attraction (1987), and Single White Female (1992), although nowhere near as good as any of them, Greta was introduced at the Venice Film Festival as \"a twisted little thriller\". Well, it's certainly twisted, and it's also rather little, but there isn't a huge amount of thrilling going on. In fact, there's precious little of anything going on, as Jordan seems to have precisely nothing to say; the film simply isn't inherently about anything. Although it is good for a few laughs (and I'm pretty sure not all of them intentional).\n\nFrances McCullen (Chloë Grace Moretz), a young Bostonian, is sharing an apartment in New York with her college friend Erica Penn (Maika Monroe). Having recently lost her mother to cancer, she is all-but-estranged from her workaholic father Chris (Colm Feore), with every conversation between them painfully taut. Returning home from her waitress job, Frances finds a handbag on the subway belonging to Greta Hideg (Isabelle Huppert, having an absolute blast). Bringing the bag to Greta's house, the two share tea, as Greta explains her husband died some time ago, and her daughter is living in Paris, leaving her feeling lonely. They strike up a friendship, with each filling an emotional void in the other's life. Although Erica thinks the relationship is \"weird\", Frances ignores her, and she and Greta grow ever closer. However, as Greta prepares dinner one evening, Frances finds a collection of handbags identical to the one she found on the subway, each labelled with a name and phone number. Deeply concerned, Frances tries to cut ties with Greta, but Greta has no intentions of allowing Frances to walk out of her life.\n\nGreta is Neil Jordan's eighteenth film, and like much of his previous work (notably The Company of Wolves (1984), High Spirits (1988), In Dreams (1999), and Ondine (2009)), he imbues the milieu of Greta with fairy tale tropes; Greta's home, for example, is so obviously inspired by \"Hansel and Gretel\" it may as well as have been made of gingerbread, whilst Frances has more than a hint of Little Red Riding Hood's innocence and naïveté about her.\n\nHowever, this is a Roger Corman-style B-movie before it is anything else. Something you see a lot in B-movie thrillers is that when danger is apparent, otherwise intelligent characters must act like complete and utter simpletons; and so, in Greta, upon a barrage of calls and texts from Greta, Frances neither blocks Greta's number nor changes her own; when Greta starts calling the landline, neither Frances nor Erica think to unplug it; although it's never explicitly stated that Greta has a key to the girls' apartment, the fact that she seems to pop in and out at will suggests she does, yet the girls don't change the locks; Frances's big plan to combat Greta is to root through her garbage to try to find something incriminating; when trapped in Greta's house, after trying the door and one window, Frances thinks the best course of action is to flee to the dark cellar. Whether the film intends for this level of stupidity to be humorous or not is beside the point; anyone who has ever seen a movie will surely get a chuckle from such appalling writing\n\nThe question one must ask, then, is whether or not Jordan is actually in on the joke. It remains somewhat ambiguous, but I would say, for the most part, that he is not, and that he seems to take the material relatively seriously. What is certain, however, is that Huppert is very much aware of the ludicrousness around her, and is clearly having an absolute blast with the part - whether it's literally dancing across the set as she commits homicide, spitting chewing-gum into Frances's hair, gleefully engaging in some DIY emergency medicine, or overturning a table as if her life depended on it. She practically winks at the camera a couple of times, and commits totally to every bonkers moment, which come thick and fast in the last act.\n\nThematically, the film flirts with a few issues, but never really penetrates any of them. One could read it as a satire of NYPD inefficiency, the ineffectiveness of the justice system, and the misnomer that in a post #MeToo society, it's easier for women to report instances of stalking and harassment and be believed; when Frances makes a formal complaint about Greta, a bored policeman tells her \"it's not harassment if it's in a public place\". Later on, when Frances tries to file a restraining order, she is told it could be months before her case is heard. When Greta is taken into custody at one point, she is released almost immediately, despite clearly being unstable.\n\nFrom an aesthetic point of view, the film signals its campiness right from the off, opening with Julie London's 1963 cover of \"Where Are You?\" Visually, as you would expect from Jordan, everything looks great. Anna Rackard's production design contrasts the dark brown classical feel of the interior of Greta's house with the bright, grey, modernist look of the girls' sleek apartment. Also worth mentioning is how Jordan and director of photography Seamus McGarvey shoot scenes of Greta watching Frances menacingly from outside the restaurant where she works - placing her dead centre in the frame as she remains completely motionless, in the midst of a flurry of movement and passers-by all around her. It's a very creepy image. Another really well-mounted part of the film is a scene where Greta is following Erica. Although neither Erica nor the audience ever actually see Greta, we know she's there, because she keeps sending Frances picture messages of her pursuit, as Frances is on the phone to Erica telling her to run. The editing by Nick Emerson is especially impressive here, cutting rhythmically between Erica, Frances, and inserts of the picture messages, as the tension mounts. Again, it's a very unsettling scene, and a unique way to stage a chase. Finally, there's the sound design by Stefan Henrix, which is noticeable in what it doesn't do; whenever we are outside, there are the typical sounds of a city that you would expect, however, when we move into Greta's house, the sound design is dialled back almost to zero (much quieter than the girls' apartment), creating the impression of the house as somehow separate from the frantic pace of the city right outside the door.\n\nOn the other hand, the aesthetic very much lets the film down in terms of location. Although set in New York, it was shot primarily in Dublin, with some pick-ups in Toronto, and it shows. Granted, I live in Dublin and was able to pick out most of the locations in a way someone not from here wouldn't. But irrespective of that, the filmmakers seem to have made little effort to disguise the location; from the sequence of the traffic lights to the side of the road on which the cars drive to the street signs. It's very distracting, and really wouldn't have required that much effort to fix. This is especially irritating insofar as the location's significance is built into the script (it's mentioned several times that if Frances were from New York she would never have picked up the bag). So the fact that so little effort has gone into actually making the film look like it was shot in New York is disappointing.\n\nAnd there are a myriad of other problems. For starters, there's the script, wherein none of the characters are given much in the way of interiority or psychological verisimilitude. Frances and Greta have some rudimentary backstory, but it isn't enough to compensate for their lack of psychology. There's little emotional complexity anywhere in the film, no real sense of any of the characters having an unconscious. And whilst the ludicrousness of Huppert's performance distracts from this and transcends the limitations of the writing, Moretz remains unable to break free. In this sense, she comes across like a cog in the screenwriters' machinery, only behaving in such and such a way because the plot dictates it, with scene after perfunctory scene doing only enough to get us to the next scene and nothing else. Neither Moretz nor Monroe are able to escape the generic moulds of their character-types; the bright-eyed and innocent newbie whose kindness will be her downfall, and the tough friend who seems churlish and cynical but who ultimately proves to have been right all along.\n\nGreta is a rote stalker-thriller that looks great, but offers nothing we haven't seen before; it's essentially a potboiler in a nice suit. No different from any of the late 80s/early 90s obsession thrillers, the plot is plodding and uninspired and the characters are underwritten. When all is said and done, it's hard to really figure out what Jordan was aiming for with this. You can't call it a psychological thriller about obsession and loneliness, because it does nothing with these themes, but you can't call it a self-aware B-movie, because Jordan doesn't seem to be fully cognisant that it's campy schlock. Huppert's crazy performance elevates the material significantly, but even she can't paper over all the cracks. It's been 23 years since Jordan has made anything significant, and on the evidence of his last few films, it's going to be a while before he does so again.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT1H38M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi1077262873", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTdjNTIwMzgtYWNiYy00Njc5LThjMTEtYmQ2ZTEzMDNjMzRjXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTdjNTIwMzgtYWNiYy00Njc5LThjMTEtYmQ2ZTEzMDNjMzRjXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg", "description": "A naïve young woman trying to make it on her own in New York City, Frances (Chloë Grace Moretz) doesn't think twice about returning the handbag she finds on the subway to its rightful owner. That owner is Greta (Isabelle Huppert), an eccentric French piano teacher with a love for classical music and an aching loneliness. Having recently lost her mother, Frances quickly grows closer to widowed Greta. The two become fast friends - but Greta's maternal charms begin to dissolve and grow increasingly disturbing as Frances discovers that nothing in Greta's life is what it seems.", "uploadDate": "2018-12-20T16:09:12Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0001376/?ref_=tt_cl_t1", "name": "Isabelle Huppert"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm0001376?ref_=tt_cl_t1", "name": "Greta Hideg"}]}, {"actor": {"@type": "Person", "url": "/name/nm2140860/?ref_=tt_cl_t3", "name": "Maika Monroe"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm2140860?ref_=tt_cl_t3", "name": "Erica Penn"}]}, {"actor": {"@type": "Person", "url": "/name/nm1865598/?ref_=tt_cl_t5", "name": "Jeff Hiller"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm1865598?ref_=tt_cl_t5", "name": "Maitre D' Henri"}]}, {"actor": {"@type": "Person", "url": "/name/nm10490567/?ref_=tt_cl_t7", "name": "Brandon Lee Sears"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm10490567?ref_=tt_cl_t7", "name": "Flower Delivery Man"}]}, {"actor": {"@type": "Person", "url": "/name/nm8142076/?ref_=tt_cl_t9", "name": "Rosa Escoda"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm8142076?ref_=tt_cl_t9", "name": "Korean Couple"}]}, {"actor": {"@type": "Person", "url": "/name/nm2008303/?ref_=tt_cl_t11", "name": "Thaddeus Daniels"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm2008303?ref_=tt_cl_t11", "name": "Officer Deroy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0272173/?ref_=tt_cl_t13", "name": "Colm Feore"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm0272173?ref_=tt_cl_t13", "name": "Chris McCullen"}]}, {"actor": {"@type": "Person", "url": "/name/nm7368334/?ref_=tt_cl_t15", "name": "Nagisa Morimoto"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm7368334?ref_=tt_cl_t15", "name": "Park Hill Waitress"}]}, {"actor": {"@type": "Person", "url": "/name/nm1631269/?ref_=tt_cl_t2", "name": "Chloë Grace Moretz"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm1631269?ref_=tt_cl_t2", "name": "Frances McCullen"}]}, {"actor": {"@type": "Person", "url": "/name/nm0675110/?ref_=tt_cl_t4", "name": "Jane Perry"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm0675110?ref_=tt_cl_t4", "name": "Animal Shelter Worker"}]}, {"actor": {"@type": "Person", "url": "/name/nm4554036/?ref_=tt_cl_t6", "name": "Parker Sawyers"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm4554036?ref_=tt_cl_t6", "name": "Park Hill Manager"}]}, {"actor": {"@type": "Person", "url": "/name/nm6110544/?ref_=tt_cl_t8", "name": "Arthur Lee"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm6110544?ref_=tt_cl_t8", "name": "Korean Couple"}]}, {"actor": {"@type": "Person", "url": "/name/nm4476784/?ref_=tt_cl_t10", "name": "Jessica Preddy"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm4476784?ref_=tt_cl_t10", "name": "Park Hill Bartender"}]}, {"actor": {"@type": "Person", "url": "/name/nm0202253/?ref_=tt_cl_t12", "name": "Raven Dauda"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm0202253?ref_=tt_cl_t12", "name": "Officer Regan"}]}, {"actor": {"@type": "Person", "url": "/name/nm1534698/?ref_=tt_cl_t14", "name": "Zawe Ashton"}, "character_and_episodes": [{"url": "/title/tt2639336/characters/nm1534698?ref_=tt_cl_t14", "name": "Alexa Hammond"}]}]}