{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt5140878/", "name": "Annabelle: Creation", "image": "https://m.media-amazon.com/images/M/MV5BMjA1MzIwMjMxNF5BMl5BanBnXkFtZTgwMDQ3NTc2MjI@._V1_.jpg", "genre": ["Horror", "Mystery", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0001439/", "name": "Anthony LaPaglia"}, {"@type": "Person", "url": "/name/nm5343317/", "name": "Samara Lee"}, {"@type": "Person", "url": "/name/nm0001584/", "name": "Miranda Otto"}, {"@type": "Person", "url": "/name/nm0339159/", "name": "Brad Greenquist"}], "director": {"@type": "Person", "url": "/name/nm2497546/", "name": "David F. Sandberg"}, "creator": [{"@type": "Person", "url": "/name/nm2477891/", "name": "Gary Dauberman"}, {"@type": "Person", "url": "/name/nm2477891/", "name": "Gary Dauberman"}, {"@type": "Organization", "url": "/company/co0504531/"}, {"@type": "Organization", "url": "/company/co0046718/"}, {"@type": "Organization", "url": "/company/co0449458/"}, {"@type": "Organization", "url": "/company/co0179825/"}], "description": "Annabelle: Creation is a movie starring Anthony LaPaglia, Samara Lee, and Miranda Otto. Twelve years after the tragic death of their little girl, a doll-maker and his wife welcome a nun and several girls from a shuttered orphanage...", "datePublished": "2017-08-03", "keywords": "nun,possessed doll,evil doll,prequel,loss of daughter", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 113846, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt5140878/"}, "author": {"@type": "Person", "name": "rgkarim"}, "dateCreated": "2017-08-10", "inLanguage": "English", "name": "The Creation Of a Better Prequel!", "reviewBody": "So many years ago, the Conjuring dropped into theaters and opened up a movie universe that would bestow nightmares to the audience members who saw it. This weekend, the latest installment in this haunted world with Annabelle Creation. A prequel to the last film, this possessed doll continues to be a popular figure head in the occult series to warrant another film. Is this film a fitting addition to the franchise, or is it another money grabber fit to be lost in the horror archives? Robbie K here to help answer those questions and share some thoughts. Let's get to work. \n\nLIKES: \n\nAnswers Questions: The first Annabelle gave the doll some basis and established her deadly legacy, but it lacked any true backstory of her creation. The prequel, as so titled, helped fill in the creation story and establish the origin to its possession. As the film progresses, more of the Annabelle's journey is revealed, alongside a closer look at the creature that uses it as a puppet. While not fully complete, we now have the connections needed to make sense of the first movie, and further engross us in the universe. Unfortunately, the name, the involvement, and other details of the demons still remain unanswered, but can be extrapolated with a dialogue hints. \n\nThe Pace: Horror movies can have pacing issues at time depending on the story. Fortunately, Annabelle Creation's moves at a decent pace to maximize the movie. Slow enough to provide build up for the scares, but fast enough to keep everything moving and on edge, the production team did a nice job keeping you invested in the movie. There is little time between all the craziness, with just enough comedic relief to relieve the tension and keep things interesting. \n\nScares: I guess we need to talk about the main element you go for these movies huh? The scare factor is at an all-time high in this movie, continuing the Conjuring's legacy of keeping things dynamic, fun, and suspenseful. Annabelle's creepy on so many levels, starting with the realistic setting to place the movie in. That realism and the use of shadows has your imagination on fire trying to fill in the gaps of what lurks in the dark. Once the subtle components are set, you can bet there a number of creepy tricks played in this film, alongside the fleeting glimpses of the demon that terrorizes the family in his cruel game. And of course, there is that doll. It's soulless stare and deceiving smile continue to give me the willies, and had a number of audience members using colorful language before involuntary rising from their seats. \n\nDISLIKES:\n\nCharacter stories: The movie had a lot of characters to play in our haunted setting. The protagonists of the film held a lot of potential to develop as characters, and unfortunately, they failed on that level. Sure, you can piece together the simple origins placed before you, but I would have liked more insight into the girls' origins or perhaps a little more integration of Bee into the writing to help maximize scares. With the conjuring able to unearth their demons and dreams in a quality manner, Annabelle should be able to mimic that magic. Scares do not equal perfect horror movie. \n\nPointless characters: Remember the big family in the Conjuring and how each sibling, parent, and exorcist were part of the tale in some way. That's gone too. Annabelle Conjuring brought a large group into the home, but only about four-five of them have any real involvement in the plot. The underutilization of these characters tripped up the plot, made for ridiculous scenes that didn't have as much importance, and really left me asking, what was their point. One girl has just one line and a few stares at the camera. Why include them if you aren't going to use them to develop the characters, or at least try to work together to escape the demon's wrath. \n\nPredictability: Scares are getting easier to predict in this day and age. This is mostly due to the development team throwing their usual tactics into the mix to warn you of the impending jump scare. Annabelle Conjuring doesn't escape this trend and much of the scares can be seen a mile away in some form or manner. While there are a few moments that were good tries, the tactics got repetitive and/or cheesy to be laughable rather than fearful. Fortunately, some creepy special effects and the darkness offset this enough to still get under your skin\u0085 thanks religion nightmare inducing series. \n\nThe Verdict:\n\nOverall, Annabelle Creation is one of the better horror movies of the summer and perhaps this year. It is dark, creepy, and moves at that pace needed to keep you invested in the movie for the two-hour run time. In addition, the filling in gaps and hints start to connect the world (a very popular trend), which will have you die hard horror fans screaming in delight at both scares and plot. Yet, there are still elements of the story telling to clean up and utilizing your characters you bring in is a big step to improve on. In addition, I hope the next installment forgoes the predictable moves and gives us that kick I haven't seen yet. Considering everything, this reviewer recommends a visit to the theater for this one, assuming you are disturbed by spiritual haunting movies. \n\nMy scores: Horror/Mystery/Thriller: 8.5 Movie Overall: 7.0\n\nP.S. Stay for the end of the credits for some teasing.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "duration": "PT1H49M", "trailer": {"@type": "VideoObject", "name": "Official Trailer #2", "embedUrl": "/video/imdb/vi32225561", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMTYyMDE5ODIzOF5BMl5BanBnXkFtZTgwOTU4NTc2MjI@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMTYyMDE5ODIzOF5BMl5BanBnXkFtZTgwOTU4NTc2MjI@._V1_.jpg", "description": "Several years after the tragic death of their little girl, a dollmaker and his wife welcome a nun and several girls from a shuttered orphanage into their home, soon becoming the target of the dollmaker's possessed creation, Annabelle.", "uploadDate": "2017-06-20T07:37:48Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0001439/?ref_=tt_cl_t1", "name": "Anthony LaPaglia"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm0001439?ref_=tt_cl_t1", "name": "Samuel Mullins"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001584/?ref_=tt_cl_t3", "name": "Miranda Otto"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm0001584?ref_=tt_cl_t3", "name": "Esther Mullins"}]}, {"actor": {"@type": "Person", "url": "/name/nm5157662/?ref_=tt_cl_t5", "name": "Lulu Wilson"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm5157662?ref_=tt_cl_t5", "name": "Linda"}]}, {"actor": {"@type": "Person", "url": "/name/nm2362713/?ref_=tt_cl_t7", "name": "Stephanie Sigman"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm2362713?ref_=tt_cl_t7", "name": "Sister Charlotte"}]}, {"actor": {"@type": "Person", "url": "/name/nm1534201/?ref_=tt_cl_t9", "name": "Grace Fulton"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm1534201?ref_=tt_cl_t9", "name": "Carol"}]}, {"actor": {"@type": "Person", "url": "/name/nm4366656/?ref_=tt_cl_t11", "name": "Tayler Buck"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm4366656?ref_=tt_cl_t11", "name": "Kate"}]}, {"actor": {"@type": "Person", "url": "/name/nm1177766/?ref_=tt_cl_t13", "name": "Joseph Bishara"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm1177766?ref_=tt_cl_t13", "name": "Annabelle Demon"}]}, {"actor": {"@type": "Person", "url": "/name/nm8930044/?ref_=tt_cl_t15", "name": "Jessie Giacomazzi"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm8930044?ref_=tt_cl_t15", "name": "Demon Bee"}]}, {"actor": {"@type": "Person", "url": "/name/nm5343317/?ref_=tt_cl_t2", "name": "Samara Lee"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm5343317?ref_=tt_cl_t2", "name": "Bee"}]}, {"actor": {"@type": "Person", "url": "/name/nm0339159/?ref_=tt_cl_t4", "name": "Brad Greenquist"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm0339159?ref_=tt_cl_t4", "name": "Victor Palmeri"}]}, {"actor": {"@type": "Person", "url": "/name/nm5145057/?ref_=tt_cl_t6", "name": "Talitha Eliana Bateman"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm5145057?ref_=tt_cl_t6", "name": "Janice"}]}, {"actor": {"@type": "Person", "url": "/name/nm0104220/?ref_=tt_cl_t8", "name": "Mark Bramhall"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm0104220?ref_=tt_cl_t8", "name": "Father Massey"}]}, {"actor": {"@type": "Person", "url": "/name/nm3503282/?ref_=tt_cl_t10", "name": "Philippa Coulthard"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm3503282?ref_=tt_cl_t10", "name": "Nancy"}]}, {"actor": {"@type": "Person", "url": "/name/nm7899930/?ref_=tt_cl_t12", "name": "Lou Lou Safran"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm7899930?ref_=tt_cl_t12", "name": "Tierney"}]}, {"actor": {"@type": "Person", "url": "/name/nm2151188/?ref_=tt_cl_t14", "name": "Alicia Vela-Bailey"}, "character_and_episodes": [{"url": "/title/tt5140878/characters/nm2151188?ref_=tt_cl_t14", "name": "Evil Mullins"}, {"url": "/title/tt5140878/characters/nm2151188?ref_=tt_cl_t14", "name": "Demon Hands"}]}]}