{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt5215952/", "name": "Gokseong", "image": "https://m.media-amazon.com/images/M/MV5BODkwMTgxNjA2NF5BMl5BanBnXkFtZTgwMDc0OTcwOTE@._V1_.jpg", "genre": ["Horror", "Mystery", "Thriller"], "contentRating": "TV-MA", "actor": [{"@type": "Person", "url": "/name/nm0475165/", "name": "Jun Kunimura"}, {"@type": "Person", "url": "/name/nm1058565/", "name": "Jung-min Hwang"}, {"@type": "Person", "url": "/name/nm3483072/", "name": "Do-won Kwak"}, {"@type": "Person", "url": "/name/nm3825915/", "name": "Woo-hee Chun"}], "director": {"@type": "Person", "url": "/name/nm2947553/", "name": "Hong-jin Na"}, "creator": [{"@type": "Person", "url": "/name/nm2947553/", "name": "Hong-jin Na"}, {"@type": "Person", "url": "/name/nm2947553/", "name": "Hong-jin Na"}, {"@type": "Organization", "url": "/company/co0051662/"}, {"@type": "Organization", "url": "/company/co0658666/"}, {"@type": "Organization", "url": "/company/co0452320/"}, {"@type": "Organization", "url": "/company/co0594772/"}], "description": "Gokseong is a movie starring Jun Kunimura, Jung-min Hwang, and Do-won Kwak. Soon after a stranger arrives in a little village, a mysterious sickness starts spreading. A policeman, drawn into the incident, is forced to solve the...", "datePublished": "2016-05-12", "keywords": "village,policeman,rain gear,shaman,priest", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 53112, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.5"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt5215952/"}, "author": {"@type": "Person", "name": "ctowyi"}, "dateCreated": "2016-07-31", "inLanguage": "English", "name": "A Smorgasbord of Many Genres and Near un-Killable Zombies", "reviewBody": "SPOILER: This review is extremely difficult to pen without dropping spoilers, but I am going to try...\n\nNa Hong-jin's The Chaser (2008) audaciously broke one of cinema's golden rules to heartbreaking effect. His sophomore effort The Yellow Sea (2010) is a pulsating rush of blood and bone. 6 years later comes The Wailing, a gruesome blend of different genres and it is near impossible to pigeonhole. Na Hong-jin has graduated to a whole new level with The Wailing, a smorgasbord of investigative procedural, humour, horror, supernatural, family drama, and near un-killable zombies. \n\nWhether you are the filmmaker or the viewer, it can be really hard to start a film. No one sitting in the pitch-black cinema is your friend yet and the beginning of any film always feels like a forced act of intimacy for the viewer. A hooker can help. No, I don't mean a prostitute but a good first scene 😬. The Wailing opens with a verse from the Bible, Luke 24:38-39 and cuts to a scene of a forlorn man double hooking a worm before fishing from a boulder. The scene is beguiling, laden with an atmosphere of dread and your consciousness will immediately lock in the little noggin of information that his unusual act has a higher purpose. Two and a half hours later and after a post-movie long table discussion with 13 other animated persons and more than a day of further discussion on a WhatsApp chat group, I am wiser. The first scene of The Wailing is a blue-ribbon winner and so it goes for the rest of the film. \n\nThe big story is easy - a Japanese stranger (Jun Kunimura) arrives in a little village and soon a mysterious sickness starts to spread. Grisly murders ensue and a strange young woman (Chun Woo-Hee) and a bombastic shaman (Hwang Jung-Min) enter into the fray. A bumbling and lazy policeman (Kwak Do Won) is drawn in and he has to get to the crux of the mystery in order to save his daughter. It is the intricate workings of the plot that needs a lot of unpacking. Forget about the age-old Hollywood adage that a good film has a plot that is easily summarised. The last time I had so much fun dismantling and assembling back a movie was Inception!\n\nThe Wailing is a stupendous and sustained piece of masterful storytelling. It is loaded with frightful incidents and stuffed with mystifying characters. On top of that, it is genuinely terrifying as it preys on the goodness of ordinary people. God has seemingly excused Himself from the battleground as can be gleaned from a scene in which the church says it will not lift a finger to help. The story is compelling and riveting, and every twist, turn and outcome totally earned. The movie has a punishing runtime of 156 minutes not because of poor pacing, but because of the intricacies of the plot. There are plenty of bloody scenes for the gore-hounds but they are never ladled out to pump up a sagging plot. The plot never sags, not even for one instance. Na's use of music and sounds to heighten the suspense is brilliant. From plaintive tonal chords in the beginning to a full-blown thunderous \"tong tong qiang\" exorcism ritual, everything adds to the atmosphere of doom. Na has also achieved such sublime tonal shifts that I didn't even notice where I went from laughing out loud to pure heart-parked-in-my-mouth terror. The film is suffused with motifs, religious overtones and thematically rich. Even an innocuous scene of a young woman throwing stones has biblical weight. The storytelling is powerful and the twists perfectly angled into the story. So many times I had that \"aha\" feeling that told me I had the mystery figured out and the motivations of the characters down pat. But on hindsight, I realised the only thing I had figured out early is that this is one incredibly thought provoking piece of filmmaking. The Wailing practically roars through the final act delivering all manners of monstrosity and heartbreaking sadness with aplomb. The movie is long and rich, multilayered and satisfying. Prepare to be toyed, skewered, gutted, stabbed and get ready to be played like a violin. \n\nI know this review is rubbish and ladened with hyperboles, but I did not exaggerate or embellish, and I did you a huge favour by remaining vague with the plot. Believe me, it is extremely hard for me to do that. I know good films when I see them. It is the great ones that are not easy to decide on. The Wailing is not a great film in the strictest sense but it earns its place on a shelf of illustrious films that invite so many good debates with like- minded minds. These are films that are impossible for you to stay shut-up and have everything explained in a few by-lines. These are films that will never leave your head long after they are done, and when you least expect it the tendrils of the narrative will rise up and wrap around your consciousness like tentacles. There are not many films on this particular shelf and all of them have become classics. I do not use the word \"classic\" lightly, but I believe The Wailing may well prove to be one. You know how I know? The movie left more questions than answers in my mind, but yet it was never a frustrating cinematic experience. It is such a wonderful mindfcuk! The year is not over yet, but I have a feeling I will not see another film of this caliber. Films of this type are rare and such superb rare films wail out to be watched and experienced. Experience this.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT2H36M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi4211782681", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTkzMDY1MTUwOV5BMl5BanBnXkFtZTgwNTYwODgwOTE@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTkzMDY1MTUwOV5BMl5BanBnXkFtZTgwNTYwODgwOTE@._V1_.jpg", "description": "A foreigner's mysterious appearance in a quiet, rural village causes suspicion among the locals -- suspicion which quickly turns to hysteria as the townspeople begin killing each other in brutal outbursts for seemingly no reason.  As the investigating officer watches his daughter fall under the same savage spell, he agrees to consult a shaman for answers - unknowingly escalating the situation into something far more dangerous.", "uploadDate": "2016-06-03T14:10:52Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm3483072/?ref_=tt_cl_t1", "name": "Do-won Kwak"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm3483072?ref_=tt_cl_t1", "name": "Jong-goo"}]}, {"actor": {"@type": "Person", "url": "/name/nm0475165/?ref_=tt_cl_t3", "name": "Jun Kunimura"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm0475165?ref_=tt_cl_t3", "name": "Japanese Man"}]}, {"actor": {"@type": "Person", "url": "/name/nm6007240/?ref_=tt_cl_t5", "name": "Hwan-hee Kim"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm6007240?ref_=tt_cl_t5", "name": "Hyo-jin"}]}, {"actor": {"@type": "Person", "url": "/name/nm1255001/?ref_=tt_cl_t7", "name": "Jang So-Yeon"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm1255001?ref_=tt_cl_t7", "name": "Wife"}]}, {"actor": {"@type": "Person", "url": "/name/nm3680865/?ref_=tt_cl_t9", "name": "Kang-gook Son"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm3680865?ref_=tt_cl_t9", "name": "Oh Sung-bok"}]}, {"actor": {"@type": "Person", "url": "/name/nm3776397/?ref_=tt_cl_t11", "name": "Chang-gyu Kil"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm3776397?ref_=tt_cl_t11", "name": "Park Choon-bae"}]}, {"actor": {"@type": "Person", "url": "/name/nm5526245/?ref_=tt_cl_t13", "name": "Mi-nam Jeong"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm5526245?ref_=tt_cl_t13", "name": "Heung-gook"}]}, {"actor": {"@type": "Person", "url": "/name/nm3853141/?ref_=tt_cl_t15", "name": "Seung-chul Baek"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm3853141?ref_=tt_cl_t15", "name": "Friend"}]}, {"actor": {"@type": "Person", "url": "/name/nm1058565/?ref_=tt_cl_t2", "name": "Jung-min Hwang"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm1058565?ref_=tt_cl_t2", "name": "Il-gwang"}]}, {"actor": {"@type": "Person", "url": "/name/nm3825915/?ref_=tt_cl_t4", "name": "Woo-hee Chun"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm3825915?ref_=tt_cl_t4", "name": "The Mysterious Woman"}]}, {"actor": {"@type": "Person", "url": "/name/nm1065461/?ref_=tt_cl_t6", "name": "Jin Heo"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm1065461?ref_=tt_cl_t6", "name": "Mother-in-Law"}]}, {"actor": {"@type": "Person", "url": "/name/nm8760655/?ref_=tt_cl_t8", "name": "Do-yoon Kim"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm8760655?ref_=tt_cl_t8", "name": "Yang Yi-sam"}]}, {"actor": {"@type": "Person", "url": "/name/nm5374082/?ref_=tt_cl_t10", "name": "Seong-yeon Park"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm5374082?ref_=tt_cl_t10", "name": "Kwon Myung-joo"}]}, {"actor": {"@type": "Person", "url": "/name/nm3482978/?ref_=tt_cl_t12", "name": "Bae-soo Jeon"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm3482978?ref_=tt_cl_t12", "name": "Deok-gi"}]}, {"actor": {"@type": "Person", "url": "/name/nm3780600/?ref_=tt_cl_t14", "name": "Gwi-hwa Choi"}, "character_and_episodes": [{"url": "/title/tt5215952/characters/nm3780600?ref_=tt_cl_t14", "name": "Byeong-gyoo"}]}]}