{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0070666/", "name": "Serpico", "image": "https://m.media-amazon.com/images/M/MV5BYTU4ZTI0NzAtYzMwNi00YmMxLThmZWItNTY5NzgyMDAwYWVhXkEyXkFqcGdeQXVyNjUwNzk3NDc@._V1_.jpg", "genre": ["Biography", "Crime", "Drama", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000199/", "name": "Al Pacino"}, {"@type": "Person", "url": "/name/nm0709907/", "name": "John Randolph"}, {"@type": "Person", "url": "/name/nm0444955/", "name": "Jack Kehoe"}, {"@type": "Person", "url": "/name/nm0570161/", "name": "Biff McGuire"}], "director": {"@type": "Person", "url": "/name/nm0001486/", "name": "Sidney Lumet"}, "creator": [{"@type": "Person", "url": "/name/nm0530995/", "name": "Peter Maas"}, {"@type": "Person", "url": "/name/nm0759029/", "name": "Waldo Salt"}, {"@type": "Person", "url": "/name/nm0923319/", "name": "Norman Wexler"}, {"@type": "Organization", "url": "/company/co0054778/"}, {"@type": "Organization", "url": "/company/co0001584/"}], "description": "Serpico is a movie starring Al Pacino, John Randolph, and Jack Kehoe. An honest New York cop named Frank Serpico blows the whistle on rampant corruption in the force only to have his comrades turn against him.", "datePublished": "1973-12-05", "keywords": "police corruption,police,corruption,new york city,undercover cop", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 110945, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0070666/"}, "author": {"@type": "Person", "name": "stryker-5"}, "dateCreated": "2002-01-16", "inLanguage": "English", "name": "\"Unfair.  Unfair!\"", "reviewBody": "Frank Serpico begins his career with the NYPD as an idealistic rookie who believes in the moral value of policing.  He has a simple and old-fashioned ethical code, an outlook which used to be known as honesty. What he finds is a moral sewer, five boroughs wide, in which almost every cop is on the take.  The police are just another gang of hoodlums, but with more guns than the bad guys.  Even basically decent cops go along with the kickback culture, because a locker-room psychology prevails in which values have become perverted.  Squad loyalty is now a criminal conspiracy of silence.  Detectives do not hesitate to shake-down hoods who are slow to pay.  To Frank Serpico, this is simply wrong.  He wants no part of it.  And so his long agony begins.\n\n     Both responding to and helping to shape the mood of its time, a weary cynicism towards authority, \"Serpico\" arrived on the screen just as Watergate built to its climax.  Americans could no longer regard their institutions as gleaming examples to mankind of optimism and good government.  The film begins gloomily with Serpico badly wounded, having been shot in the face.  We hear police and ambulance sirens fading, symbolically representing the life-force ebbing from Frank, and the withering of American dreams.\n\n     This first-class film is a triumph, and one that could easily have misfired.  Had the crooked cops been depicted as mere thugs, then Serpico himself would have been an archetype, just another two-dimensional crusader. What gives the film its psychological richness is the realisation that the dishonest cops are NICE.  These are affable, reasonable men who want to like Serpico and want to welcome him onto the team.  The camaraderie is seductive and it's difficult for Frank to hold out against it.  He is besieged by self-doubt, wondering if he is just a one-man awkward squad, or worse - a prima donna, sacrificing personal relationships on the altar of his own ego.\n\n     Again, the easy (but disastrous) course would have been to give Frank some big heroic speeches, allowing him to inveigh against corruption.  The film chooses instead to go for psychological truth, and this is what makes the project outstanding.  Appalled, afraid and despairing of ever changing anything, Frank withdraws into himself.  He becomes the spectre at the feast, the silent rebuke, the muted but ever-present conscience of his colleagues.\n\n     Though Frank rejects the golden shield which is eventually offered, we feel that the system still means something.  There are still some honest cops, and even after all these vicissitudes, the United States is still a nation of laws.  Lumet's profoundly liberal and optimistic view of America ultimately shines through, but the final mood is one of quiet resignation rather than triumphalism.  Right can prevail over wrong, but a price has to be paid.  Serpico wins his titanic struggle, but he is diminished and saddened as a man.  \n\n     The film contains some marvellous technical things.  In the opening minutes, the action cuts between Frank as he is now (wounded, broken and alone) and as he started out (the clean-cut, idealistic rookie).  These transitions are seamless, and the narrative logic is smooth and natural.  We see Frank's first moment of disenchantment in a cafeteria when it dawns on him that cops get free handouts of food, but they have to take whatever comes.  This first bewilderment develops until we see the gulf open up between Frank and the dishonest cops, the ones who take the money but also take the self-loathing.\n\n     The terrible stress to which Frank is subjected is depicted with skill. The police department has a huge institutional inclination to protect its own, and this vast weight is brought to bear on Serpico.  Equally, the pressure is relieved cleverly at appropriate points in the narrative. Frank's 'collar' of Rudi Casaro reaches an explosive climax as this all too human guy reaches breaking-point.  On the other hand, the romantic story-telling interlude with Laurie and Serpico's undercover cameo as an orthodox rabbi break the tension and vary the pace beautifully.\n\n     The second-unit work is of a uniformly high standard.  We are shown atmospheric New York streetscapes with grubby brownstones and the massive, overbearing masonry of the Brooklyn Bridge, in knowing homage to the films noirs of twenty years earlier.  The symbols are powerful.  This city, and this police department, are too colossal for one man to stand against them. Practice sessions in the police firing gallery intelligently reinforce the film's undercurrent of foreboding.  Paper targets obscure the gunmen's faces, suggesting a monolithic force united against Frank, then come hurtling towards him on pulleys, signifying the fate which is rushing to meet him.\n\n     Mikis (Zorba the Greek) Theodorakis has provided a classy score.  I particularly liked the jazzy, minor-key horn passage.\n\n     Pacino puts in another of the towering performances which have distinguished him as the profoundest acting talent of his era.  He is simply wonderful.  Barbara Eda-Young gives top-notch support as Laurie, the genuinely loving partner who is destroyed by her man's seeming eagerness for martyrdom in rejection of domestic happiness.  If ever an actor exuded confidence it's Tony Roberts, and he is ideally cast as Bob Blair, Serpico's well-connected ally.  Though he can open City Hall doors, he can't actually help Frank at all.  Nobody can.  Christ-like, Frank understands that it is ordained - he must go to the hill alone."}, "duration": "PT2H10M", "trailer": {"@type": "VideoObject", "name": "Trailer", "embedUrl": "/video/imdb/vi1619638809", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNmU0ZjE1NWQtMWE2Ny00OTc3LTkwMGItOGU4ZWRiNjE5NmYwXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNmU0ZjE1NWQtMWE2Ny00OTc3LTkwMGItOGU4ZWRiNjE5NmYwXkEyXkFqcGdeQXRodW1ibmFpbC1pbml0aWFsaXplcg@@._V1_.jpg", "uploadDate": "2018-10-29T19:06:56Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000199/?ref_=tt_cl_t1", "name": "Al Pacino"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0000199?ref_=tt_cl_t1", "name": "Serpico"}]}, {"actor": {"@type": "Person", "url": "/name/nm0444955/?ref_=tt_cl_t3", "name": "Jack Kehoe"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0444955?ref_=tt_cl_t3", "name": "Tom Keough"}]}, {"actor": {"@type": "Person", "url": "/name/nm0248803/?ref_=tt_cl_t5", "name": "Barbara Eda-Young"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0248803?ref_=tt_cl_t5", "name": "Laurie"}]}, {"actor": {"@type": "Person", "url": "/name/nm0731634/?ref_=tt_cl_t7", "name": "Tony Roberts"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0731634?ref_=tt_cl_t7", "name": "Bob Blair"}]}, {"actor": {"@type": "Person", "url": "/name/nm0723590/?ref_=tt_cl_t9", "name": "Allan Rich"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0723590?ref_=tt_cl_t9", "name": "D.A. Tauber"}]}, {"actor": {"@type": "Person", "url": "/name/nm0344013/?ref_=tt_cl_t11", "name": "Edward Grover"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0344013?ref_=tt_cl_t11", "name": "Lombardo"}]}, {"actor": {"@type": "Person", "url": "/name/nm0308056/?ref_=tt_cl_t13", "name": "Hank Garrett"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0308056?ref_=tt_cl_t13", "name": "Malone"}]}, {"actor": {"@type": "Person", "url": "/name/nm0100554/?ref_=tt_cl_t15", "name": "Joseph Bova"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0100554?ref_=tt_cl_t15", "name": "Potts"}]}, {"actor": {"@type": "Person", "url": "/name/nm0709907/?ref_=tt_cl_t2", "name": "John Randolph"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0709907?ref_=tt_cl_t2", "name": "Sidney Green"}]}, {"actor": {"@type": "Person", "url": "/name/nm0570161/?ref_=tt_cl_t4", "name": "Biff McGuire"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0570161?ref_=tt_cl_t4", "name": "Captain McClain"}]}, {"actor": {"@type": "Person", "url": "/name/nm0789208/?ref_=tt_cl_t6", "name": "Cornelia Sharpe"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0789208?ref_=tt_cl_t6", "name": "Leslie"}]}, {"actor": {"@type": "Person", "url": "/name/nm0575590/?ref_=tt_cl_t8", "name": "John Medici"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0575590?ref_=tt_cl_t8", "name": "Pasquale"}]}, {"actor": {"@type": "Person", "url": "/name/nm0650317/?ref_=tt_cl_t10", "name": "Norman Ornellas"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0650317?ref_=tt_cl_t10", "name": "Rubello"}]}, {"actor": {"@type": "Person", "url": "/name/nm0376318/?ref_=tt_cl_t12", "name": "Albert Henderson"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0376318?ref_=tt_cl_t12", "name": "Peluce"}]}, {"actor": {"@type": "Person", "url": "/name/nm0495023/?ref_=tt_cl_t14", "name": "Damien Leake"}, "character_and_episodes": [{"url": "/title/tt0070666/characters/nm0495023?ref_=tt_cl_t14", "name": "Joey"}]}]}