{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0402399/", "name": "The New World", "image": "https://m.media-amazon.com/images/M/MV5BMTdjNjQ5ZTAtODJlZi00MzcyLWJjY2UtNDZhNTJkYjlkNGY5XkEyXkFqcGdeQXVyMTQxNzMzNDI@._V1_.jpg", "genre": ["Biography", "Drama", "History", "Romance"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm0268199/", "name": "Colin Farrell"}, {"@type": "Person", "url": "/name/nm0452963/", "name": "Q'orianka Kilcher"}, {"@type": "Person", "url": "/name/nm0001626/", "name": "Christopher Plummer"}, {"@type": "Person", "url": "/name/nm0000288/", "name": "Christian Bale"}], "director": {"@type": "Person", "url": "/name/nm0000517/", "name": "Terrence Malick"}, "creator": [{"@type": "Person", "url": "/name/nm0000517/", "name": "Terrence Malick"}, {"@type": "Organization", "url": "/company/co0046718/"}, {"@type": "Organization", "url": "/company/co0041459/"}, {"@type": "Organization", "url": "/company/co0129833/"}, {"@type": "Organization", "url": "/company/co0136710/"}, {"@type": "Organization", "url": "/company/co0142432/"}], "description": "The New World is a movie starring Colin Farrell, Q'orianka Kilcher, and Christopher Plummer. The story of the English exploration of Virginia, and of the changing world and loves of Pocahontas.", "datePublished": "2006-01-13", "keywords": "fort,native american,cult favorite,native american culture,foreigner", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 83255, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0402399/"}, "author": {"@type": "Person", "name": "samseescinema"}, "dateCreated": "2005-12-15", "inLanguage": "English", "name": "a deep artistic pleasure", "reviewBody": "The New World \n\nreviewed by Sam Osborn rating: 3.5 out of 4 \n\nFiling out of The New World, completely speechless and without notes, I could fathom only single adjectives to describe the experience. Looking at these listed words on my memo-pad now, they read \"Thunderous, True, Beautiful, Solemn, Forceful, Gripping, Honest, and Slow.\" And for those who watch The New World with a calm countenance, an open mind and a ready cache of patience, Terrence Malick's long-awaited picture will have a similar effect. The film is a masterpiece thirty years in the making. \n\nHis goal is plain enough: to affectively and honestly portray the love Pocahontas experienced in those first years that Europeans cut their first, fresh swath from the New World. But Malick goes far beyond a simplistic love story. I was at the screening for Casanova a few days earlier, where the film's objective was essentially the same: to portray the love between Casanova and Francesca in the days of Inquisition Venice. But where Casanova approaches love at a bubbly, comedic perspective, The New World throws itself into a headlong narration of love's sorrow. Every frame of The New World reflects this painful, aching emotion, utilizing the sounds and images of environment to incredible, innovative effect. The first shot of the film--an extended shot several minutes in length--finds the camera staring into a river. It's clear and pristine, carefree and surrounded by the blissful sounds of an unperturbed forest. Soon ripples begin forming, and we notice the quiet droplets of rain pit-pattering around us, causing the water to flow a little, bringing about a contented onslaught of lily pedals. The scene continues on, drawing us farther and farther into Malick's deafening reality with only the sounds and images of nature. He creates a calm within us with these images, a kind of serene canvas for him to later paint the vivid brush-strokes of human love later in the film. In this entire first act, little is even said. But these scenes rarely grow tiring. He finds rich beauty with every situation. His forest is lush and his settlements picturesquely Dickensian. Malick shows great and rare confidence with this picture. Few filmmakers would have the cool audacity to create a film so primarily reliant on nothing being said. \n\nThe first and most important of Pocahontas' (Q'Orianka Kilcher) romances is with the infamous John Smith (Colin Farrell). He's brought to the New World bound in a cage, punished for earlier mutiny. But because he's the only soldier of the expedition, Captain Newport (Christopher Plummer) opts to let him free on a strict probation. Their first encounters with the Naturals, as they're called, go coolly enough, with curious interest from the Naturals and tense hesitation from the settlers. And even here Malick plays with flights of romantic whimsy. These scenes of first encounter are shot in windswept, overgrown grassy fields, with Pocahontas dancing and twirling about them with her brother, catching the spry interest of Smith.\n\nSoon the settlers hear of a great city of Naturals down the river, and Smith is sent to investigate. Things have been going badly for the settlers and Captain Newport has left back for London and a new store of food and supplies. Smith's expedition is cut short, however, when he runs into a narrow, maze-like complex of swamps and is ambushed by warrior Naturals. He's taken prisoner by the Naturals, but granted life because of Pocahontas' curious interest and her favoritism with Chief Powhatan (August Schellenberg). This catalyzes our entrance into The New World's most prominent territory. The scenes of Smith's time with the Naturals are Malick's best. They're those first strokes of paint on his canvas and the seeds of that palpable, historical romance.\n\nBut admittedly, even with The New World's supreme sense of confidence and slow-moving progression, it sometimes wanders into the realm of self-indulgence. It especially grows tiresome in the final act, when we're brought from Virginia to London, our beloved Smith left behind to be replaced by John Rolfe (Christian Bale) and his stonewall courting of Pocahontas. I'd even venture to say that Malick could have left 30 minutes of these segments on the editing room floor, re-attaching them later to the Extended Cut DVD release that's sure to come. But movie-going patience is the mantra of the Awards season, and so some bottom-dragging in films is what's to be expected.\n\nWhat was not to be expected, however, was Q'Orianka Kilcher, the debuting actress playing Pocahontas. Few words she says, but dialogue is not always what makes a forceful performance. Her body language and expressions are allowed to do the speaking for her. She's advantaged also by her strong, muscular features that often betray hints of divine femininity. Farrell also does well, particularly in his somber narration. He reads it as though he speaks the words to himself, whispering them almost, for only his imagination to hear. But his physicality is manipulated nicely as well, exuding bubbly chemistry for Kilcher. The two mix ideally. Their sorrow and love and deeply resonated emotions are echoed about with their strong performances and Malick's supreme direction. And although Christian Bale strides into picture in the latter parts of the film, our hearts lie with Smith and Pocahontas, and we find ourselves resentful of Rolfe's advances. But this is just Malick's narrative trickery. We find ourselves raggedly torn between these two equally honorable men, and put almost into the same position as Pocahontas. It's precisely the reason we go to the movies. We've let the director take his grip on us and lead us down the path into characters and identities of his own creation. And with Malick leading our way, and with characters as tastefully dimensional as these, movie-going becomes a deep artistic pleasure.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "9"}}, "duration": "PT2H15M", "trailer": {"@type": "VideoObject", "name": "The New World: The Extended Cut", "embedUrl": "/video/imdb/vi1642725657", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMmRjYTFmYzctNjIzNi00NTQyLWI1OTItMTNmZTEwNjEwZjgzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMmRjYTFmYzctNjIzNi00NTQyLWI1OTItMTNmZTEwNjEwZjgzXkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Home Video Trailer from Warner Home Video", "uploadDate": "2008-06-30T03:43:21Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0268199/?ref_=tt_cl_t1", "name": "Colin Farrell"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0268199?ref_=tt_cl_t1", "name": "Captain Smith"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001626/?ref_=tt_cl_t3", "name": "Christopher Plummer"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0001626?ref_=tt_cl_t3", "name": "Captain Newport"}]}, {"actor": {"@type": "Person", "url": "/name/nm0770763/?ref_=tt_cl_t5", "name": "August Schellenberg"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0770763?ref_=tt_cl_t5", "name": "Powhatan"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000667/?ref_=tt_cl_t7", "name": "David Thewlis"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0000667?ref_=tt_cl_t7", "name": "Wingfield"}]}, {"actor": {"@type": "Person", "url": "/name/nm0874232/?ref_=tt_cl_t9", "name": "Raoul Max Trujillo"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0874232?ref_=tt_cl_t9", "name": "Tomocomo"}]}, {"actor": {"@type": "Person", "url": "/name/nm0703398/?ref_=tt_cl_t11", "name": "Kalani Queypo"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0703398?ref_=tt_cl_t11", "name": "Parahunt"}]}, {"actor": {"@type": "Person", "url": "/name/nm0852965/?ref_=tt_cl_t13", "name": "Noah Taylor"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0852965?ref_=tt_cl_t13", "name": "Selway"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001035/?ref_=tt_cl_t15", "name": "Ben Chaplin"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0001035?ref_=tt_cl_t15", "name": "Robinson"}]}, {"actor": {"@type": "Person", "url": "/name/nm0452963/?ref_=tt_cl_t2", "name": "Q'orianka Kilcher"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0452963?ref_=tt_cl_t2", "name": "Pocahontas"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000288/?ref_=tt_cl_t4", "name": "Christian Bale"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0000288?ref_=tt_cl_t4", "name": "John Rolfe"}]}, {"actor": {"@type": "Person", "url": "/name/nm0836071/?ref_=tt_cl_t6", "name": "Wes Studi"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0836071?ref_=tt_cl_t6", "name": "Opechancanough"}]}, {"actor": {"@type": "Person", "url": "/name/nm0905691/?ref_=tt_cl_t8", "name": "Yorick van Wageningen"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0905691?ref_=tt_cl_t8", "name": "Captain Argall"}]}, {"actor": {"@type": "Person", "url": "/name/nm0340729/?ref_=tt_cl_t10", "name": "Michael Greyeyes"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0340729?ref_=tt_cl_t10", "name": "Rupwew"}]}, {"actor": {"@type": "Person", "url": "/name/nm0578853/?ref_=tt_cl_t12", "name": "Ben Mendelsohn"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0578853?ref_=tt_cl_t12", "name": "Ben"}]}, {"actor": {"@type": "Person", "url": "/name/nm0639928/?ref_=tt_cl_t14", "name": "Brían F. O'Byrne"}, "character_and_episodes": [{"url": "/title/tt0402399/characters/nm0639928?ref_=tt_cl_t14", "name": "Lewes"}]}]}