{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt1229822/", "name": "Jane Eyre", "image": "https://m.media-amazon.com/images/M/MV5BNjU0Mjc0NzU3NF5BMl5BanBnXkFtZTcwMTU4OTkwNA@@._V1_.jpg", "genre": ["Drama", "Romance"], "contentRating": "PG-13", "actor": [{"@type": "Person", "url": "/name/nm1985859/", "name": "Mia Wasikowska"}, {"@type": "Person", "url": "/name/nm1055413/", "name": "Michael Fassbender"}, {"@type": "Person", "url": "/name/nm0068260/", "name": "Jamie Bell"}, {"@type": "Person", "url": "/name/nm0254332/", "name": "Su Elliot"}], "director": {"@type": "Person", "url": "/name/nm1560977/", "name": "Cary Joji Fukunaga"}, "creator": [{"@type": "Person", "url": "/name/nm0111576/", "name": "Charlotte Brontë"}, {"@type": "Person", "url": "/name/nm1620490/", "name": "Moira Buffini"}, {"@type": "Organization", "url": "/company/co0042399/"}, {"@type": "Organization", "url": "/company/co0103694/"}, {"@type": "Organization", "url": "/company/co0104115/"}, {"@type": "Organization", "url": "/company/co0087854/"}], "description": "Jane Eyre is a movie starring Mia Wasikowska, Michael Fassbender, and Jamie Bell. A mousy governess who softens the heart of her employer soon discovers that he's hiding a terrible secret.", "datePublished": "2011-03-18", "keywords": "yorkshire,character name as title,secret,governess,friendship", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 82141, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.3"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt1229822/"}, "author": {"@type": "Person", "name": "FlixChatter"}, "dateCreated": "2011-03-28", "inLanguage": "English", "name": "A worthy adaptation... but left me wanting more", "reviewBody": "The oft-filmed Charlotte Brontë's Gothic novel has been adapted into TV and film more than two dozen times. Here's a summary of what works and what doesn't in this 2011 version:\n\nTHE GOOD: \n\n\u0095 Cary Fukunaga's direction. He preferred natural light for much of the film, forgoing camera lighting and instead opted for candles which created the proper dark, moody and gloomy atmosphere that matches Rochester's temperament perfectly. He used some hand-held camera work to great effect, but not too much so that it became distracting. Thornfield Hall, Rochester's expansive mansion looked like something Count Dracula could comfortably settle in. It practically becomes its own character here and adds the necessary spookiness we come to expect from this Gothic tale.\n\n\u0095 Judi Dench as Mrs. Fairfax – When does Dame Judi ever disappoint? Apparently never. Even in small roles, the scenes she's in are one of the best ones in the movie. There was an important scene involving Jane and Rochester where Mrs. Fairfax didn't utter a single word, but she made quite an impact just with her expression.\n\n\u0095 Mia Wasikowska as Jane. A lot of the issues I have with literary adaptation is that the supposedly plain heroine usually ends up being played actresses who are too glamorous for the role. Fortunately in this one, Wasikowska was believable as a plain young girl, though she obviously is a pretty girl. At 18, she's also the perfect age for the role. If I were to nitpick though, she's not exactly 'little' as she's described in the novel as Rochester doesn't quite tower over her. In any case, I thought she did a wonderful job carrying the film. She captures the essence of the strong-willed character who holds her own against her much older subject of her affection, and one who despite 'not being well-acquainted with men' doesn't seem intimidated by them.\n\n\u0095 Michael Fassbender as Rochester. In many ways, we evaluate a Jane Eyre adaptation by its Rochester, and as long as we use that 'calculation,' I think he measures up quite well. He has a strong screen presence and is the kind of actor who's usually the best thing even in a so-so film, and he makes the most of what's given to him. Even with the relatively short screen time, which is less than what I had hoped, he's able to make us care for Rochester. \n\nTHE NOT-SO-GOOD: \n\n\u0095 This cliff-notes version feels way too fast. With a complex story like this, no doubt it'd be a challenge for any filmmaker, no matter how talented, to pare it down into a two-hour movie. So it's inevitable that this film just moves along too quick for me. Of course that is not Fukunaga's fault and he really made the best of it, but still this version just leaves me wanting more. I guess this is perhaps a more 'accessible' version for the crowd that otherwise would not watch JE. But to me, the story is compelling enough that an extra half-hour would only enhance the viewing experience and allow enough time for the characters to develop an authentic connection.\n\n\u0095 Dialog omission. This is perhaps a result of being 'spoiled' by the comprehensive 1983 version (which at 5.5 hours is perhaps the longest screen adaptation). Of course it's impossible to include every single dialog from the book, but I was hoping at least some of the important ones are kept. The famous quotes such as \"I am no bird; and no net ensnares me\", \"Do as I do: trust in God and yourself\", \"Reader, I married him\" are not spoken in this adaptation. I also find some of the delivery lacks bite, y'know that certain oomph that an actor does to bring those timeless words to life.\n\n\u0095 Jamie Bell seems miscast. Now, keep in mind I really like Jamie as an actor and have said so many times on my blog (http://tinyurl.com/mozzs5) However, I don't feel he's right for the role of St. John Rivers. Firstly, when you've already got someone as striking as Fassbender as Rochester, I'd think the casting agent would have to find someone much fairer than he. No offense to Jamie, but that's not the case here and he certainly doesn't fit the book description of 'tall, fair with blue eyes, and with a Grecian profile.' Now, physical appearance aside, he also lack the solemn and pious sensibility of a Christian missionary.\n\n\u0095 Unconventional storyline – Moira Buffini's script tells the story in flashback mode instead of following the novel's linear storyline. The movie starts off right as Jane is leaving Thornfield, which is right smack dab where the main crisis of the story begins. Now, I can understand that it's done to make it less tedious, yet it gets confusing at times to figure out which part happens in the past or present. I think for someone not familiar with the book, the shuffled time line might be a bit tough to follow.\n\nIN CONCLUSION, despite leaving the theater wanting more, I do think this is a worthy adaptation. The production quality is top notch, with gorgeous cinematography, affecting light work and music that serve the story well. There is even one scene of Jane and Rochester that Fukunaga took liberty with that's quite tantalizing. It caught me off guard but I must say that scene left me breathless and is an effective way to convey how much Jane longed for her true love.\n\nBut in the end, even though I adore Fassbender, he still hasn't replaced Timothy Dalton as my favorite Rochester. Sure, the production quality of this one is superior, but what makes a Jane Eyre story so fascinating and memorable are the heart-wrenching connection between the two main protagonists and the dialog spoken between them, so in that regard, the 1983 version is still the one to beat.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT2H", "trailer": {"@type": "VideoObject", "name": "Jane Eyre: Trailer #1", "embedUrl": "/video/imdb/vi3294271769", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjA5Njk3MTYyNl5BMl5BanBnXkFtZTcwMTk4OTkwNA@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjA5Njk3MTYyNl5BMl5BanBnXkFtZTcwMTk4OTkwNA@@._V1_.jpg", "description": "A mousy governess who softens the heart of her employer soon discovers that he's hiding a terrible secret.", "uploadDate": "2010-11-16T15:04:17Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm1985859/?ref_=tt_cl_t1", "name": "Mia Wasikowska"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm1985859?ref_=tt_cl_t1", "name": "Jane Eyre"}]}, {"actor": {"@type": "Person", "url": "/name/nm0254332/?ref_=tt_cl_t3", "name": "Su Elliot"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm0254332?ref_=tt_cl_t3", "name": "Hannah"}]}, {"actor": {"@type": "Person", "url": "/name/nm1708957/?ref_=tt_cl_t5", "name": "Tamzin Merchant"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm1708957?ref_=tt_cl_t5", "name": "Mary Rivers"}]}, {"actor": {"@type": "Person", "url": "/name/nm1064292/?ref_=tt_cl_t7", "name": "Craig Roberts"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm1064292?ref_=tt_cl_t7", "name": "John Reed"}]}, {"actor": {"@type": "Person", "url": "/name/nm0394324/?ref_=tt_cl_t9", "name": "Lizzie Hopley"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm0394324?ref_=tt_cl_t9", "name": "Miss Abbot"}]}, {"actor": {"@type": "Person", "url": "/name/nm3805735/?ref_=tt_cl_t11", "name": "Freya Wilson"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm3805735?ref_=tt_cl_t11", "name": "Eliza Reed"}]}, {"actor": {"@type": "Person", "url": "/name/nm0564402/?ref_=tt_cl_t13", "name": "Simon McBurney"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm0564402?ref_=tt_cl_t13", "name": "Mr. Brocklehurst"}]}, {"actor": {"@type": "Person", "url": "/name/nm3532148/?ref_=tt_cl_t15", "name": "Freya Parks"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm3532148?ref_=tt_cl_t15", "name": "Helen Burns"}]}, {"actor": {"@type": "Person", "url": "/name/nm0068260/?ref_=tt_cl_t2", "name": "Jamie Bell"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm0068260?ref_=tt_cl_t2", "name": "St John Rivers"}]}, {"actor": {"@type": "Person", "url": "/name/nm0334441/?ref_=tt_cl_t4", "name": "Holliday Grainger"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm0334441?ref_=tt_cl_t4", "name": "Diana Rivers"}]}, {"actor": {"@type": "Person", "url": "/name/nm3628485/?ref_=tt_cl_t6", "name": "Amelia Clarkson"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm3628485?ref_=tt_cl_t6", "name": "Young Jane"}]}, {"actor": {"@type": "Person", "url": "/name/nm1020089/?ref_=tt_cl_t8", "name": "Sally Hawkins"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm1020089?ref_=tt_cl_t8", "name": "Mrs. Reed"}]}, {"actor": {"@type": "Person", "url": "/name/nm2479184/?ref_=tt_cl_t10", "name": "Jayne Wisener"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm2479184?ref_=tt_cl_t10", "name": "Bessie"}]}, {"actor": {"@type": "Person", "url": "/name/nm3241196/?ref_=tt_cl_t12", "name": "Emily Haigh"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm3241196?ref_=tt_cl_t12", "name": "Georgiana Reed"}]}, {"actor": {"@type": "Person", "url": "/name/nm0567372/?ref_=tt_cl_t14", "name": "Sandy McDade"}, "character_and_episodes": [{"url": "/title/tt1229822/characters/nm0567372?ref_=tt_cl_t14", "name": "Miss Scatcherd"}]}]}