{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt4218572/", "name": "Widows", "image": "https://m.media-amazon.com/images/M/MV5BMjM3ODc5NDEyOF5BMl5BanBnXkFtZTgwMTI4MDcxNjM@._V1_.jpg", "genre": ["Crime", "Drama", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0205626/", "name": "Viola Davis"}, {"@type": "Person", "url": "/name/nm0735442/", "name": "Michelle Rodriguez"}, {"@type": "Person", "url": "/name/nm4456120/", "name": "Elizabeth Debicki"}], "director": {"@type": "Person", "url": "/name/nm2588606/", "name": "Steve McQueen"}, "creator": [{"@type": "Person", "url": "/name/nm5058839/", "name": "Gillian Flynn"}, {"@type": "Person", "url": "/name/nm2588606/", "name": "Steve McQueen"}, {"@type": "Person", "url": "/name/nm0478852/", "name": "Lynda La Plante"}, {"@type": "Organization", "url": "/company/co0007127/"}, {"@type": "Organization", "url": "/company/co0230132/"}, {"@type": "Organization", "url": "/company/co0197272/"}, {"@type": "Organization", "url": "/company/co0718214/"}, {"@type": "Organization", "url": "/company/co0007127/"}], "description": "Widows is a movie starring Viola Davis, Michelle Rodriguez, and Elizabeth Debicki. Four women with nothing in common except a debt left behind by their dead husbands' criminal activities take fate into their own hands and conspire...", "datePublished": "2018-11-06", "keywords": "heist,car chase,based on tv series,politician,girl gang", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 89554, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.9"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt4218572/"}, "author": {"@type": "Person", "name": "michaeljohnson-27597"}, "dateCreated": "2018-10-01", "inLanguage": "English", "name": "My most disappointing film at TIFF 2018...", "reviewBody": "I'm reminded of an interesting experience four years ago, at TIFF 2014. Over-hearing what some people were saying online on film forums, and in line waiting for Antoine Fuqua's The Equalizer, many were discussing \"Is this a Festival film?\".\n\nIt was arguably the most elitist thing I've heard about a film (and I've been to film school, where elitists thrive) because I always thought of film as something that engages everyone, and festivals are an amazing way to create awareness and engagement from the casual film-goer to those aforementioned elitists. \n\nWhy Director Steve McQueen's Widows reminded me of this experience is because the two films, on the surface, have much in common. Both Fuqua and McQueen enjoyed tremendous critical success with some of their previous films, even directing actors to Oscar-winning roles. Both men are a strong proponent of this generations' growing diversification in terms of directors; mentors to help young minority filmmakers find their own voice. Both men, when releasing these respected films in the Equalizer and Widows, based the films off an older television show, and created films that have much more of an action or thriller atmosphere than their previous resume.\n\nAnd both, in my opinion, played it safe.\n\nWhen I reviewed The Equalizer, I thought it unfortunately fell back on action movie tropes and convenience; that Fuqua, who had pushed the boundaries of drama and action before, didn't take any chances. McQueen, sadly, took a page out of that book with Widows.\n\nThe story follows four women, lead by Veronica (the amazing Viola Davis) who come together after Veronica's husband, Harry (Liam Neeson) and his crew of criminals are killed during a heist. Veronica then gathers most of the widows as they need to pull off another job to help settle things in their life, and with an angered gang leader, who was the individual Harry robbed.  1.jpg If Davis and Neeson aren't enough of a draw for you (and they should be, as they most definitely carry the film) then might I add that this is one of the greatest ensembles put together I have seen in a long time. Icons like Robert Duvall, big names like Colin Farrell, new stars like Elizabeth Debicki and Daniel Kaluuya, action mavens like Michelle Rodriguez, and some of the best actors television has offered in recent memory with names like Jon Bernthal (Walking Dead, Punisher), Carrie Coon (Fargo) and Brian Tyree Henry (Atlanta). This was the draw for me. I couldn't believe what a collective McQueen had assembled.\n\nI can only assume they believed in the project, however, after viewing the film, I no longer believe. I felt so many of the characters were stereotypes, archetypes or any other kind of type. Tom Mulligan (Duvall) and Jatemme Mannin (Kaluuya) stuck out the most. Both characters, who were antagonists were simply there to be hated, and in every way did McQueen play up the villainous tropes. Mulligan was just a mean-old-coot with all the characteristics we've come to hate about this burgeoning America; he was rich, white, racist and politically corrupt. A subtle comment on social equality and today's western world? Perhaps... but not that subtle. His character didn't even completely seem necessary. Jack Mulligan, his son (played by Colin Farrell) was the more interesting and layered character, caught between his father's crimes, his hatred for his father, yet still pushing to maintain the legacy and safety his family has built. If you removed the older Mulligan, the film would have remained pretty much the same which is a true waste of Duvall's talents. Kaluuya, who broke out in last years' Get Out was the biggest waste. His Jatemme was another character that could have either been amalgamated or cut completely. While the character had almost nothing to give a solid actor like Kaluuya, I even found the way he was played was too over-the-top villainous, throwing paraplegics from wheelchairs and killing without reason or remorse. \n\nThere were several aspects of the cast I was excited about, yet ultimately disappointed with. I was excited about Bernthal and Coon, but they're barely in the film. Even Neeson has very limited screen time, his role mostly comprised of flashbacks. Debicki is another gifted actor whose character was not given enough time or development to give the actor a chance. I would dare say that with the exception of Davis (again) almost all of the characters were one-dimensional. \n\nWithout Davis' Veronica, there is almost no one or nothing to latch onto in the story, (This may in fact be one of the downfalls of such a large ensemble and such an ambitious story). Luckily with Davis at the helm, steering this otherwise sinking ship, you can at least enjoy another powerful performance by this seasoned and award-winning actor. Veronica also represents the main point of the film, which is McQueen's focus on creating strong female characters. The Widows are in fact quite strong, one way or another, many of. I think with more time and a better rounded script, they could have all shown that. Sadly, once again, it seemed like the easy answer was to show physical prowess instead of inner strength or intellect; showing how fast Cynthia Erivo's Belle can run, showing Michelle Rodriguez's trademark Latina attitude, or showing Viola Davis' impressive musculature. Davis was the only character who on more than one occasion showed true inner strength and intellect, as she was not only capable of being Harry's equal in terms of planning and leading a heist, but perhaps even out-doing him. \n\nYet that subtext falls flat in many of the other characters. McQueen and his co-writer Gillian Flynn constantly attempt to show strength in these women, but fall just short. They constantly try to convey other sub-textual elements like the class war, or the way men treat women, but again, fall short. They merely introduce concepts and perhaps give them one other small moment within the film, but I never found any theme truly woven throughout the story. The element that was the biggest disappointment to me wasn't McQueen's direction, it was Flynn's writing - I was enamored with Gone Girl (ironically also released in 2014) as I thought the development, the twists, and ironically again, the breadth of strong female characters was near perfect. \n\nFor Flynn to be so near-perfect in her previous screenwriting endeavor, to create such intrigue, to masterfully reveal twists, and to develop the depth of character she did makes this endeavor that much more disappointing. Granted, she was adapting her own novel at the time, but she certainly has the writing talent and the tools available to have made Widows something special, or exhilarating, but instead it falls flat in every respect. The so-called twists especially were completely wasted. Mid way through the film, there is a major revelation that could have taken the story in so many different directions, and yet, once again, it went in the safest route possible. \n\nEverything about Widows whispered \"missed opportunity\" to me, and I call it a whisper because the experience of viewing it was akin to waiting quietly, patiently, but then ultimately realizing my expectations were never going to be fulfilled. While the film starts with some intrigue and excitement, it becomes more and more predictable. The conclusion has been seen several times before in one iteration or another, and especially after the conclusion, I realized there were several plot holes and that my suspension of disbelief for some of the cinematic convenience had been stretched too thin over too much time. You may think I'm simply being too overly critical (even for a guy who has a job title with 'critic' in it), but the fact is, there were reactions from my fellow audience members that were inexplicably inappropriate. There were several moments where I'm positive the scene was projected to be dramatic or sad, but some TIFF goers were laughing. That's a serious issue that goes past someone's terrible individual sense of humor, that's a failure of the director and the actors to convey the intended tone and emotion. \n\nYou can't argue that a film like Widows, with its pedigree of direction, writing and one of the most impressive casts recruited is a Festival Film. Having seen the packed house at TIFF, you also can't argue that it will have thousands of fans clamoring to see it in theaters. What I can argue is whether it is the film it could have been. Flynn could have written a much tauter thriller. McQueen could have balanced the characters and pace of the film better. The actors could have tried to create more depth rather than surface level tropes. The potential with this group of artists far exceeds what was actually presented, but more importantly, so much of the movie has been done before. This goes beyond simply remaking a television show, but telling the story in a cinematic manner that is neither original nor inspired. I merely felt with all the talent this film had going in, what came out of it made Widows my most disappointing film at TIFF this year.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "6"}}, "duration": "PT2H9M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi3358178073", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BM2ZhODdhN2YtNDYzNC00MjUxLTljNWYtZGQzMzlmNjk2N2U2XkEyXkFqcGdeQW1yb3NzZXI@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BM2ZhODdhN2YtNDYzNC00MjUxLTljNWYtZGQzMzlmNjk2N2U2XkEyXkFqcGdeQW1yb3NzZXI@._V1_.jpg", "description": "Set in contemporary Chicago, amidst a time of turmoil, four women with nothing in common except a debt left behind by their dead husbands' criminal activities, take fate into their own hands, and conspire to forge a future on their own terms.", "uploadDate": "2018-08-15T13:09:18Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0205626/?ref_=tt_cl_t1", "name": "Viola Davis"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm0205626?ref_=tt_cl_t1", "name": "Veronica"}]}, {"actor": {"@type": "Person", "url": "/name/nm1256532/?ref_=tt_cl_t3", "name": "Jon Bernthal"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm1256532?ref_=tt_cl_t3", "name": "Florek"}]}, {"actor": {"@type": "Person", "url": "/name/nm0331560/?ref_=tt_cl_t5", "name": "Coburn Goss"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm0331560?ref_=tt_cl_t5", "name": "Jimmy Nunn"}]}, {"actor": {"@type": "Person", "url": "/name/nm9351801/?ref_=tt_cl_t7", "name": "Alejandro Verdin"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm9351801?ref_=tt_cl_t7", "name": "Xavy"}]}, {"actor": {"@type": "Person", "url": "/name/nm4456120/?ref_=tt_cl_t9", "name": "Elizabeth Debicki"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm4456120?ref_=tt_cl_t9", "name": "Alice"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000380/?ref_=tt_cl_t11", "name": "Robert Duvall"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm0000380?ref_=tt_cl_t11", "name": "Tom Mulligan"}]}, {"actor": {"@type": "Person", "url": "/name/nm2838507/?ref_=tt_cl_t13", "name": "Molly Kunz"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm2838507?ref_=tt_cl_t13", "name": "Siobhan"}]}, {"actor": {"@type": "Person", "url": "/name/nm3109964/?ref_=tt_cl_t15", "name": "Brian Tyree Henry"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm3109964?ref_=tt_cl_t15", "name": "Jamal Manning"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000553/?ref_=tt_cl_t2", "name": "Liam Neeson"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm0000553?ref_=tt_cl_t2", "name": "Harry Rawlings"}]}, {"actor": {"@type": "Person", "url": "/name/nm2636310/?ref_=tt_cl_t4", "name": "Manuel Garcia-Rulfo"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm2636310?ref_=tt_cl_t4", "name": "Carlos"}]}, {"actor": {"@type": "Person", "url": "/name/nm0735442/?ref_=tt_cl_t6", "name": "Michelle Rodriguez"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm0735442?ref_=tt_cl_t6", "name": "Linda"}]}, {"actor": {"@type": "Person", "url": "/name/nm9405154/?ref_=tt_cl_t8", "name": "Bailey Rhyse Walters"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm9405154?ref_=tt_cl_t8", "name": "Gracie"}]}, {"actor": {"@type": "Person", "url": "/name/nm4689420/?ref_=tt_cl_t10", "name": "Carrie Coon"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm4689420?ref_=tt_cl_t10", "name": "Amanda"}]}, {"actor": {"@type": "Person", "url": "/name/nm0268199/?ref_=tt_cl_t12", "name": "Colin Farrell"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm0268199?ref_=tt_cl_t12", "name": "Jack Mulligan"}]}, {"actor": {"@type": "Person", "url": "/name/nm2679699/?ref_=tt_cl_t14", "name": "James Vincent Meredith"}, "character_and_episodes": [{"url": "/title/tt4218572/characters/nm2679699?ref_=tt_cl_t14", "name": "John"}, {"url": "/title/tt4218572/characters/nm2679699?ref_=tt_cl_t14", "name": "Mulligan Man"}]}], "details": {"Country": ["UK", "USA"], "Language": ["English", "Spanish", "Polish"], "Release Date": ["16 November 2018 (USA)"], "Also Known As": ["Widows"], "Filming Locations": ["Chicago, Illinois, USA"], "Budget": ["$42,000,000", "(estimated)"], "Opening Weekend USA": ["$12,361,307,", "18 November 2018"], "Gross USA": ["$42,402,632"], "Cumulative Worldwide Gross": ["$75,984,700"], "Production Co": ["New Regency Productions", "See-Saw Films", "Film4"], "Runtime": ["129 min"], "Sound Mix": ["Dolby Atmos"], "Aspect Ratio": ["2.39 : 1"]}}