{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0093640/", "name": "No Way Out", "image": "https://m.media-amazon.com/images/M/MV5BMzliYmFjZmYtMTQ4OS00MmM1LWI2NDItYWNkMTBhZWY2M2QwL2ltYWdlXkEyXkFqcGdeQXVyNjU0OTQ0OTY@._V1_.jpg", "genre": ["Action", "Crime", "Drama", "Mystery", "Romance", "Thriller"], "contentRating": "R", "actor": [{"@type": "Person", "url": "/name/nm0000126/", "name": "Kevin Costner"}, {"@type": "Person", "url": "/name/nm0000432/", "name": "Gene Hackman"}, {"@type": "Person", "url": "/name/nm0000707/", "name": "Sean Young"}, {"@type": "Person", "url": "/name/nm0001599/", "name": "Will Patton"}], "director": {"@type": "Person", "url": "/name/nm0002044/", "name": "Roger Donaldson"}, "creator": [{"@type": "Person", "url": "/name/nm0269879/", "name": "Kenneth Fearing"}, {"@type": "Person", "url": "/name/nm0307561/", "name": "Robert Garland"}, {"@type": "Person", "url": "/name/nm0307561/", "name": "Robert Garland"}, {"@type": "Organization", "url": "/company/co0001995/"}], "description": "No Way Out is a movie starring Kevin Costner, Gene Hackman, and Sean Young. A coverup and witchhunt occur after a politician accidentally kills his mistress.", "datePublished": "1987-08-14", "keywords": "neo noir,lift skirt,panties,upskirt,mistress", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 35902, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0093640/"}, "author": {"@type": "Person", "name": "rmax304823"}, "dateCreated": "2003-02-02", "inLanguage": "English", "name": "Fast, suspenseful thriller", "reviewBody": "Okay. The plot has more holes than the brain of a cow suffering from bovine spongiform disorder. So what? The whole movie is fast, palatable, and most important of all, not entirely insulting to the viewer. The story has already been described so I won't go into it except to say that it's an improvement over its source, \"The Big Clock,\" and probably the novel that work was based on. It doesn't depend on special effects. There is only one car chase, ending in a foot race, and it's mercifully brief and doesn't end in an exploding fireball. In fact nothing ends in an exploding fireball. Tears of gratitude brim from my eyes, just being able to write that sentence.\n\nThere's a completely unnecessary plot twist at the very end that leaves final developments ambiguously open. But, that aside, and given a bit of effort at the suspension of disbelief, events hang together logically and build on one another. And we follow them tensely as one improbability leads to another. The movie has images that impress themselves on the viewer's perception, willy nilly, whole scenes and little bits of business.\n\nWe have, first of all, Kevin Costner as a naval officer all of us can identify with -- he's smart, heroic, handsome, virile, important, and looks very spiffy in his immaculate white uniform and shoes as he skips or runs full tilt through the sterile corridors of the Pentagon, pursued by devils or by two brainless thugs in dark suits, one of whom sprints in a more than usually awkward manner, his arms flapping gracelessly at his sides. Costner's acting. It's okay. He still sounds and looks like an innocent all-American surfer but he can't help that. Now and then he actually successfully projects the feelings and thoughts of his character. (I couldn't figure out what the gold badge on his uniform was; it looks like neither a submariner's dolphins nor an aviator's wings.) Sean Young -- wow! Has any body, I mean anybody ever been more classically assembled? Her face is full of good bone structure. It has no quirkiness. She's beautiful in the way a painting of a woman would be beautiful if you took a portrait artist, sat him down, and asked him to dream up a pretty woman and get it down on canvas. Her face is an operational definition of \"conventional beauty.\" And it doesn't stop with her face. She exudes a kind of sensuality that seems unaware of its own appeal, only aware of its own needs. She's foxy in the most negligent kind of way, the kind of woman who might not draw the curtains at night -- not because she enjoys showing off but because she just doesn't care. She may not lay waste the countryside as an actress, but doesn't need to. And what she says is believable enough. \n\nGene Hackman is supposed to be a misled good guy. Yet he's guilty of, what?, would it be manslaughter? Womanslaughter? First-degree male chauvinist swinery? His character is supposed to be basically sympathetic, and he and the director play it that way, after establishing him as a politician unwilling to play along with the militarists in Congress. But he's pretty weaselly when you come right down to it -- begging Costner not to give him away, promising him anything -- promotions, better jobs, whatever. And in the end he seems willing to let all the blame fall on his assistant, Will Patton. \n\nIn many ways, it's Patton's movie. Patton is to Hackman more or less what Martin Landau was to James Mason in \"North by Northwest,\" a jealous and protective buffer between his master and the rest of the world. And Patton does a superb job here. After accidentally killing his girl friend, Hackman stumbles into Patton's apartment, needing \"someone to talk to before I go to the police.\" As Hackman spills out his story, Patton hovers over him with a troubled meaningless grin, both his hands fluttering around Hackman's shoulders from behind, as if ready to massage his trapezius. Patton's eyes bulge with surprise and concern. In an earlier scene when Hackman is dressing for a date with Young, Patton carefully brushes some unseen specks from the shoulders of Hackman's dark jacket, preparing his crush for an encounter with his own rival. And watch the expression on Patton's face when he's alone in the gymnasium with George Dzunza and Dzunza spills the beans about Costner's knowing everything. The changes Patton's features undergo are so subtle, the stretched fatuous smile relaxing into the open mouth of utter surprise. What an opportunity for a lesser actor to overplay the reaction, but Patton holds it all in place. That grin turns from idiotic to reassuring in a scene in which Hackman hits Patton in the head with a neatly flung folder full of papers. In context, the actor's natural slight lisp is menacingly telling. We really didn't need Fred Dalton Thompson to inform us in his boring monotone that the character was \"a homosexual.\" I suppose the line was in the script because it was designed to enlighten some elderly folks who may never have left their home in Elko.\n\nIt's a catchy movie. I didn't find the opening that slow. Except I guess I've seen enough heated sexual encounters in the back seats of limos and taxis. This one harks back to Angie Dickinson's scene in DePalma's \"Dressed to Kill.\" Knowing DePalma one wonders if the idea came to him from Hitchcock's oft-repeated fantasy of the woman who acts like a perfect lady until she gets you in the back seat of a taxi and immediately opens your pants. (In Hitchcock's fantasies it was always an icy blonde.) It's worth seeing this, if only to watch the visual imagery, enjoy the acting, and let the narrative take you along in its own exciting way."}, "duration": "PT1H54M", "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi4133272345", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjNkZjQ0ZDAtMGU4ZC00YjhhLTg2YmYtN2YyODVmNDA0OWJlXkEyXkFqcGdeQXJoYW5uYWg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjNkZjQ0ZDAtMGU4ZC00YjhhLTg2YmYtN2YyODVmNDA0OWJlXkEyXkFqcGdeQXJoYW5uYWg@._V1_.jpg", "uploadDate": "2018-09-14T23:09:36Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0000126/?ref_=tt_cl_t1", "name": "Kevin Costner"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0000126?ref_=tt_cl_t1", "name": "Tom Farrell"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000707/?ref_=tt_cl_t3", "name": "Sean Young"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0000707?ref_=tt_cl_t3", "name": "Susan Atwell"}]}, {"actor": {"@type": "Person", "url": "/name/nm0003318/?ref_=tt_cl_t5", "name": "Howard Duff"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0003318?ref_=tt_cl_t5", "name": "Senator Duvall"}]}, {"actor": {"@type": "Person", "url": "/name/nm0076251/?ref_=tt_cl_t7", "name": "Jason Bernard"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0076251?ref_=tt_cl_t7", "name": "Major Donovan"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000669/?ref_=tt_cl_t9", "name": "Fred Thompson"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0000669?ref_=tt_cl_t9", "name": "Marshall"}]}, {"actor": {"@type": "Person", "url": "/name/nm0122036/?ref_=tt_cl_t11", "name": "Dennis Burkley"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0122036?ref_=tt_cl_t11", "name": "Mate"}]}, {"actor": {"@type": "Person", "url": "/name/nm0195968/?ref_=tt_cl_t13", "name": "Chris D."}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0195968?ref_=tt_cl_t13", "name": "Contra #2"}]}, {"actor": {"@type": "Person", "url": "/name/nm0006431/?ref_=tt_cl_t15", "name": "Nicholas Worth"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0006431?ref_=tt_cl_t15", "name": "Cup Breaker"}]}, {"actor": {"@type": "Person", "url": "/name/nm0000432/?ref_=tt_cl_t2", "name": "Gene Hackman"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0000432?ref_=tt_cl_t2", "name": "David Brice"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001599/?ref_=tt_cl_t4", "name": "Will Patton"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0001599?ref_=tt_cl_t4", "name": "Scott Pritchard"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001169/?ref_=tt_cl_t6", "name": "George Dzundza"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0001169?ref_=tt_cl_t6", "name": "Sam Hesselman"}]}, {"actor": {"@type": "Person", "url": "/name/nm0408081/?ref_=tt_cl_t8", "name": "Iman"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0408081?ref_=tt_cl_t8", "name": "Nina Beka"}]}, {"actor": {"@type": "Person", "url": "/name/nm0751762/?ref_=tt_cl_t10", "name": "Leon Russom"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0751762?ref_=tt_cl_t10", "name": "Kevin O'Brien"}]}, {"actor": {"@type": "Person", "url": "/name/nm0068382/?ref_=tt_cl_t12", "name": "Marshall Bell"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0068382?ref_=tt_cl_t12", "name": "Contra #1"}]}, {"actor": {"@type": "Person", "url": "/name/nm0793491/?ref_=tt_cl_t14", "name": "Michael Shillo"}, "character_and_episodes": [{"url": "/title/tt0093640/characters/nm0793491?ref_=tt_cl_t14", "name": "Schiller"}]}]}