{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0075592/", "name": "Tales of the Unexpected", "image": "https://m.media-amazon.com/images/M/MV5BYzE1Nzc0NDQtMzNkNy00NWRiLTk2NzYtMGQ3YjJjMmYxMjI0XkEyXkFqcGdeQXVyMTA3OTEyODI1._V1_.jpg", "genre": ["Comedy", "Drama", "Horror", "Mystery", "Thriller"], "actor": [{"@type": "Person", "url": "/name/nm0001094/", "name": "Roald Dahl"}, {"@type": "Person", "url": "/name/nm0712738/", "name": "Andrew Ray"}, {"@type": "Person", "url": "/name/nm0172310/", "name": "Forbes Collins"}, {"@type": "Person", "url": "/name/nm0426062/", "name": "Richard Johnson"}], "description": "Tales of the Unexpected is a TV series starring Roald Dahl, Andrew Ray, and Forbes Collins. Dramatizations of many Roald Dahl short stories.", "datePublished": "1979-03-24", "creator": {"@type": "Organization", "url": "/company/co0103493/"}, "keywords": "horror host,1970s,1980s,1970s tv,1980s tv", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 1667, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0075592/"}, "author": {"@type": "Person", "name": "TheJiveMaster"}, "dateCreated": "2008-01-15", "inLanguage": "English", "name": "Good stories, shame about the production quality", "reviewBody": "Tales of the Unexpected took the short stories created by Roald Dahl from the book of the same name and others and put them on the small screen. Later on, other writers would be used and Dahl would provide an introduction to each story. This introduction was eventually dropped in favour of a voice over.\n\nThe key to each story was in the ending which originally was usually totally unexpected. The content and the background to each storyline often involved murder, often without holding back some visualisation and this lead to it being broadcast late on Sunday evenings.\n\nThe series suffered from poor production quality. It is likely that the series was shot on video tape which is evident nowadays. The appearance of studio sets is apparent as there is a definite transition between the quality of lighting indoors and for shooting on location. Some of the stories were quite laboured as the introduction of the characters and initial plot creation were quick. This left a large gap of time until the unexpected outcome. The acting was sometimes slow with long pauses in an attempt to spin out time.\n\nDespite it's faults, Tales of the Unexpected managed to attract well known names in asting for episodes and sustained an audience following for 8 years. The stories were varied in their creation and the eventual outcome but eventually the ending could be predicted. In 1988 the series was quitely axed and reruns can now be seen on digital channels in the UK.\n\nIf you can ignore the poor production, it is well worth seeing, even after all these years.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0001094/?ref_=tt_cl_t1", "name": "Roald Dahl"}, "character_and_episodes": [{"url": "/title/tt0075592/characters/nm0001094?ref_=tt_cl_t1", "name": "Self - Introduced by"}, {"url": "#", "name": "29 episodes, 1979-1985"}]}]}