{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt6517320/", "name": "Too Old to Die Young", "image": "https://m.media-amazon.com/images/M/MV5BMDBlYWVjZWItZjc4OS00MTk1LTgzYTgtMDExNjlkNGU4ZjE2XkEyXkFqcGdeQXVyODE1MjMyNzI@._V1_.jpg", "genre": ["Crime", "Drama", "Thriller"], "contentRating": "TV-MA", "actor": [{"@type": "Person", "url": "/name/nm1886602/", "name": "Miles Teller"}, {"@type": "Person", "url": "/name/nm2941877/", "name": "Augusto Aguilera"}, {"@type": "Person", "url": "/name/nm4836100/", "name": "Nell Tiger Free"}, {"@type": "Person", "url": "/name/nm4110608/", "name": "Cristina Rodlo"}], "creator": [{"@type": "Person", "url": "/name/nm3090268/", "name": "Ed Brubaker"}, {"@type": "Person", "url": "/name/nm3090268/", "name": "Ed Brubaker"}, {"@type": "Person", "url": "/name/nm0716347/", "name": "Nicolas Winding Refn"}, {"@type": "Organization", "url": "/company/co0319272/"}], "description": "Too Old to Die Young is a TV mini-series starring Miles Teller, Augusto Aguilera, and Nell Tiger Free. Detective Martin Jones, who leads a double life as a killer for hire in Los Angeles' deadly underground, suffers an existential...", "datePublished": "2019-06-14", "keywords": "auteur tv,vigilantism,underage girlfriend,antihero,strong silent type", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 7141, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "7.4"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt6517320/"}, "author": {"@type": "Person", "name": "TheVictoriousV"}, "dateCreated": "2020-02-18", "inLanguage": "English", "name": "For better or worse, it is very much Refn.", "reviewBody": "When a show is this complete in its aesthetics, but also needlessly unmerciful in how it is paced - by the start, anyway - it can be hard to critique it justly. For Nicolas Winding Refn, the tempo is always part of the neo-noir mood, accentuated by the Cliff Martinez synths and the colored lights that illuminate a shady Los Angeles, then punctuated by gruesome death.\n\nAnd indeed, Refn created something special out of his '80s nostalgia when he directed Drive in 2011. However, with works like Only God Forgives and The Neon Demon, there were problems. Only God Forgives appeared to have less of a point beneath the surface of its languid sadness, and The Neon Demon was also a bit unengaging, which came with the side-effect of making Refn's influences (Lynch, Argento, et al) a little too blatant.\n\nToo Old to Die Young, his contribution to Amazon Prime's library, does have pointlessly, agonizingly slow episodes, though it may be the most aesthetically well-realized Refn project yet, and he does create a mood unique from the works that have visibly inspired him (something that another fan of classic cinema, Panos Cosmatos, succeeded with when making Beyond the Black Rainbow, more so than The Neon Demon, Refn's colorful horror homage). Furthermore, lead actor Miles Teller successfully gives the impression that a complex and damaged human being lies beneath the stoic demeanor.\n\nThe biggest problem is that the first three \"volumes\" are wholly inessential viewing, not only due to the possibly boring pacing (for some, these episodes will still work in terms of mood and visual beauty). Instead, the main issue is that they intentionally function as backstory to the main plot, which arguably doesn't get going until the fourth volume, where Officer Martin Jones (Teller) has joined forces with vigilante Viggo Larsen (John Hawkes) to terminate pedophiles and other decadents around LA.\n\nJones had already been running such errands for local gang leader Damian (Babs Olusanmokun), in exchange for not revealing Jones' involvement in killing the mother of Mexican cartel member Jesus Rojas (Augusto Aguilera), and Larson was already doing hits for the mysterious and possibly extranormal Diana DeYoung (a gorgeous Jena Malone, looking more like Naomi Watts with age). We also learn that Jesus has climbed the ranks within the cartel following the death of its Don, but this can also be surmised without seeing episodes 1-3.\n\nAgain, this is actually \"intentional\". Refn willfully made the first three episodes of the series into prequel material, with the apparent motivation of fixing a problem far more relevant to TV than streaming - he wanted to make a show where it doesn't matter if you \"miss\" the first episodes; a show you can just jump into without needing to catch up. First of all, it's pretty hard to \"miss\" episodes of something in the age of home streaming and binge-watching. Second, if a show is truly great, who cares if there is a lot to catch before you're up to speed?\n\nNonsense like this will make Too Old to Die Young hard to swallow. But it eventually becomes an intriguing deep-dive into the neon-bathed underworld, with characters whose Old Testament-approach to punishment has made them no better than the monsters they hunt. Some levity is also provided when the show introduces Jones' new homicide division colleagues, who put on pro-fascist theater and pull pranks on one other far more than they do police work, and William Baldwin as the creepy father of Jones' suspiciously young fiancee (Nell Tiger Free).\n\nAnd nonetheless, the show remains visually splendid throughout. You can tell Refn doesn't just point and shoot, or light the scenes based solely on how well we can see everything. It is obvious that he's thought about what shade of purple will be reflected on which prop within the frame (while the rest of the image may be completely red), how the outdoor shots will be given a certain feel by traffic lights and police sirens, and even how almost-empty wine glasses are to be arranged on the dinner table in one scene. Even the scenery complies with Refn's use of colors.\n\nThe possibly most gorgeous scene involves the enigmatic Yaritza (Christina Rodlo), bathed in the red-and-purple flashes from outdoor party lights in shots that recall Suspiria. Finally Refn pays homage to that film in a way that works.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "trailer": {"@type": "VideoObject", "name": "Official Trailer", "embedUrl": "/video/imdb/vi1088011545", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BMjdhMDFiOTAtYjk3Yy00YjgwLWJhNGItNzNjZTYwOWUxNzkyXkEyXkFqcGdeQWpnYW1i._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BMjdhMDFiOTAtYjk3Yy00YjgwLWJhNGItNzNjZTYwOWUxNzkyXkEyXkFqcGdeQWpnYW1i._V1_.jpg", "description": "Director Nicolas Winding Refn's new series follows the existential journeys of several characters while exploring the criminal underbelly of Los Angeles.", "uploadDate": "2019-04-05T16:37:14Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm1886602/?ref_=tt_cl_t1", "name": "Miles Teller"}, "character_and_episodes": [{"url": "/title/tt6517320/characters/nm1886602?ref_=tt_cl_t1", "name": "Martin Jones"}, {"url": "#", "name": "10 episodes, 2019"}]}, {"actor": {"@type": "Person", "url": "/name/nm4110608/?ref_=tt_cl_t3", "name": "Cristina Rodlo"}, "character_and_episodes": [{"url": "/title/tt6517320/characters/nm4110608?ref_=tt_cl_t3", "name": "Yaritza"}, {"url": "#", "name": "6 episodes, 2019"}]}, {"actor": {"@type": "Person", "url": "/name/nm0540441/?ref_=tt_cl_t5", "name": "Jena Malone"}, "character_and_episodes": [{"url": "/title/tt6517320/characters/nm0540441?ref_=tt_cl_t5", "name": "Diana"}, {"url": "#", "name": "6 episodes, 2019"}]}, {"actor": {"@type": "Person", "url": "/name/nm2129802/?ref_=tt_cl_t7", "name": "Babs Olusanmokun"}, "character_and_episodes": [{"url": "/title/tt6517320/characters/nm2129802?ref_=tt_cl_t7", "name": "Damian"}, {"url": "#", "name": "5 episodes, 2019"}]}, {"actor": {"@type": "Person", "url": "/name/nm2941877/?ref_=tt_cl_t2", "name": "Augusto Aguilera"}, "character_and_episodes": [{"url": "/title/tt6517320/characters/nm2941877?ref_=tt_cl_t2", "name": "Jesus"}, {"url": "#", "name": "7 episodes, 2019"}]}, {"actor": {"@type": "Person", "url": "/name/nm4836100/?ref_=tt_cl_t4", "name": "Nell Tiger Free"}, "character_and_episodes": [{"url": "/title/tt6517320/characters/nm4836100?ref_=tt_cl_t4", "name": "Janey"}, {"url": "#", "name": "6 episodes, 2019"}]}, {"actor": {"@type": "Person", "url": "/name/nm0370035/?ref_=tt_cl_t6", "name": "John Hawkes"}, "character_and_episodes": [{"url": "/title/tt6517320/characters/nm0370035?ref_=tt_cl_t6", "name": "Viggo"}, {"url": "#", "name": "5 episodes, 2019"}]}, {"actor": {"@type": "Person", "url": "/name/nm4519283/?ref_=tt_cl_t8", "name": "Gino Vento"}, "character_and_episodes": [{"url": "/title/tt6517320/characters/nm4519283?ref_=tt_cl_t8", "name": "Jaime"}, {"url": "#", "name": "5 episodes, 2019"}]}]}