{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt9139220/", "name": "Dracula", "image": "https://m.media-amazon.com/images/M/MV5BNTBmNzM4ZGMtMTE3OC00Mjc4LWE3OGEtYzA3ZmQ1MGJkNjMyXkEyXkFqcGdeQXVyNDk3ODk4OQ@@._V1_.jpg", "genre": ["Drama", "Horror"], "contentRating": "TV-14", "actor": [{"@type": "Person", "url": "/name/nm0051903/", "name": "Claes Bang"}, {"@type": "Person", "url": "/name/nm0920185/", "name": "Dolly Wells"}, {"@type": "Person", "url": "/name/nm6077056/", "name": "Morfydd Clark"}, {"@type": "Person", "url": "/name/nm0034877/", "name": "Jonathan Aris"}], "creator": [{"@type": "Person", "url": "/name/nm0309693/", "name": "Mark Gatiss"}, {"@type": "Person", "url": "/name/nm0595590/", "name": "Steven Moffat"}, {"@type": "Organization", "url": "/company/co0023675/"}, {"@type": "Organization", "url": "/company/co0043107/"}, {"@type": "Organization", "url": "/company/co0144901/"}], "description": "Dracula is a TV mini-series starring Claes Bang, Dolly Wells, and Morfydd Clark. In 1897 Transylvania, the blood-drinking Count draws his plans against Victorian London.", "datePublished": "2020-01-04", "keywords": "tv mini series,year 1897,count dracula,inspired by novel,vampire", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 42143, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.8"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt9139220/"}, "author": {"@type": "Person", "name": "Bertaut"}, "dateCreated": "2021-01-27", "inLanguage": "English", "name": "A sarcastic posthumanist Dracula won't be to everyone's taste, but I thoroughly enjoyed this unique take on the Count", "reviewBody": "Bram Stoker's 1897 novel, Dracula, has seen over 350 adaptations for the screen (big and small), with many of them using the original tex to explore some of the socio-political issues of the day. So, for example, Tod Browning's Dracula (1931) turns the count into an elegant aristocrat analogous to the various monarchs in power across Europe at the time; the nine Hammer Horror films from 1958-1974 are at least partially structured around simple Cold War good/bad-west/east dichotomy politics; Francis Ford Coppola's Dracula (1992), which was made at a time when the media were in the habit of making superstars of criminals, very much leans into the idea of the seductive power of evil. And now we have this latest BBC adaptation, created by Mark Gatiss and Steven Moffat. Running a hefty 270 minutes (divided into three episodes of 90 minutes each), the series seeks to capture the tone of the original novel, if not necessarily the plot. Extremely funny in places, extremely disturbing in others, this is probably the best small screen adaptation since Philip Saville's superb Count Dracula (1977). There are some problems, and fans of the novel have taken especial (and not entirely unjustified) umbrage with the unexpected narrative shift in the last episode, but all in all, helped in no small part by an immense central performance, I thoroughly enjoyed this version.\n\nHungry, 1897; Jonathan Harker (John Heffernan), an English lawyer sent to Transylvania some months prior, has become a shell of a man. Physically deformed and mentally fragile, he is now staying at a small convent. Having written an account of his experiences, Harker is being interviewed by the acerbic Sister Agatha (a superb Dolly Wells), who is hoping he can fill in some of the details he left absent from his document. And so he tells how he came to Transylvania to meet the elderly Dracula (an exceptional Claes Bang having the time of his life), and of the subsequent horrors he experienced.\n\nWhereas the novel begins just before Harker arrives at Castle Dracula, the show begins with him already in a nunnery in Hungry, having fled the castle, and the novel's multi-perspective epistolary narrative is replaced with a more basic single-character flashback-style narration. Opening this way is a wise move, as it alerts the audience immediately that this isn't a 1:1 adaptation. Unfortunately, because the show deviates so much from the novel, and because the third episode is so unexpected and unique, discussing much about the overarching narrative design lends itself to spoilers.\n\nIndeed, the same could also be said of the aesthetics, with each episode looking and feeling substantially different from the other two, but in such a way that to go into detail would spoil the nature of the final episode. In any case, the first episode is your basic gothic horror full of deep shadows, huge towers, labyrinthine interiors, and ominous opulence; the second is a ship-based murder-mystery along the lines of Murder on the Orient Express (except, of course, we all know who the killer is from the start); and the third is a gaudy, postmodernist-infused examination of youthful vapidity, corporate greed, decadence for decadence sake, and the all-conquering power of superficiality. Arwel Jones's production design across all three episodes is simply stunning; from the twisting staircases and dead-end tunnels of Castle Dracula to the weather-beaten Demeter (the doomed ship in the second episode) to Dracula's quite stunning residence in the third episode, everything on screen seems completely real and the world feels legitimately lived in. Costume designer Sarah Arthur also deserves praise, especially for her work in the first episode, where Harker's disintegrating mental and physical state is matched by his increasingly shabby clothing.\n\nAnd there are some really extraordinary visual moments here. A close-up of a fly crawling on an eyeball, for example, which then crawls behind the eyeball is particularly disturbing (indeed flies are a recurring visual motif throughout the show), as is a scene where Dracula quite literally climbs out of a wolf (shot practically on set without any CGI). The exterior shots of Castle Dracula are also amazing, and why wouldn't they be as the show uses the incredible Orava Castle in Slovakia, which was also used for Nosferatu, eine Symphonie des Grauens (1922).\n\nThe acting is also terrific, particularly Bang and Wells, who both get to have tremendous fun; Bang as the sarcastic Count and Wells as perhaps the most irreverent nun ever committed to screen. Much of the strength of their performances comes in how well they handle the incredibly dry humour, of which there is a surprising amount (although Bang can also be truly terrifying when necessary). So, for example, when the convent is surrounded by hundreds of bats, and Agatha is asked \"why would the forces of darkness wish to attack a convent\", to which she replies (completely deadpan), \"perhaps they're sensitive to criticism.\" Dracula also gets in on the comedy. Explaining to Harker how he has had artists paint the sun for him, he then says, \"And Mozart wrote such a pretty little tune\", before mumbling to himself, \"I really should have spared him\". The nonchalant way Bang delivers the line is hilarious, as if it's only just occurred to him (not to mention that it ties into real-world speculation about what actually killed Mozart). Later on, he points out, \"I'm undead - I'm not unreasonable\". As the show goes on, Bang gets to show more of his range, bringing out not just Dracula's confidence and sarcasm, but so too his pride, frustration, boredom, and fears, culminating in an exceptional final scene, with Bang doing some truly wonderful silent acting.\n\nThematically, the show deconstructs much traditional vampire lore, particularly the power of crucifixes. Exactly why Dracula would fear the cross when he doesn't believe in God is a theme that spans all three episodes. Along the same lines, Dracula's immortality is examined in light of the boredom that it must entail and the irony of how a creature of death can't know death itself (\"in a world of travelled roads, death is the last unprinted snow\"). Similar deconstruction of Dracula's need for blood sees it presented more like an addiction than a necessity. And, of course, as in so many vampire movies, the show examines the idea that evil can be seductive, suggesting that if evil is sexy and alluring, if it's attractive, it can be difficult to resist.\n\nAs for problems, many viewers despised the last episode, and I can see why (although I loved it), as it takes things in a wholly new, totally unexpected direction that asks more than a little leap of faith from the audience. Certainly, if the first two episodes form a broadly coherent unit, the third disrupts everything, and is thematically, aesthetically, and tonally divorced from its predecessors. Some of the humour in this episode also pushes things a little too far, with one joke in particular crossing the line into farce. I'm also not sure the show needed to be as long as it is; three 60 minute episodes probably would have sufficed.\n\nThat aside though, I loved this adaptation. Purists' disdain for it is understandable, but to my mind, it captures much of the tonal qualities of the original very well. Much like Coppola's version, it deviates wildly from the book but is made by people who are clearly familiar with the source and respectful of its mythology. Featuring a suitably posthumanist Dracula for our jaded times, Gatiss and Moffat may not have pleased traditionalists, but this is a very fine attempt to bring Dracula into the 21st century without ever losing sight of his origins and raison d'être.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "8"}}, "trailer": {"@type": "VideoObject", "name": "Final Trailer", "embedUrl": "/video/imdb/vi3255680793", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BY2EzMGQyYjUtODBkMS00MjIyLWJlODctOTFlNTQwN2ZmMmJmXkEyXkFqcGdeQXZ3ZXNsZXk@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BY2EzMGQyYjUtODBkMS00MjIyLWJlODctOTFlNTQwN2ZmMmJmXkEyXkFqcGdeQXZ3ZXNsZXk@._V1_.jpg", "description": "He's been around for centuries, but what happens when a worthy adversary bites back? From the makers of \"Sherlock,\" Claes Bang stars as Dracula in this brand-new series inspired by Bram Stoker's classic novel.", "uploadDate": "2020-01-04T15:55:48Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0051903/?ref_=tt_cl_t1", "name": "Claes Bang"}, "character_and_episodes": [{"url": "/title/tt9139220/characters/nm0051903?ref_=tt_cl_t1", "name": "Dracula"}, {"url": "#", "name": "3 episodes, 2020"}]}, {"actor": {"@type": "Person", "url": "/name/nm0920185/?ref_=tt_cl_t2", "name": "Dolly Wells"}, "character_and_episodes": [{"url": "/title/tt9139220/characters/nm0920185?ref_=tt_cl_t2", "name": "Sister Agatha"}, {"url": "#", "name": "3 episodes, 2020"}]}]}