{"@context": "http://schema.org", "@type": "TVSeries", "url": "/title/tt0056757/", "name": "The Fugitive", "image": "https://m.media-amazon.com/images/M/MV5BYzczMTkzZmUtYzc0Mi00ZjIxLWJlZTUtMGMzYjU5ZGMzNTM0XkEyXkFqcGdeQXVyNTA4OTk2MzY@._V1_.jpg", "genre": ["Adventure", "Crime", "Drama", "Thriller"], "actor": [{"@type": "Person", "url": "/name/nm0418148/", "name": "David Janssen"}, {"@type": "Person", "url": "/name/nm0002016/", "name": "William Conrad"}, {"@type": "Person", "url": "/name/nm0607579/", "name": "Barry Morse"}, {"@type": "Person", "url": "/name/nm0083280/", "name": "Paul Birch"}], "creator": [{"@type": "Person", "url": "/name/nm0400403/", "name": "Roy Huggins"}, {"@type": "Organization", "url": "/company/co0068009/"}, {"@type": "Organization", "url": "/company/co0011888/"}], "description": "The Fugitive is a TV series starring David Janssen, William Conrad, and Barry Morse. A doctor, wrongly convicted for a murder he didn't commit, escapes custody and must stay ahead of the police to find the real killer.", "datePublished": "1963-09-17", "keywords": "arizona desert,tucson arizona,arizona,phoenix arizona,bus terminal", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 3395, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "8.1"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0056757/"}, "author": {"@type": "Person", "name": "schappe1"}, "dateCreated": "2004-11-10", "inLanguage": "English", "name": "Four Years in the Twilight Zone", "reviewBody": "According to both my ears and the book 'TV's Biggest Hits' by Jon Burlingame, much of the music we hear in the episodes of the original version of the TV series 'The Fugitive', first appeared on 'The Twilight Zone'. In fact the musical director of 'The Fugitive', once he heard that the show was coming to an end, went up to the late, great, Jerry Goldsmith, who has composed the original tracts when they were used on 'The Twilight Zone', and said 'What's this I hear: they're going to cancel 'our' show!'.\n\nStill, it was an appropriate choice as Richard Kimble spent four years in his own, personal 'Twilight Zone'. If you look at most of the classic episodes of the earlier show, they involve a troubled hero finding himself in a world that doesn't seem to make any sense any more. He convinces himself if he can figure it out, or find a way out of it, things will be OK again. But he never seems to make it- just like so many of our dreams. Kimble's world is shattered by an argument with his wife and her subsequent murder. He's on the run in his own country, now suddenly hostile to him. He has to suppress his emotions and hide his identity while he pursues 'the way out': the one-armed man; and avoids pursuit by Lt. Gerard, the symbol of all his fears. Goldsmith's music was very well used. \n\nI heartily agree with those that rank this as the best TV series ever. Leonard Goldenson was right: it's the best concept for a show ever. Also the best execution. David Janssen's performance is amazing. He's deprived of most of an actor's tools: he keeps his head down and says as little as possible in order to avoid recognition. Yet he conveys this character's feeling perfectly. The tremendous array of guest actors, playing characters in their own little psychological prisons adds great depth to the show. The directing was sharp, well-paced and uncluttered with too many obvious 'techniques'. The writing was consistently good. Pete Rugolo's wonderful main musical theme could be played allegro for excitement or largo for poignancy- and this was the most poignant show ever. It was about psychological alienation. The only other shows I can think of that reached this deep were 'The Twilight Zone' and, occasionally, 'Star Trek'.\n\nThis was one of the few classic TV shows of which a movie version was later made that was any good at all. Roy Huggins, the creator of the show, had some input into the Harrison Ford film. That film, compared to the TV show, is rich in money, production values and excitement. It has flashes of characterization that give the action more meaning than most modern day flicks. However the TV was rich in time, with four years of hour long episodes to tell all its various stories. In the end that made it far more moving. If only the film could have been the ending of the TV show, ('The Judgment' is not really all that good, despite its historical ratings).\n\nMy dream ending for the show is Kimble leaving the courthouse and suddenly finding himself surrounded by the women who fell in love with him in all his travels, and then running down the street to escape from them! Actually, I think it would have been nice if he found Vera Miles and the boy from 'Fear in Desert City' waiting for him. That would have been the most poetic ending of all. I wonder what Goldsmith might have written for that."}, "trailer": {"@type": "VideoObject", "name": "ABC Promo Trailer", "embedUrl": "/video/imdb/vi293781785", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BNWFkMzJhOTYtYzAzOS00NDVjLTkxMTMtZWQxM2I5NzhlZDE3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BNWFkMzJhOTYtYzAzOS00NDVjLTkxMTMtZWQxM2I5NzhlZDE3XkEyXkFqcGdeQXRyYW5zY29kZS13b3JrZmxvdw@@._V1_.jpg", "description": "A doctor, wrongly convicted for a murder he didn't commit, escapes custody and must stay ahead of the police to find the real killer.", "uploadDate": "2020-10-05T09:27:34Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0418148/?ref_=tt_cl_t1", "name": "David Janssen"}, "character_and_episodes": [{"url": "/title/tt0056757/characters/nm0418148?ref_=tt_cl_t1", "name": "Dr. Richard Kimble"}, {"url": "#", "name": "120 episodes, 1963-1967"}]}, {"actor": {"@type": "Person", "url": "/name/nm0607579/?ref_=tt_cl_t3", "name": "Barry Morse"}, "character_and_episodes": [{"url": "/title/tt0056757/characters/nm0607579?ref_=tt_cl_t3", "name": "Lt. Philip Gerard"}, {"url": "#", "name": "119 episodes, 1963-1967"}]}, {"actor": {"@type": "Person", "url": "/name/nm0002016/?ref_=tt_cl_t2", "name": "William Conrad"}, "character_and_episodes": [{"url": "/title/tt0056757/characters/nm0002016?ref_=tt_cl_t2", "name": "Narrator"}, {"url": "#", "name": "2 episodes, 1963-1967"}]}]}