{"@context": "http://schema.org", "@type": "Movie", "url": "/title/tt0064757/", "name": "On Her Majesty's Secret Service", "image": "https://m.media-amazon.com/images/M/MV5BZGFlNGNiMmQtMThhZS00MWMxLWFiNGItZTM4ZmJlODM3ZmU2XkEyXkFqcGdeQXVyNDY2MTk1ODk@._V1_.jpg", "genre": ["Action", "Adventure", "Thriller"], "contentRating": "PG", "actor": [{"@type": "Person", "url": "/name/nm0493872/", "name": "George Lazenby"}, {"@type": "Person", "url": "/name/nm0001671/", "name": "Diana Rigg"}, {"@type": "Person", "url": "/name/nm0001699/", "name": "Telly Savalas"}, {"@type": "Person", "url": "/name/nm0275213/", "name": "Gabriele Ferzetti"}], "director": {"@type": "Person", "url": "/name/nm0402597/", "name": "Peter R. Hunt"}, "creator": [{"@type": "Person", "url": "/name/nm0712362/", "name": "Simon Raven"}, {"@type": "Person", "url": "/name/nm0537363/", "name": "Richard Maibaum"}, {"@type": "Person", "url": "/name/nm0001220/", "name": "Ian Fleming"}, {"@type": "Organization", "url": "/company/co0054040/"}], "description": "On Her Majesty's Secret Service is a movie starring George Lazenby, Diana Rigg, and Telly Savalas. James Bond woos a mob boss' daughter and goes undercover to uncover the true reason for Ernst Stavro Blofeld's allergy research in...", "datePublished": "1969-12-13", "keywords": "007,bond girl,ski chase,returning character with different actor,criminal mastermind", "aggregateRating": {"@type": "AggregateRating", "ratingCount": 82223, "bestRating": "10.0", "worstRating": "1.0", "ratingValue": "6.7"}, "review": {"@type": "Review", "itemReviewed": {"@type": "CreativeWork", "url": "/title/tt0064757/"}, "author": {"@type": "Person", "name": "Orpington"}, "dateCreated": "2004-08-17", "inLanguage": "English", "name": "Not perfect, but a realistic, classic Bond", "reviewBody": "On Her Majesty's Secret Service will probably always remain the most controversial entry in the Bond series, thanks both to its unusually human and romantic story, and the notorious casting of novice actor George Lazenby as OO7. Some think these elements ruin the film, while others hail OHMSS as the best Bond ever. I wouldn't go that far in my praise, but for me this is still one of the classic Bond films, true to Ian Fleming's original vision and arguably showing OO7 in a more realistic light than any other film in the franchise.\n\nTo get the Lazenby issue out of the way first, it is certainly true to say that he lacks the charisma of the man he (temporarily) replaced, Sean Connery, and his impossibly chiselled jaw is somewhat irritating. However, he does look the part, and for a first-time actor he turns in a remarkably assured performance, particularly in the fight scenes but also in Bond's more tender moments, most notably in the highly emotional finale. If Lazenby had gone on to make more Bond films (and it was his own decision not to do so) he could well have developed into a very fine OO7, but as it is I still find his performance in OHMSS perfectly acceptable, and not damaging to the film in any way.\n\nThe film itself represented a conscious attempt to get back to Fleming after the increasingly extravagant antics of Thunderball and You Only Live Twice. Director Peter Hunt, who had edited the classic early Connery films, was very keen to remain faithful to Fleming's original story, and as a result OHMSS has an unusually strong emphasis on character and plot, with the gadgetry and humour found in most Bond films largely jettisoned. Rather like From Russia with Love, OHMSS feels like a real spy adventure, as Bond tracks Blofeld down and even adopts a disguise as he infiltrates his arch-enemy's Alpine hideaway, Piz Gloria. Where this film is unique, however, is in the level of emotion it invests in OO7's relationships with others. We see this early in the film when Bond quarrels with M and submits his resignation, a sequence which really brings out the affection which both M and Moneypenny have for him, but which M especially prefers to keep concealed. This affection is brought out again near the end during Bond and Tracy's wedding, when Q sheds his normal exasperation and shows us his fondness and respect for OO7.\n\nHowever, it is of course the relationship between Bond and Tracy which gives the film its emotional heart. OHMSS sees Bond fall genuinely in love for the first and only time, and personally I found the film's romantic scenes both tender and touching, particularly for being so unexpected in a Bond film. The casting of Diana Rigg as Tracy helps immeasurably in making us believe in this romance, as she is a rare example of a proper actress taking on the role of a Bond girl, and her dynamic, spirited performance makes it easy to see why Bond would fall for her and marry her. It also helps the film's tragic conclusion, itself unique in the Bond franchise, pack far more of an emotional punch than might otherwise have been the case.\n\nOf course, the film has more going for it than just an unusually human Bond.\n\nHunt directs with great skill, and the Alpine scenery that dominates the film looks absolutely stunning. There is no shortage of great action either, the highlights being a tense and gripping ski chase and an equally thrilling bobsleigh pursuit. Telly Savalas makes for a very effective Blofeld, understated and sinister, and his Rosa Klebb-like henchwoman Irma Bunt is played with relish by Ilse Steppat. There are also echoes of FRWL in the character of Draco, Tracy's father, who is a charismatic Bond ally in the style of Kerim Bey. Special mention should be given to John Barry, who produced his greatest Bond soundtrack for OHMSS. The opening instrumental theme, with its sombre and foreboding tone, sets the serious mood of the film, while the classic We Have All the Time in the World, sung by Louis Armstrong, is the perfect soundtrack to Bond and Tracy's doomed love.\n\nHowever, while OHMSS is undoubtedly a classic Bond film, it just falls short of my personal top five for two principal reasons. The first of these is that the film is too long, primarily because the central section, where Bond infiltrates Piz Gloria in disguise, is dragged out for far longer than was necessary. Blofeld's plan to use beautiful women as carriers of a devastating eco-virus is the other main weakness, because it is totally preposterous and does not fit into the film's serious nature. I must admit also that, good as Lazenby is, I do wish Connery had agreed to make this film, because with him on board, and a little more editing, I think it could have been the best Bond ever, even beating FRWL. As it is, OHMSS is still a very strong film, its bold deviations from the Bond formula paying off handsomely. It is just a crying shame that it did not perform better at the Box Office, because this would encourage the Bond producers to shift to the high-camp, comic style that would dominate the franchise during the 1970s; sadly, it would be more than a decade before a serious, Flemingesque Bond would reappear on the big screen.", "reviewRating": {"@type": "Rating", "worstRating": "1", "bestRating": "10", "ratingValue": "7"}}, "duration": "PT2H22M", "trailer": {"@type": "VideoObject", "name": "On Her Majestys Secret Service", "embedUrl": "/video/imdb/vi2996871705", "thumbnail": {"@type": "ImageObject", "contentUrl": "https://m.media-amazon.com/images/M/MV5BOTc1MjIxN2MtMTk1MS00MmZjLWE3MTctYzVmMWMxOTdkZjE4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg"}, "thumbnailUrl": "https://m.media-amazon.com/images/M/MV5BOTc1MjIxN2MtMTk1MS00MmZjLWE3MTctYzVmMWMxOTdkZjE4XkEyXkFqcGdeQXVyNzU1NzE3NTg@._V1_.jpg", "description": "Trailer for On Her Majestys Secret Service", "uploadDate": "2012-05-11T03:24:03Z"}, "cast_and_character": [{"actor": {"@type": "Person", "url": "/name/nm0493872/?ref_=tt_cl_t1", "name": "George Lazenby"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0493872?ref_=tt_cl_t1", "name": "James Bond"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001699/?ref_=tt_cl_t3", "name": "Telly Savalas"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0001699?ref_=tt_cl_t3", "name": "Blofeld"}]}, {"actor": {"@type": "Person", "url": "/name/nm0827375/?ref_=tt_cl_t5", "name": "Ilse Steppat"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0827375?ref_=tt_cl_t5", "name": "Irma Bunt"}]}, {"actor": {"@type": "Person", "url": "/name/nm0048468/?ref_=tt_cl_t7", "name": "George Baker"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0048468?ref_=tt_cl_t7", "name": "Sir Hilary Bray"}]}, {"actor": {"@type": "Person", "url": "/name/nm0395420/?ref_=tt_cl_t9", "name": "Bernard Horsfall"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0395420?ref_=tt_cl_t9", "name": "Campbell"}]}, {"actor": {"@type": "Person", "url": "/name/nm0096796/?ref_=tt_cl_t11", "name": "Yuri Borienko"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0096796?ref_=tt_cl_t11", "name": "Grunther"}]}, {"actor": {"@type": "Person", "url": "/name/nm0156188/?ref_=tt_cl_t13", "name": "Geoffrey Cheshire"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0156188?ref_=tt_cl_t13", "name": "Toussaint"}]}, {"actor": {"@type": "Person", "url": "/name/nm0609880/?ref_=tt_cl_t15", "name": "Terence Mountain"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0609880?ref_=tt_cl_t15", "name": "Raphael"}]}, {"actor": {"@type": "Person", "url": "/name/nm0001671/?ref_=tt_cl_t2", "name": "Diana Rigg"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0001671?ref_=tt_cl_t2", "name": "Tracy"}]}, {"actor": {"@type": "Person", "url": "/name/nm0275213/?ref_=tt_cl_t4", "name": "Gabriele Ferzetti"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0275213?ref_=tt_cl_t4", "name": "Draco"}]}, {"actor": {"@type": "Person", "url": "/name/nm0561755/?ref_=tt_cl_t6", "name": "Lois Maxwell"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0561755?ref_=tt_cl_t6", "name": "Moneypenny"}]}, {"actor": {"@type": "Person", "url": "/name/nm0496866/?ref_=tt_cl_t8", "name": "Bernard Lee"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0496866?ref_=tt_cl_t8", "name": "'M'"}]}, {"actor": {"@type": "Person", "url": "/name/nm0005155/?ref_=tt_cl_t10", "name": "Desmond Llewelyn"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0005155?ref_=tt_cl_t10", "name": "'Q'"}]}, {"actor": {"@type": "Person", "url": "/name/nm0636075/?ref_=tt_cl_t12", "name": "Virginia North"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0636075?ref_=tt_cl_t12", "name": "Olympe"}]}, {"actor": {"@type": "Person", "url": "/name/nm0020590/?ref_=tt_cl_t14", "name": "Irvin Allen"}, "character_and_episodes": [{"url": "/title/tt0064757/characters/nm0020590?ref_=tt_cl_t14", "name": "Che Che"}]}]}